{
    "version": "1.1",
    "description": "Coach personas for Lesson 0 story generation. High CRO - pain stories match exact niche pain points.",
    "coaches": {
        "sarah": {
            "name": "Sarah Mitchell",
            "title": "Lead Functional Medicine Coach & Curriculum Director",
            "avatar": "/coaches/sarah-mitchell.webp",
            "age": 42,
            "location": "Austin, Texas",
            "niches": [
                "functional-medicine",
                "womens-hormones",
                "integrative-medicine",
                "holistic-nutrition"
            ],
            "pixelIds": [
                "SarahFunctionalMedicine",
                "SarahWomensHormones",
                "SarahIntegrativeMedicine"
            ],
            "painStory": "I was a single mom of 3, working 60-hour weeks as an ER nurse. My thyroid was shot, my adrenals were fried, and I gained 40 pounds in two years. Doctors handed me prescriptions for antidepressants and told me 'that's just what happens after 40.' I was exhausted, foggy, and my hair was falling out in clumps. I felt like my body was betraying me.",
            "transformationStory": "Functional medicine saved my life. I learned about root cause protocols—gut health, hormone balancing, micronutrient optimization. Within 4 months, I lost 35 pounds, my brain fog lifted, and my thyroid normalized WITHOUT medication. I became obsessed with helping other women escape the conventional medicine trap.",
            "winningNow": "Today I run a virtual functional medicine coaching practice earning $14,800/month. I've helped 400+ women reverse autoimmune symptoms, balance hormones naturally, and finally feel like themselves again. I work from home and never miss my kids' events.",
            "monthlyIncome": 14800,
            "clientsHelped": 400,
            "personalQuote": "Your symptoms are not 'normal for your age.' Your body is sending signals—and I'll teach you how to decode them."
        },
        "olivia": {
            "name": "Olivia Reyes",
            "title": "Senior Trauma Recovery & Neurodiversity Coach",
            "avatar": "/coaches/olivia-reyes.webp",
            "age": 38,
            "location": "Denver, Colorado",
            "niches": [
                "narc-abuse-recovery",
                "narcissistic-abuse",
                "adhd-support",
                "neurodiversity",
                "grief-loss",
                "trauma-recovery"
            ],
            "pixelIds": [
                "OliviaNarcTrauma",
                "OliviaNeurodiversity",
                "OliviaGriefEndoflife"
            ],
            "painStory": "I spent 12 years married to a covert narcissist. The gaslighting was so insidious I thought I was going crazy. He isolated me from everyone. After the divorce, I had C-PTSD, panic attacks, and couldn't trust my own perception of reality. Then I lost my father—my only remaining safe person—to cancer. The grief broke something in me. I later learned my 'emotional dysregulation' was actually undiagnosed ADHD masked by trauma.",
            "transformationStory": "Recovery wasn't linear. But I became a trauma-informed coach because I refused to let other survivors suffer in silence like I did. I specialize in helping women recognize covert abuse patterns, rebuild their shattered sense of self, and embrace their neurodivergent brains as superpowers.",
            "winningNow": "Now I earn $11,200/month helping survivors escape narcissistic abuse and build lives beyond trauma. I've supported 280+ women through the recovery process, and I speak internationally on the hidden epidemic of covert narcissistic abuse.",
            "monthlyIncome": 11200,
            "clientsHelped": 280,
            "personalQuote": "You're not crazy, you're not too sensitive, and you're not making it up. You survived something real—now let's help you thrive."
        },
        "luna": {
            "name": "Luna Sinclair",
            "title": "Energy Healing & Sacred Intimacy Guide",
            "avatar": "/coaches/luna-sinclair.webp",
            "age": 35,
            "location": "Sedona, Arizona",
            "niches": [
                "energy-healing",
                "spiritual-awakening",
                "sex-intimacy",
                "sacred-sexuality",
                "reiki"
            ],
            "pixelIds": [
                "LunaSpiritualEnergy",
                "LunaSexIntimacy"
            ],
            "painStory": "I was completely disconnected from my body. Years of pushing down emotions, living in my head, numbing through work. I couldn't feel pleasure. My marriage was sexless—not because we didn't try, but because I would literally dissociate during intimacy. Doctor after doctor told me nothing was physically wrong. I felt broken in a way no one could see.",
            "transformationStory": "A somatic healer introduced me to energy work. The first time I felt my own chi move through my body, I sobbed for an hour. I trained in Reiki, Tantra, and breathwork. I healed my sexual trauma layer by layer and reconnected to pleasure as a birthright. My marriage transformed. I knew I had to bring this work to other women.",
            "winningNow": "Today I guide women and couples through energetic and intimate reconnection, earning $16,500/month. I've helped 350+ clients heal sexual trauma, reignite dead bedrooms, and experience embodied pleasure many thought was impossible for them.",
            "monthlyIncome": 16500,
            "clientsHelped": 350,
            "personalQuote": "Your body holds ancient wisdom and stored pain. When we release what's stuck, pleasure and vitality flow naturally."
        },
        "maya": {
            "name": "Maya Chen",
            "title": "Mindfulness & Emotional Freedom Specialist",
            "avatar": "/coaches/maya-chen.webp",
            "age": 44,
            "location": "Portland, Oregon",
            "niches": [
                "meditation-mindfulness",
                "mindfulness",
                "eft-tapping",
                "tapping",
                "anxiety-relief",
                "stress-management"
            ],
            "pixelIds": [
                "MayaMindfulness",
                "MayaTherapyModalities"
            ],
            "painStory": "Anxiety ran my life for 15 years. Racing thoughts at 3am. Panic attacks in grocery stores. I tried SSRIs, benzos, CBD—nothing gave lasting relief. As an Asian-American woman, my family's solution was 'just don't think about it.' I felt defective, weak, and ashamed of my nervous system.",
            "transformationStory": "EFT Tapping was my miracle. The first session, I physically felt anxiety drain from my chest. It was bizarre and beautiful. I became certified in multiple modalities—tapping, meditation, breathwork—and started teaching anxious women how to regulate their nervous systems naturally, without medication dependency.",
            "winningNow": "Now I help chronic anxiety sufferers find peace without pills, earning $9,800/month. I've guided 200+ clients to reduce or eliminate anxiety medication, and my tapping tutorials have been viewed 2 million times on YouTube.",
            "monthlyIncome": 9800,
            "clientsHelped": 200,
            "personalQuote": "Anxiety isn't a personality flaw—it's a nervous system pattern. And patterns can be rewired."
        },
        "emma": {
            "name": "Emma Thompson",
            "title": "Conscious Parenting & Birth Support Coach",
            "avatar": "/coaches/emma-thompson.webp",
            "age": 39,
            "location": "Nashville, Tennessee",
            "niches": [
                "conscious-parenting",
                "parenting",
                "birth-doula",
                "fertility-support",
                "prenatal",
                "postpartum"
            ],
            "pixelIds": [
                "EmmaParenting",
                "EmmaFertilityBirth"
            ],
            "painStory": "Five years of infertility nearly destroyed me. Every baby shower was torture. Every 'when are you having kids?' felt like a knife. When IVF finally worked, I was so traumatized I couldn't enjoy the pregnancy. A traumatic emergency C-section led to severe postpartum depression. I couldn't bond with the baby I'd prayed for. I yelled at my toddler and felt like a monster. Nothing about motherhood looked like what I'd imagined.",
            "transformationStory": "A postpartum doula helped me heal the birth trauma. Conscious parenting work helped me break generational patterns. I realized millions of women needed support through this journey—not judgment, not advice from their mother-in-law—real, trained, trauma-informed support.",
            "winningNow": "Today I support families from fertility through early parenting, earning $12,400/month. I've attended 85+ births as a doula and coached 150+ parents through conscious, connected parenting. I help moms stop the yelling and start the connection.",
            "monthlyIncome": 12400,
            "clientsHelped": 150,
            "personalQuote": "You can't pour from an empty cup—and motherhood empties you daily. Let me help you refill."
        },
        "bella": {
            "name": "Bella Martinez",
            "title": "Holistic Pet Wellness & Animal Nutrition Specialist",
            "avatar": "/coaches/bella-martinez.webp",
            "age": 36,
            "location": "San Diego, California",
            "niches": [
                "pet-wellness",
                "animal-nutrition",
                "pet-behavior"
            ],
            "pixelIds": [
                "BellaPetWellness"
            ],
            "painStory": "My golden retriever Cooper was diagnosed with lymphoma at age 6. The vet gave him 3 months. He was my everything—my support after my divorce, my reason to get out of bed. I refused to just wait for him to die. I researched obsessively: raw feeding, supplements, detox protocols, medicinal mushrooms. I changed everything.",
            "transformationStory": "Cooper lived another 4 years and 2 months. That 'miracle' taught me that our pets' health is in our hands—far more than conventional vets admit. I got certified in animal nutrition and holistic pet care. Word spread. Pet parents started paying me to do for their animals what I did for Cooper.",
            "winningNow": "Now I run a holistic pet wellness practice earning $8,600/month. I've helped 180+ pet families extend their animals' lives through nutrition, natural remedies, and preventive protocols. Three organic pet brands consult with me on formulations.",
            "monthlyIncome": 8600,
            "clientsHelped": 180,
            "personalQuote": "Your vet's diagnosis isn't always the final word. There's so much you can do to give your baby more quality years."
        },
        "sage": {
            "name": "Sage Hawkins",
            "title": "Clinical Herbalist & Plant Medicine Educator",
            "avatar": "/coaches/sage-hawkins.webp",
            "age": 52,
            "location": "Asheville, North Carolina",
            "niches": [
                "herbalism",
                "natural-remedies",
                "plant-medicine",
                "clinical-herbalism"
            ],
            "pixelIds": [
                "SageHerbalism"
            ],
            "painStory": "By 45, I was on five medications: blood pressure, cholesterol, antidepressant, acid reflux, and sleep aid. Every year, they added another. I'd forgotten my Appalachian grandmother was a 'root woman' who healed our whole holler with plants. Modern medicine had me chasing symptoms with pills while my body got sicker and my soul got number.",
            "transformationStory": "I went back to my roots—literally. Started growing herbs, making tinctures, remembering grandmother's formulas. Under a naturopath's supervision, I weaned off every medication in 18 months. Blood work improved. Depression lifted. People started asking what I was doing. I started teaching.",
            "winningNow": "Today I teach herbalism and create custom protocols, earning $7,900/month. I've trained 120+ students in plant medicine and helped 90+ clients reduce pharmaceutical dependency. My grandmother's wisdom lives on through my work.",
            "monthlyIncome": 7900,
            "clientsHelped": 120,
            "personalQuote": "Your great-grandmother knew things that modern medicine has forgotten. The plants are still here—you just need to remember how to use them."
        },
        "grace": {
            "name": "Grace Williams",
            "title": "Faith-Based Life Coach & Christian Women's Mentor",
            "avatar": "/coaches/grace-williams.webp",
            "age": 48,
            "location": "Atlanta, Georgia",
            "niches": [
                "christian-coaching",
                "faith-based",
                "biblical-counseling",
                "christian-life-coach"
            ],
            "pixelIds": [
                "GraceFaithBased"
            ],
            "painStory": "I was a pastor's wife for 20 years—the 'perfect' Christian woman. Smiling in the front pew while silently battling depression. Then my husband had an affair with a worship leader. My faith shattered. I felt betrayed by my husband, my church, and God Himself. At 45, I was divorced, jobless, and didn't know who I was outside of being 'Pastor's wife.'",
            "transformationStory": "In the rubble, I rebuilt my faith on MY relationship with God—not the church's version. I realized countless Christian women were suffering in silence, afraid to admit their marriages, their doubts, their pain. I trained as a life coach to become the support I never had.",
            "winningNow": "Now I coach Christian women through crisis, divorce, and faith reconstruction, earning $10,100/month. I've held sacred space for 175+ women navigating the intersection of faith and real life. My private community has 400+ women healing together.",
            "monthlyIncome": 10100,
            "clientsHelped": 175,
            "personalQuote": "God isn't found in perfect church attendance. He meets you in your mess—and that's where real faith begins."
        },
        "rachel": {
            "name": "Rachel Kim-Davis",
            "title": "LGBTQ+ Affirming Wellness & Life Coach",
            "avatar": "/coaches/rachel-kim-davis.webp",
            "age": 34,
            "location": "Seattle, Washington",
            "niches": [
                "lgbtq-coaching",
                "inclusive-wellness",
                "lgbtq-affirming",
                "identity-support"
            ],
            "pixelIds": [
                "RachelInclusiveWellness"
            ],
            "painStory": "Coming out at 23 meant losing my Korean immigrant family. My mother said I was dead to her. I spent two years in conversion therapy that left me suicidal. When I finally accepted myself at 28, I had no community, no family, and a bone-deep shame that talk therapy barely touched. I'd look at happy queer couples and wonder if I was too broken to ever have that.",
            "transformationStory": "Queer-affirming coaching saved me. But I noticed a gap: most wellness spaces weren't truly inclusive compared to mainstream coaches. I became the coach I needed—someone who understood intersectional identity, family estrangement, and cultural shame without needing it explained.",
            "winningNow": "Today I specialize in coaching LGBTQ+ individuals through coming out, family relationships, and identity reclamation. I earn $9,400/month and have supported 140+ clients. I reconciled with my mother last year—the work I do heals generationally.",
            "monthlyIncome": 9400,
            "clientsHelped": 140,
            "personalQuote": "You don't have to choose between your identity and your family's love. There are paths to both—and I'll help you find yours."
        }
    },
    "nicheMapping": {
        "functional-medicine": "sarah",
        "functional-medicine-practitioner": "sarah",
        "womens-hormones": "sarah",
        "womens-hormone-health": "sarah",
        "integrative-medicine": "sarah",
        "holistic-nutrition": "sarah",
        "gut-health": "sarah",
        "autoimmune": "sarah",
        "thyroid": "sarah",
        "narc-abuse-recovery": "olivia",
        "narcissistic-abuse": "olivia",
        "narcissistic-abuse-recovery": "olivia",
        "adhd-support": "olivia",
        "adhd": "olivia",
        "neurodiversity": "olivia",
        "grief-loss": "olivia",
        "grief-and-loss": "olivia",
        "grief": "olivia",
        "trauma-recovery": "olivia",
        "trauma": "olivia",
        "ptsd": "olivia",
        "energy-healing": "luna",
        "energy-healing-practitioner": "luna",
        "spiritual-awakening": "luna",
        "sex-intimacy": "luna",
        "sacred-sexuality": "luna",
        "reiki": "luna",
        "chakra": "luna",
        "tantra": "luna",
        "meditation-mindfulness": "maya",
        "mindfulness": "maya",
        "meditation": "maya",
        "eft-tapping": "maya",
        "tapping": "maya",
        "eft": "maya",
        "anxiety-relief": "maya",
        "anxiety": "maya",
        "stress-management": "maya",
        "breathwork": "maya",
        "conscious-parenting": "emma",
        "parenting": "emma",
        "birth-doula": "emma",
        "doula": "emma",
        "fertility-support": "emma",
        "fertility": "emma",
        "prenatal": "emma",
        "postpartum": "emma",
        "pregnancy": "emma",
        "pet-wellness": "bella",
        "pet-wellness-specialist": "bella",
        "animal-nutrition": "bella",
        "pet-behavior": "bella",
        "pet-health": "bella",
        "dog-wellness": "bella",
        "cat-wellness": "bella",
        "herbalism": "sage",
        "clinical-herbalism": "sage",
        "clinical-herbalist": "sage",
        "natural-remedies": "sage",
        "plant-medicine": "sage",
        "herbal-medicine": "sage",
        "christian-coaching": "grace",
        "christian-life-coach": "grace",
        "faith-based": "grace",
        "faith-based-coaching": "grace",
        "biblical-counseling": "grace",
        "christian": "grace",
        "lgbtq-coaching": "rachel",
        "lgbtq-affirming": "rachel",
        "lgbtq-affirming-life-coach": "rachel",
        "inclusive-wellness": "rachel",
        "identity-support": "rachel",
        "lgbtq": "rachel",
        "queer-affirming": "rachel"
    }
}