[
  {
    "firstName": "Leonora",
    "lastName": "McClelland Sandridge",
    "content": "I want to help people learn how to heal themselves. As a health coach I can help people understand proper nutrition practices and health protocols to ensure a healthy lifestyle.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/1000009537.jpg"
  },
  {
    "firstName": "Vicki",
    "lastName": "Robinson",
    "content": "I think we’ve covered this before enrollment! 😊 I have to say that your personal attention to my inquiry was a large part of my decision to take this step. I truly feel supported. In a nutshell, in order to care for my husband currently undergoing chemotherapy for colorectal cancer, I had to leave my job at the hospital as an Ultrasound technologist in May this year. I’d really love to build on my healthcare background to help people struggling with health problems while staying home with him at this time. Who knows what the future will bring!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/linkedin-2024.jpg"
  },
  {
    "firstName": "Diane",
    "lastName": "Bartiromo",
    "content": "I am a retired nurse who has experienced a lot of different types of nursing and all were good. Now retired I was looking for something to fill the void that was part of my life for 40 years. Whatever I was searching for was not to include a 5 AM alarm, a 2 hour a day commute, and no weekends or holidays. Don't misunderstand though, I do not mind putting my heart and soul into my work. At this point of my life I would like it to be on my terms not to be so selfish. I am a certified health coach. I passed the exam last year but have not worked at this yet. I put things in place but have not marketed and so on. Your introduction was very interesting. I am someone who loves to evaluate and analyze things. I love to problem solve. Although I love many aspects of nursing, I truly love working with behavioral health or women's health. I decided that this may be what I need to move forward, and am hoping that this will take me where I want to go. Unfortunately now older, I can see it is harder for me to learn than when younger. I will need to put in the extra but that is fine with me. With the holidays coming I may be limited on some time since we will be going away for a week and having family visit for another week but I will certainly do my best. Thank. you for letting me express myself.   Diane",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_3542-Profile-Picture-Updated.jpg"
  },
  {
    "firstName": "Kelly",
    "lastName": "McMahon",
    "content": "I’m an ARNP of 25 years and am completely burned out on traditional healthcare dictated by health insurance agencies. I want to be paid what my knowledge and experience is worth. In order to do that, I need to learn your process.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1335.jpeg"
  },
  {
    "firstName": "Suzette",
    "lastName": "Burke Solomon",
    "content": "I am a Registered Nurse working in Med-Surg at an Acute Care Hospital, with 12-hour shifts. I was recently diagnosed with breast cancer and strongly believe that if I were able to do all the things your course is offering, I would have been better able to help myself. So, here I am hungry and thirsty to learn all I can so I can help myself and others.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1235.jpeg"
  },
  {
    "firstName": "Bonnie",
    "lastName": "Riley",
    "content": "This program felt like something I could do that would help others as well as myself. This is an area that I find interesting and now is the right time to take the leap into this. I feel it's a field people would benefit from, but aren't aware is out there. I want to be that person who provides what they need to move on to better health",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/89C2493E-DCEC-43FB-9A61-1FB969E45B6F_1_105_c.jpeg"
  },
  {
    "firstName": "Victoria",
    "lastName": "Habitzruther",
    "content": "I’ve been thinking about doing something like this for years.  I’ve looked into other options, but couldn’t afford it as I had kids still at home.  I have hashimotos and am into post menopause.  My “naturopathic “ dr wants to put me on bhrt - but can not really explain how it can help me… besides telling me it will help with my fatigue.  I really want to learn about myself, and also root causes.  And help others if I can get the confidence in myself.  Thank you for making this affordable!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Cover-photo-for-Functional-Wellness.jpg"
  },
  {
    "firstName": "Lisa",
    "lastName": "Gagliano",
    "content": "I’m a nurse, very disappointed in the sick care healthcare protocols. I’ve been trying to talk to people about nutrition lifestyle changes for years. And I’ve been hearing that functional medicine is the way to go to get to the root cause of problems. I’m tired of hospital doctors just putting Band-Aids on everything Basically symptom management. And all the specialist in the hospitals don’t seem to integrate well together between their treatments and medications with constant interactions and adverse side effects. I’m sick of it. ! I want real solutions and to get people out of the hospitals for good!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/mini-diploma-functional-medicine.jpeg"
  },
  {
    "firstName": "Belinda",
    "lastName": "Williamson",
    "content": "There is a tremendous amount of alternative choices in wellness.   My passion to share the resources I’ve discovered over the last few years continues to grow as I look to expand my business and continue to delve into longevity.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Integrative-Health.jpeg"
  },
  {
    "firstName": "Vanessa",
    "lastName": "Williams",
    "content": "I wanted to learn something new",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/AI_Headshot_Generator-13.jpg"
  },
  {
    "firstName": "Apollo",
    "lastName": "Peoples",
    "content": "Seems like a pretty close step to practicing as an FNP and quicker. The next degree I had planned to pursue",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/LeezaRhttilthead.jpg"
  },
  {
    "firstName": "Teresa",
    "lastName": "Rowan",
    "content": "I’m passionate about Health",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Head-shot-dark-background-1.jpg"
  },
  {
    "firstName": "Olivia",
    "lastName": "Fallon",
    "content": "I’m a hormone health coach and would love to be able to understand labs so I can support my clients better. I have a lady with thyroid issues so your program sounds too good to be true!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Head-shot-dark-background.jpg"
  },
  {
    "firstName": "Shahida",
    "lastName": "SAHIB",
    "content": "I believe in functional medicine and its approach, to help and heal people suffering in main stream.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1695.jpeg"
  },
  {
    "firstName": "Megan",
    "lastName": "Slate",
    "content": "I have a child with autism",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_9036-1.jpeg"
  },
  {
    "firstName": "Rev Sheila",
    "lastName": "Tillich",
    "content": "To add more substance to my Energy Medicine Practice. I'm a Holistic Energy Practitioner, Ordained Metaphysical Minister, Energy Metaphysician, Recovery Metaphysician and Quantum Energy Healing Master Healer and Trainer, Former Medical Healthcare Professional, Hospice Provider, and Quantum Energy Channel.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1120.jpeg"
  },
  {
    "firstName": "Megan",
    "lastName": "Cooper",
    "content": "Going through perimenopause now and lots of my clients are.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1085.jpeg"
  },
  {
    "firstName": "Julie",
    "lastName": "Frady",
    "content": "I have been an RN for 16 years. I’m disgusted with our sick model healthcare system. I have battled my own autoimmune issues and had to figure out most things on my own and I’m still struggling. I want to heal myself and share my knowledge and experience to help others do the same. I have no plans to retire and I want to find something I love doing to take me into my golden years and I think functional healing and coaching is my calling.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/PHOTOSHOOT-01-copy.jpg"
  },
  {
    "firstName": "Teresa",
    "lastName": "Haynes",
    "content": "Seen info on Facebook. Very skeptical. Went to Trustpilot, impressed. All I would be out $97. Went to “register….” Not impressed at all. It may be a very good deal but I have  been burned before. At this time, I am just looking to improve my health as I have a nursing position as a Quality Assurance Registered Nurse x 7 months that I really love after working 30 plus years as a RN before starting this position.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/WEBSITE-BANNER_V7-copy.jpg"
  },
  {
    "firstName": "Amanda",
    "lastName": "Harriss",
    "content": "I’m currently a nurse but I do not feel that I am able to help most of my patients. I work for a GP & have a med spa.  I have lupus & I know many ppl with other autoimmune diseases. I want to help.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Profile-Pic.jpg"
  },
  {
    "firstName": "Brandy",
    "lastName": "Smieja",
    "content": "I know my true calling in life is to help and heal people. Unfortunately, I haven’t jumped on it as my career path was changed when I had kids young and dropped out of college. By doing that my journey and passion was but on the back burner so I could support my family immediately. I have always love health and trying to get to the root cause vs applying another bandaid to mask the true issue. I see too many unhappy and unhealthy beings and this world and I just want to be able to make a difference for them and with them",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Christmas-2025-1.jpg"
  },
  {
    "firstName": "Tammy",
    "lastName": "Baruhovich",
    "content": "I hold a D.D.S. degree in Mexico but when I immigrated to the USA, I could not practice as a Dentist in California without going back to school. There were no schools near me, so I became a Health Educator/Health Coach and went into Public Health. I've worked in colleges, clinics and hospitals for 25+ years, educating people of all ages and socio-economic backgrounds on disease prevention and health promotion. Health and healing have always been my passion, so as I get older and realize that illnesses and diseases are more rampant than ever (mostly due to the health system being broken, plus the chemicals and hidden sugars in prepackaged foods and sedentarism) my desire is to serve those that have not found solutions in traditional medicine, so they can live healthier and happier lives. I'm also a Certified Life Coach, a T2 Diabetes Counselor, and I hold a diploma in Humanistic Psychology, which have helped me understand human behavior at a deeper level. I believe my combined education can greatly improve the lives of many.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/5DEB7535-26AB-470B-9BDB-6F95E4A90B85.jpeg"
  },
  {
    "firstName": "Steven",
    "lastName": "Simons",
    "content": "Been fascinated with natural medicine. Have a certificate for Dr of nature opathic medicine like to learn all I can to help others out more then I have been",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/841F0500-8DB7-44E1-8F03-5A881EE65683.jpeg"
  },
  {
    "firstName": "Allison",
    "lastName": "Johnson",
    "content": "I am a certified nurse midwife that really wants to dive deeper into holistic medicine for my patients. I am working on my certification through the Institute of Functional Medicine but feel like I still want more, which is what intrigued me to purchase this training as well. I am tired of telling people to just eat better and exercise more, it doesn’t work and it’s frustrating for patients and myself to not have better outcomes.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/MICHELLEM047.jpg"
  },
  {
    "firstName": "Karyne",
    "lastName": "Martins",
    "content": "Hello Sarah,  My interest in the body and its intricate mechanisms began in 2007, when I entered in a comprehensive massage therapy program. The curriculum emphasized the study of disease and dis-ease, and it was there that I discovered my fascination with anatomy, physiology, and the body’s remarkable capacity for healing.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/MICHELLEM003.jpg"
  },
  {
    "firstName": "Joanne",
    "lastName": "Bertrand",
    "content": "I’m a registered nurse and I hear from my patients that they need more help than what the doctors are giving them.  They want more one on one care, to really understand what they can do to feel better and how they can do this without more “medicine”.  I also have family who have diabetes, thyroid issues, weight problems and I want to help them and myself for a better life and future! I’m also interested in stepping out of bedside and working for myself without sacrificing income.  This sounds to good to be true but I’m willing to do this, if it only helps me and my family get better health.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1131.jpg"
  },
  {
    "firstName": "nicole",
    "lastName": "sczekan",
    "content": "there is a 30day guarantee",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1136.jpeg"
  },
  {
    "firstName": "KERMIT",
    "lastName": "BAIL",
    "content": "Hello, I am about to turn 65 and I started the process  of retirement and red flags started popping up everywhere! BIG RED FLAGS. Printed on the flag it says DON\"\"T STOP NOW!                                                                                            I am the former owner of the Health Connection in Longview WA and became a certified personal trainer in 1990 thru the National Federation of Professional Trainers.                                                                                                  After receiving my certification I trained harder than I ever had and ended up on a Bodybuilding  stage as the 176lb class and overall winner of the Olympia Natural Classic in Olympia WA.   After the win in Olympia people swarmed into my club and I spent the next five years helping others to realize their dreams of becoming something more!                                                                                        It was about that time I met this Woman. She was and still is drop dead gorgeous. I sold my club started a construction company and married a total knock out. 4 children and 10 Grandchildren later here I am!                         The things I believed to be true 40 years ago about fitness  were not wrong  they were just small pieces of a bigger truth that we are coming to realize. These are exciting times! My reason for being here is for my children and their children.  You teach me I teach them and we all become something more!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_4848-1.jpg"
  },
  {
    "firstName": "Jen",
    "lastName": "Daugherty",
    "content": "To better understand the body",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1168.jpeg"
  },
  {
    "firstName": "Lynn",
    "lastName": "Skeen",
    "content": "I've worked in the Healthcare industry since 1987. I've worked as a Medical Assistant in several different fields of medicine. Family Practice, internal medicine, asthma and allergy,  rheumatology,  orthopedic surgery. Then went back to school for Massage Therapy. Totally, love what I do, but I know, physically I can't do it forever. So this is my next step.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_0607.jpeg"
  },
  {
    "firstName": "Sarah",
    "lastName": "Wayne",
    "content": "I completed a functional nutritionist certification 20 years ago. Since then I've helped hundreds and hundreds of people. The 2020 shutdown hit and my in person practice fell apart. I have not been financially successful transferring to an online business. I have had some great months but not consistent. I know a lot more about online business and now I am ready to uplevel my health expertise. I have been focusing on women in perimenopause the past few months. I have had great success applying my systems to my own perimenopause symptoms. I work very intuitively so I have not relied on \"\"knowing\"\" all the protocols. I've had doctors send me their most difficult patients because I would \"\"do my magic\"\" and then would just get better. I am on this planet to awaken people to their Divine Healer within.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_2733.jpeg"
  },
  {
    "firstName": "Todd",
    "lastName": "Trejo",
    "content": "I started having health issues at 32 years old after doing some painting in my first house I bought. The window were open while doing that. A week later,I started having dizzy spells,light headedness,sensitivity to fluorescent lights at home stores. I went to the dr. and he couldn't figure it out,giving me multiple prescriptions to try,that failed. I saw an ad in our local newspaper from a chiropractor who practice naturopathy modalities that was doing a seminar on finding out what is wrong with a person with ailments,naturally. I went to her for many years and she did some good things that helped,but still not to cure my illness. I became multiple chemical sensitive to everything with fragrances,gasoline,exhaust fumes,camp fires etc. I still have these symptoms and no one has been able to figure it out. Throughout the years since 2000,I became really intrigued to naturopathy and homeopathy alternative medicine and supplementation. From that point on,I had dreamed about becoming certified but didn't as prices were so high,that I could never afford it. So after caring for my elderly parents starting in 2012 and watching them deteriorate while the doctors give them all these toxic medications and misdiagnose,I knew someday I would turn to finding an opportunity like this. The final motivation was caring for my 88 year old mom at my home and having her live with me was a very life learning experience till she passed away this year on February 1st,2025. It was a super peaceful passing that I was so lucky to experience,just as my Dad's passing in September,2018 was also wonderful. Both did not show signs of pain or suffering. With my mom,I chose to not have any morphine paing meds of any kind and prayed that she would not need them and she didn't! The hospice team could not believe it,neither could I. It has been a trying time since her passing and I miss her dearly. I am healing little by little. I now know that I need purpose in my life to help educate others which I have been doing on a small level with friends and family. I always thought if I would of done this years ago and learned about functional medicine of how I could of helped both my mom and dad amongst many others. I have been out of work since my mom passed as I was her PCA and completed every single task for her to the end. So I know I have some knowledge,empathy more than anything to want to learn and get certified to help so many others along with my own health struggles that people don't teach or know. I have spent so much money over 25 years seeing many different practicioners which changed my life journey,but not to my expectations. With that being said,it is now my time to be the healer,life helper and make the money that I deserve!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/dgp03315.jpg"
  },
  {
    "firstName": "Tara",
    "lastName": "Leisenring",
    "content": "Expanding our practice",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_2615.jpeg"
  },
  {
    "firstName": "Doris",
    "lastName": "Schraner",
    "content": "I am very impressed by the Foundation course \"\"Integrative Health Functional Practitioner\"\" I am doing right now. I want to continue this path.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_0153.jpeg"
  },
  {
    "firstName": "Juanita",
    "lastName": "Norton",
    "content": "I am a nurse and I’ve been looking for a way to continue to help people but on my own terms.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/MARIA-GARCIA-PIC-IMG_5435-1.jpg"
  },
  {
    "firstName": "Toni",
    "lastName": "Horton",
    "content": "I’ve been sick for about 10 years. Seen too many doctors. I would love to be able to figure out what’s wrong with me when they can’t. Plus, I would love to learn more about Functional medicine and hopefully help others like me. My husband and I are considering buying a clinic and thought I could market these services as well.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Alternative-Health.jpg"
  },
  {
    "firstName": "Louise",
    "lastName": "Shaw",
    "content": "I have dabbled with energy healing for 10 years. I trained in 2014. I was seeing clients but not consistently and I always felt I didn’t really get to their root causes.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/183624315_10103098754947499_4368045747082282043_n.jpg"
  },
  {
    "firstName": "Jody",
    "lastName": "Kusheba",
    "content": "Working for toxic bosses in private offices that are doing illegal and unethical things. I now no longer want to not work for others. I want to follow my passion of functional medicine. My last day at my job is December 4, 2025 and then I will be unemployed.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/FBCover.jpg"
  },
  {
    "firstName": "Nancy",
    "lastName": "Morley",
    "content": "I want to open a IV hydration clinic",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/AnneProfile2.jpg"
  },
  {
    "firstName": "Theresa",
    "lastName": "Wilkes",
    "content": "I’ve been a Nurse for 41 years. I am currently a Telemetry /Med Surg / PCU/Rapid Assess Nurse….. I’ve found that patient Education along with the “what’s and why’s and what if’s” have been severely lacking…. We are practicing “Sickcare, not Healthcare”….. But I’m an old dog….. and my Patients appreciate me helping them to understand what’s happening and why …. and what to do to feel better …..I have 2 children in their mid 20’s and they are VERY interested in ROOT causes …..I’m excited for this new venture",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_7064.jpeg"
  },
  {
    "firstName": "Maryssa",
    "lastName": "Briggs",
    "content": "I want to learn more about holistic health and be able to help my clients better. I want to teach people how to use God given nutrition and herbs to help their bodies do what it is naturally designed to do.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_3104.jpeg"
  },
  {
    "firstName": "Gabrielle",
    "lastName": "Price",
    "content": "I simply love learning and want to be in the know. I love people and dont want to let anyone down or miss a thing so I educate myself.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_6694.jpeg"
  },
  {
    "firstName": "Cassandra",
    "lastName": "McNamee",
    "content": "I have a home care agency and also numerous autoimmune disorders. This just seems like a great idea for me.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_2257.jpeg"
  },
  {
    "firstName": "Sonja",
    "lastName": "Mountain",
    "content": "Looking for options to better serve my patients and draw more patients to my practice.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/49.jpeg"
  },
  {
    "firstName": "Padmini",
    "lastName": "Kothari",
    "content": "Hi i am 62, retired from teaching and want to retrain something that I feel is equally valuable as teaching. As i get older i appreciate health issues creeping up and difficult to see a docyor to get early intervention.  My expection of this training is that i will be able to bridge the gap between suffering and the time it takes to get to see the specialist for none urgent medical isdues and at the same time give me a paid vocation.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Main-Image.jpg"
  },
  {
    "firstName": "Eumeica",
    "lastName": "Zirker",
    "content": "Currently working as RN with Nutrition degree as well. Interested in alternative healing v/s traditional methods.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_6995-1.jpg"
  },
  {
    "firstName": "Rita",
    "lastName": "Santos",
    "content": "I am a NP, want to make a difference in my patients lives by understanding in detail what make them sick.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/1000037020.jpg"
  },
  {
    "firstName": "Jane",
    "lastName": "Powers",
    "content": "Educational Learning",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/1000037720.jpg"
  },
  {
    "firstName": "Shonda",
    "lastName": "Cannon",
    "content": "I have been out of nursing for a few years due to not believing in the current mainstream medical culture. I have been self teaching natural remedies for a couple of years of years now and feel it’s time to make it official!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_6562.jpg"
  },
  {
    "firstName": "Stephanie",
    "lastName": "ALEXANDER",
    "content": "The president said i was not a professional after 40 years and 3 degrees",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1538.jpeg"
  },
  {
    "firstName": "Joyce (Joy)",
    "lastName": "Caswell",
    "content": "Looking for work I can do from home , helping others . My 25 yr corporate career in insurance has become unreliable.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_1540.jpeg"
  },
  {
    "firstName": "Sherry",
    "lastName": "Terescavage",
    "content": "So I can understand and help heal health issues I'm dealing with and then take that knowledge to help others.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_6418.jpeg"
  },
  {
    "firstName": "Cheryl",
    "lastName": "Rogers",
    "content": "I've been in the medical field for 31 years as a MSN. Due to an accident that left me with an incomplete spinal cord injury,  changed my life.  I just want to learn more clinical knowledge.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_6542.jpeg"
  },
  {
    "firstName": "Derrell",
    "lastName": "Lester",
    "content": "I'm a massage therapist who wants to diversify my practice and create an additional income stream. I'd like to be able to scale back on so much of the physicality in my daily work.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_4555.jpeg"
  },
  {
    "firstName": "Kira",
    "lastName": "Reoch",
    "content": "Both of my parents died, my mother in a car accident, and my father last year from heart and kidney failure. My sister has autoimmune issues. We have a great deal of traumatic events in our family. Iv3 been a nurse for 20 years in ICU and flight nursing, and I couldnt participate in the western medical corporate Healthcare anymore. I jumped ship and opened my wellness business with the desire to help people heal, truly heal, mentally, physically, emotionally, spiritually, and live life in abundance, like we were meant to. This certification opportunity gives me the option of exploring so many avenues, which is great cause I want to be good at helping in a holistic manner.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Screenshot-2025-08-12-162412.jpg"
  },
  {
    "firstName": "Nancy",
    "lastName": "Brooke",
    "content": "This is much much too long to share here.  I will say I spent five years learning to be a health coach, but never felt qualified to actually help people.  I walked away for the last year.  Last night I told a friend how much I still felt called to helping people who want to heal.  This morning another friend casually shared a link for your program.  She has no idea what I said last night.   I feel called and I’m ready to be of service.   😭",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/1000086368.jpg"
  },
  {
    "firstName": "Jamie",
    "lastName": "Fernando",
    "content": "Hi there, my name is Jamie and your description described me perfectly. “Burnt out nurse, mother, someone who knows and feel a greater purpose”.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/1000109252.jpg"
  },
  {
    "firstName": "Eric",
    "lastName": "Reed",
    "content": "I have been praying for a way to serve others in a productive and meaningful way. I have overcome health issues naturally and by educating myself online informally. I have recovered from gallbladder issues Lyme disease and digestive bloating and discomfort. I want to formalize and structure this interest to be able to help others.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/484902029_1841648773345064_1588558584332345010_n.jpg"
  },
  {
    "firstName": "Donna",
    "lastName": "McMenamin",
    "content": "This certification feels like the next step in a very long and difficult healing journey. I’ve spent years suffering with Lyme disease, going from doctor to doctor with no answers, and it took far too long to finally be diagnosed. Even after that, I had to go through multiple Lyme practitioners before finding the right one who could truly help me.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/Bear-Trap-Gap-MP-428-robert-Stevens-web.jpg"
  },
  {
    "firstName": "Kerri",
    "lastName": "Harris-Bigler",
    "content": "Been an RN for 25 years, worked in many fields, now in hospice. But I want something o can do from home and in retirement (I’m 61 so it’s coming up fast). And this sounds fun. I love analysis and have a habit of always looking for cause and seeking solutions (in hospice I’m known to fight for my patients).",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/IMG_0576.jpeg"
  },
  {
    "firstName": "Shari",
    "lastName": "Casolo",
    "content": "Hi. First I want to say that I saw this offer and was quite skeptical because what on the internet is not these days. The price for what the claims are does not seem appropriate. I love the idea of functional nutrition and Medicine. I am a holistic nutrition consultant. I want to work with clients in a way to help them get to the root cause of their health challenges. Reading the description of this program I feel that this can give me the tools that I need to help my clients get there.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/12/1000004191-1.jpeg"
  },
  {
    "firstName": "Carrie",
    "lastName": "Leeflang, PFP",
    "content": "I’m interested in natural healing!  I have had several physical challenges through the years where Allopathic Medicine failed me but found improvements through alternative healing practices.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_2558.jpeg"
  },
  {
    "firstName": "Lesley",
    "lastName": "Ennett",
    "content": "Want to learn about functional medicine",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Purple-Needle-1.jpg"
  },
  {
    "firstName": "Bonita",
    "lastName": "Leiber",
    "content": "I am a retired pediatric nurse of 50 years. I am interested in healing and I’m interested in learning more about healing and helping people. I do not want to start a business, I do not need to make more money, I just want to learn more and see where that takes me.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Small3.jpg"
  },
  {
    "firstName": "Dana Renee",
    "lastName": "Meunier",
    "content": "I would like to be able to help myself and others with their health care issues.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3191.jpeg"
  },
  {
    "firstName": "Brig",
    "lastName": "Johnson",
    "content": "i've been a practicing life coach for over 6 years- excited to bring more health in for a more holistic approach",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_6300.jpeg"
  },
  {
    "firstName": "Robin",
    "lastName": "Hawk",
    "content": "Former Nurse working in advanced nutraceuticals",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Facetune_27-11-2025-02-23-02.jpeg"
  },
  {
    "firstName": "Tammi",
    "lastName": "Higley",
    "content": "I’m a Med-Surg nurse who is getting older and burnt out.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/yh4i-iVoFd31IQ8lD6eDi_ae7d282653cd403c9664f0ef0705867c-1.jpg"
  },
  {
    "firstName": "Angelina",
    "lastName": "Guntert",
    "content": "I'm a nurse, 2 years in. I worked at a hospital that treated the current problem, never wanted to dig into the root of the cause even when I took the time to dive into their charts. I always felt disheartened knowing we'd be discharging them home to be right back from the root cause. Unfortunately this happened to my Nana. She came to my hospital, I reviewed her results begged them to be preventative when her results showed pulmonary hypertension and we ended up right back in the hospital 2 weeks later. She was lucky to make it back, but I know some people aren't. And that frustrated me immensely, especially since its my family they chose to send home not fully treated. I hate hospitals because many are money focused, the patients in our beds are dollar signs and us nurses are burnt out keeping up with corporate demands to make them more money. There's no heart behind corporate and it leads to tired, fatigued, angry, bitter nurses who do our best. I want to run a practice, do retreats for nurses in hospitals, and more. I also struggle with my own health ailments, and my mom recently is struggling with health ailments that are ruining her quality of life and the Dr's are just playing a guessing game. Im hoping to increase my knowledge to help the ones I love.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3420.jpeg"
  },
  {
    "firstName": "samantha",
    "lastName": "BRIGHT",
    "content": "I have just finished my nursing diploma after 10yrs in disability and aged care but nothing has really intersted me like this.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0379.jpeg"
  },
  {
    "firstName": "Samantha",
    "lastName": "Blount",
    "content": "Medicine has always been my thing. I started in nursing homes at 15, started college for it late, but then life happened. I’ve done courses for holistic nutrition, herbalism and more. I believe that our bodies are capable of way more than just processing prescriptions as a savior. My husband helps people through massage and I’d like to bring more to that practice and to the clients we see so that they can feel better at every level.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Bountiful-backyard-homestead.jpg"
  },
  {
    "firstName": "Claudia",
    "lastName": "Perez Rivas",
    "content": "I’m looking at a career change and making a difference in the type of work I do.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0478.jpg"
  },
  {
    "firstName": "Pamela",
    "lastName": "Lawson",
    "content": "Retired RN and my daughter is recovering from being in a coma for two months. I need a deeper understanding of how the body processes foods and how to recover muscles and brain from deficiencies of diet.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0298.jpeg"
  },
  {
    "firstName": "Maya",
    "lastName": "Feric",
    "content": "Hi Sarah! I first saw an ad for the Functional Medicine Coach Professional Certificate and Hormone Balance Certificate and decided to give it a try. I am in a full blown menopause and not enjoying anything anymore. I have every single symptom they listed and I’m in a process of getting an HRT. However, because of a suspicious mammogram result, they want to do a biopsy on a lump before they approve hormones. It will be at least another 2 months before I can start the therapy. So that course was for me. However, I always felt my calling was a psychotherapy, but I never finished school for it and now at 51 I feel like that is not something I can do. I’ve been searching for other ways I could have a similar practice, develop a specialty and hopefully build a successful practice with it. I’ve been practicing self-hypnosis for 35 yrs and I looked into getting a hypnotherapy certificate, but found out that in Florida, that school’s certificate would not allow me to practice professionally, because in FL to practice any type of therapy with the clients, you have to have a Masters degree in psychotherapy. The school itself did a research and informed me that I would not be able to make it a business in FL. So, I am looking to learn a bunch of new methods and practices on improving my own health and hopefully learn enough to be able to develop a successful business.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3093-1.jpeg"
  },
  {
    "firstName": "Tanya",
    "lastName": "Burks",
    "content": "I am a nurse practitioner for the past 10 years. I have been in the federal prison system for the past 9 years. I have felt stifled and disheartened. I took the leap during this shutdown to break free. I have a huge desire to help the whole person live their best life. I also desperately want to help my daughter. She has been passing out for the past two years every time she is stressed out mentally and physically. Every doctor has told her she is fine, but as a mama, she doesn't feel fine. I know she's not alone. It's so frustrating to feel like she's being ignored. I personally feel this will help me help her and countless others like her. I am fed up with sick medicine and want to focus on true well care!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1406.jpeg"
  },
  {
    "firstName": "Shari",
    "lastName": "Plummer",
    "content": "Burnt out on nursing and looking for insite just for myself right now.  Have not worked in 3 years.  Would love the rest of your courses but $300 is too much right now",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_5612.jpeg"
  },
  {
    "firstName": "John",
    "lastName": "Curtin",
    "content": "I'm a chiropractor currently on military deployment. Thought I can self improve on down time",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0053.jpeg"
  },
  {
    "firstName": "SUSANNE",
    "lastName": "CUBBERLEY RN MSN",
    "content": "I’m an RN with a certification as holistic practitioner, sound healing, Intuitive Healing and Reiki.  Since moving back to Florida from Asheville NC I have been not practicing alternative healing modalities except for being a hospice nurse in homecare. I feel it is time to finish my own healing journey and start working on others next year!  I am semi retired and love to travel.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0353.jpeg"
  },
  {
    "firstName": "Jacqui",
    "lastName": "Burge",
    "content": "I've been working with women on fitness for 35+ years and have overcome a few major health challenges and trauma work. I was attracted to your offering and felt it could enhance what I am doing with women today and add to what I am sharing.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1057.jpg"
  },
  {
    "firstName": "Priyanka",
    "lastName": "Thakan",
    "content": "I grew up a healthy girl. But about 13 years ago, I developed an autoimmune condition of scarring alopecia. Nobody in my family has such a thing and I knew this was lifestyle related. I had injured my tailbone about a decade before that. It had gotten so bad that it did not let me sleep at night because there was no position that was comfortable. I spent the entire decade before developing alopecia dreading nights because no position was comfortable to sleep in. That was a long and miserable life. It continued for another decade. I am much better right now and do get to sleep at night.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1894.jpeg"
  },
  {
    "firstName": "Amy",
    "lastName": "Lovell",
    "content": "I am currently an operations administrator for a very busy, well established primary care clinic. I help out with the clinic in many ways, I decided as a functional medicine couch, I can do more. Additionally, I personally have 4 auto immune diseases that I would like to learn to handle more efficiently instead of hearing doctors tell me they don’t know what to do….",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3520.jpeg"
  },
  {
    "firstName": "Kathleen",
    "lastName": "McDowell",
    "content": "I'm interested in helping people with health concerns that doctors can't seem to diagnose.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Pamela.jpg"
  },
  {
    "firstName": "Brisa",
    "lastName": "Quezada",
    "content": "I was a nurse practitioner, left my career to take care of my kids. I am don’t have my NP license anymore and I have the need to continue to practice what I love. Especially with functional medicine which is the future of medicine in my opinion.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/ZOOM-PHOTO-22.jpg"
  },
  {
    "firstName": "Patricia",
    "lastName": "Kehoe",
    "content": "I’ve been a nurse for 55 yrs.-30 yrs.in hospital & critical care,20 in occupational health & most recently school nursing. Never really took off with my coaching practice- I guess I benefits the structure of a job! I also need $-social security check is helpful, I can slow down & create my own schedule.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/NEW-SOCIAL-MEDIA-COVER-PHOTO.jpg"
  },
  {
    "firstName": "Nathan",
    "lastName": "Luu",
    "content": "I'm a NLP Transformational and Wellness Coach. I want to solidify my Credentials and offer Functional Medicine Health Coaching as well",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/HEADSHOT-10.jpeg"
  },
  {
    "firstName": "Dr. Laurette",
    "lastName": "Willis",
    "content": "To add to the coaching work I do in order to add more value for my clients.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/me-blonde-hair.jpg"
  },
  {
    "firstName": "Valerie",
    "lastName": "Parris Richardson",
    "content": "I am a Registered Nurse of 35 years, I want to semi retire; just to work  2-3 days a week. But it is still very stressful. I am a nurse case manager, doing discharge planning. It is draining.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Health-GettyImages-1277510870-268327e96e08452a85db8847a51a6ea1.jpg"
  },
  {
    "firstName": "Ciaara",
    "lastName": "Hoffmann",
    "content": "I want more clinical background to start my membership community",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Heart-icon.jpeg"
  },
  {
    "firstName": "Alyssa",
    "lastName": "Manning",
    "content": "Certified in i tegrwtive medicine.  Looking for coaching certification.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/profile.jpg"
  },
  {
    "firstName": "Carley",
    "lastName": "Mayhew",
    "content": "I’ve always wanted to do coaching and the more I see the nursing world fall apart and the healthcare systems in shambles. I really wanted to one get my training hours and two invest in the future I love what I do as a nurse however, I see things going south very fast and I love my business with Arbonne, but and goal is what I’m setting up for and I want to use Arbonne as a vehicle in order to create my dream which is to have a Homestead/retreat, nature retreat where I can help people reconnect with nature and yeah, I hope to hopefully do a herbology course at some point as well and maybe some workshops who knows",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/logo.jpg"
  },
  {
    "firstName": "Josie",
    "lastName": "Hansen",
    "content": "I invested here because I have a strong desire to fill in a few missing gaps in my practice. I want to coach women 50 and over from a holistic perspective, yoga philosophy, health coach, and RN (which I am) to improved health. The goal is teach, coach and create courses from this mindset.  People struggle with the finding root cause(s) to their problems and often times the western medical model does offer practical, simple solutions because they are not asking the right questions.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_5193.jpeg"
  },
  {
    "firstName": "Linda",
    "lastName": "Swan",
    "content": "I have been a RN for 32 yrs. Past 10 years I have work as a hospice nurse and I am burnt out. I enjoy my helping families get through tough times and helping patients to complete there life cycle with respect and dignity. I am ready to start helping others by trying to get down to the main cause of ill being and not just mask the problem.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Messenger_creation_864843ED-1580-4B22-B40C-0781CD8F3450.jpeg"
  },
  {
    "firstName": "Sherri",
    "lastName": "Mauceli",
    "content": "I sent you an e mail earlier this evening. Please read it as it gives you some info about me. Thanks",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/photo-2-biography-Ebbin-Florence.jpg"
  },
  {
    "firstName": "Safia",
    "lastName": "Gopalani",
    "content": "I'm a CPA by profession. I would like to help the community, the people around me with free service. I have no intention to make money off this learning. I have a job as a CPA which pays the bills. I have been helping coaching people for the past 6 years and I keep spending money on learning naturopathy and Ayurveda treatments. I'll wait for your holiday specials to get access to all the courses and lifetime access. Thank you for the generous offer.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Ebbin-Florence-biography-let-the-adventure-begin.jpg"
  },
  {
    "firstName": "Diane",
    "lastName": "Powell",
    "content": "First of all your ad just popped up on Instagram. What caught my attention was about getting certified to be a coach in Integrative Medicine. I am an Aesthetic RN at a Dermatology/Aesthetic/ Integrative Medicine practice. I have been treating patients for 14 years with fillers,  Botox, lasers, etc. ,but I am very holistic minded and not feeling great about the injectable anymore !! I am all about preventative medicine, supplements, and working out to build muscle, bone density and strength.  I am a 2x cancer survivor (cervical and breast) with surgeries  only...no chemo or radiation 🙌🙏",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/website-1.jpg"
  },
  {
    "firstName": "Xuewei “Alex”",
    "lastName": "Li",
    "content": "I struggled with nerve pain for 6 years, started before I hit 30. I have seen at least 20 different doctors, and had multiple spinal injections. I was told that my nerve pain is caused by inflammation but no one seems to be interested in figuring out why my nerves are inflamed. They stated it was caused by narrowing space between L4-L5, L5-S1. But my image honestly did not look that bad. I keep taking pain killers, sugary food. At the worse, I can only work 5 hours a day and then needs to stay in bed for the rest of day. I put on weight, lost my ability to dance, eventually I started having insomnia before my period. And that is when a very knowledgeable pelvic floor specialist that I have been working with suggested me to see a functional medicine doctor. I did not like the doctor’s sales strategy, and found a coach instead. After getting my food sensitivity test result, my nerve pain disappeared within 2 months. I am on the fourth month of my gut healing journey. And know I can dance and weight lift again. My TSH is still high at 6.75. And it probably will take a while for my body to be ready for pregnancy. I forgot to mention know I understand why I keep miscarrying.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/flor-do-campo.jpg"
  },
  {
    "firstName": "Erika",
    "lastName": "Lewis",
    "content": "Im a registered nurse. I have been wanting to get away from the over thinking of new residents and the nonsense testing for something that is much less complicated. To utilize my skill and knowledge base to help others without doctors getting the credit for my work. To work for myself, be able to create ny own schedule and have time for my family.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/A7EBC97E-CB35-4C06-8B44-3EBE910978E8.jpeg"
  },
  {
    "firstName": "Rebecca",
    "lastName": "Khan",
    "content": "I would like to go into depth with Wellness Coaching and know that functional medicine is the approach I believe in.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/20241114_1226422.jpg"
  },
  {
    "firstName": "Katherine",
    "lastName": "Sprinkle",
    "content": "I’m an RN with 30 yrs experience.  I was laid off from my job 3.5 yrs ago & im also a single mom with 3 kids. Those 2 yrs of being laid off before finding my job now, depleted me financially & I’m now trying to get back on my feet making less than $40k a year.  I’m tired of the sick care model in our modern day healthcare system.  I’m tired of making half of what I used to make as a nurse with 30 yrs experience. I want to do something I can feel good about that will also lead me to financial freedom working part time.  Heath & wellness is something I feel passionate about & over last couple months tried to figure out a way to work in this kind of area.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/20251026_115528.jpg"
  },
  {
    "firstName": "D",
    "lastName": "J",
    "content": "Personal healing & To heal others Mentally Physically Spiritually Financially",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000006380.jpg"
  },
  {
    "firstName": "Melanie",
    "lastName": "Cathey",
    "content": "I want to work on holistic medicine",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000007963.jpg"
  },
  {
    "firstName": "Amy",
    "lastName": "Paul",
    "content": "I've always wanted to pursue FM but didn't think I could afford it.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0907.jpeg"
  },
  {
    "firstName": "Angela",
    "lastName": "Phillips",
    "content": "This past year we I began a new journey career journey as a health coach!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_5077.jpeg"
  },
  {
    "firstName": "Osman",
    "lastName": "Diallo",
    "content": "I am a nurse just wanted to help people and improve my education",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3174.jpeg"
  },
  {
    "firstName": "mandy",
    "lastName": "joye",
    "content": "I am a certified health coach. I transformed my health and this certification would give me more credibility.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_5011.jpeg"
  },
  {
    "firstName": "Kristi",
    "lastName": "Hehl",
    "content": "Stopped trusting the system. I love learning. New career. Health Advocate/Coach.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/20251020_160423.jpg"
  },
  {
    "firstName": "Angelica",
    "lastName": "Ulloa",
    "content": "I am choosing to invest in a functional medicine course for two important reasons. First, I want to better understand my own health. Lately, I’ve been struggling with fatigue and I want to learn the underlying causes so I can take care of myself more effectively. Having this knowledge will empower me to make healthier choices and improve my quality of life.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Sheila-B-Tillich-Galactic-Ascension-Academy-2025-.jpg"
  },
  {
    "firstName": "Sharon",
    "lastName": "Seitz",
    "content": "Always been into personal health & nutrition and now more than ever want to help people who are clueless & don't see what's going on with Corp Food & Big Pharma",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3944.jpeg"
  },
  {
    "firstName": "Julia Cristina",
    "lastName": "Vale Pereira",
    "content": "I am looking to have a better quality of life and be able to provide more financial security to myself and my son.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0006.jpeg"
  },
  {
    "firstName": "Val",
    "lastName": "Perkins",
    "content": "To help my husband figure out his health issues.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000009149.jpg"
  },
  {
    "firstName": "Carol",
    "lastName": "Brillante",
    "content": "I have been in 10 or more surgeries myself & 10 more for family & friends and personally witness & analyze each medicine literature, each treatment , tests & procedures, each medical impressions/ diagnosis & at end, I say to myself there should have been a better way/approach to these sicknesses & diseases as I have researched later.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_9351.jpeg"
  },
  {
    "firstName": "Mia",
    "lastName": "Prince",
    "content": "Frustrated with the medical profession that cannot find answers to my irregular blood tests and symptoms.  I have many healing practitioner certifications and still cannot get to the root case of my problems.  There are many others that are in the same boat as I am and I would like to be able to help them as well.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_9766.jpeg"
  },
  {
    "firstName": "Vanessa",
    "lastName": "Cody",
    "content": "Want to try something new",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_8352-1.jpeg"
  },
  {
    "firstName": "Sylvia",
    "lastName": "Ganaden",
    "content": "Im in the process of  furthering. / upgrading my-profession for more income / investment (so i can buy my own retirement  house )in preparation for retirement .",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0301.jpeg"
  },
  {
    "firstName": "Darlene",
    "lastName": "Severson",
    "content": "I've been working on my own health issues for years. I've made quite a bit of progress, but I'm not  100%. I want to be completely well and help others get there too.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000014935.jpg"
  },
  {
    "firstName": "Kim",
    "lastName": "Parks",
    "content": "Working in healthcare since my early 20's, I've always wanted to help people. I was introduced to wellness and supplements in my 20's with plant based nutraceuticals. My health over the years has been good and bad, my weight vacillating up and down with having children, going through divorce, stress, etc. I became a Certified Nurse Midwife/Nurse Practitioner in 2009 and found so many women suffering and complaining about fatigue, brain fog, stomach issues, weight gain, depression... I am a part of a wellness supplement company that focuses on use of adaptogens and detox support and went through a 30 day detox a few years ago and felt so much better. I have listened to podcasts and love learning how giving your body what it needs, it can be a miracle healing itself.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/2af94d79-430b-4f88-80b5-a63a92c01b27.jpg"
  },
  {
    "firstName": "Sujal",
    "lastName": "S",
    "content": "I can help my people better",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/DCBDF044-CCDD-48EA-8F6C-1625C9820437.jpeg"
  },
  {
    "firstName": "Diana",
    "lastName": "Brown",
    "content": "Want to change how people access Healthcare and truly treat them",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/38717462-37B8-4301-8E13-3D2FAA2A9F41.jpeg"
  },
  {
    "firstName": "Brie",
    "lastName": "Vos",
    "content": "I am a newly semi-retired cardiovascular register nurse of 23+ years.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0119.jpg"
  },
  {
    "firstName": "Mike",
    "lastName": "Ogwal",
    "content": "Dear Sarah, thank you for showing up with your timely FM program. I have searched and searched for years to find a good FM program that would not only train me and Certify me to become an effective, research-based and solution-oriented Coach. But a FM Coach with authority known to transform lives and heal people. A FM program that would also give me a real financial satisfaction great enough to free me totally from my current, unreliable low-income ticket clients together with my low-pay current substitute teaching job. This is it Sarah! I am in!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Screenshot-2025-10-14-135319.jpg"
  },
  {
    "firstName": "Diane",
    "lastName": "Wise",
    "content": "Two reasons: to learn how I can feel better, why I have such low energy in spite of “normal” lab values. Then use what I learn to help others who are having the same problems. Post-menopause aggravation!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_4954.jpg"
  },
  {
    "firstName": "Joanne",
    "lastName": "Bertrand",
    "content": "I wanted this course to help me and my family but I also want something I can do from home, not work for some one else.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1140.jpg"
  },
  {
    "firstName": "Joy",
    "lastName": "Moses",
    "content": "I have been circling back to this for quite awhile now and I feel that it's the right time",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/ayuerda-master_level_3.png"
  },
  {
    "firstName": "Niesha",
    "lastName": "Bridgewater",
    "content": "I have been a Certified Nurse's Assistant for 29 years, a Certified Medication Assistant for 22 years, a Pharmacy technician for 18 years. I'm also a Cosmetologist for 8 years. I love working with and helping people. I've also had my own health challenges. I have high blood pressure, a hiatus hernia, and acid reflux. I had a heart attack February 2025. I have PTSD from a domestic violence situation in 2023. I want to learn as much as I can to help myself and others.  I'm not going to get a promotion on my job, so I definitely want to open my own practice next year. It will be so rewarding to be able to help others and get paid good money for it. When you love what you do, it doesn't feel like work, it's freedom and joy. I will be so excited to go to work everyday knowing I'm helping to change someone's life for the better!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/ayuerda-master_level_2.png"
  },
  {
    "firstName": "Ziggy",
    "lastName": "Marot",
    "content": "The methodology promised and the business support",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/ayuerda-master.jpeg"
  },
  {
    "firstName": "Linda",
    "lastName": "Conner",
    "content": "I have a background and healthcare.  I gave up my RN license.  Healthcare had changed, being a nurse was no longer feeding my soul the way it used to.  I opened a small metaphysical shop with an extensive apothecary and started to learn and grow my herbal business.  After about a year and a half I decided I wanted to learn more and do more and be more so here I am.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_8510.jpeg"
  },
  {
    "firstName": "Holly",
    "lastName": "R",
    "content": "I have health coaching qualification but want more in depth knowledge to launch my health coaching business next year",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_5527.jpeg"
  },
  {
    "firstName": "Can",
    "lastName": "Ho",
    "content": "brush up on clinical skills",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/level-3_modificata_ayuerdic.png"
  },
  {
    "firstName": "Lorie",
    "lastName": "Nieman",
    "content": "I am a certified personal trainer and I work with mostly with 50 and older clients helping them strength training and longevity. I also help them with nutrition but what to be able to help them and taking this course will allow me to do so. Health and wellness and strength trading is the key to longevity and being healthy.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/level-1_modificata-scaled.webp"
  },
  {
    "firstName": "Tonya",
    "lastName": "Ross",
    "content": "4 years ago a friend of mine I was working with at the time just couldn’t take the job any more. It was sucking the life out of her. We got together and formed an idea to open up a functional clinic. Upon looking at all of the information, I just couldn’t take the risk and I had no money to buy the certification to be a health coach. My friend is an APRN and she had the knowledge, the faith and the resources to build her practice. I was her first client and she is now my primary care physician. I have Hashimoto thyroiditis and I have figured out that doctors are stupid and they don’t listen. I have tried to change diets, do food sensitivity tests and all of it and with the help of my friend, I am finally feeling better. BUT…I’m not where I want to be. I am also type II diabetic and there is just so much. I have helped many many friends with complications, but I want to learn and know more. So this is a huge blessing for me. I literally bought everything and it is still less than the lowest price program I have seen. I’m excited to jump in with both feet in January!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Screen-Shot-2025-04-10-at-7.43.15-AM.jpg"
  },
  {
    "firstName": "Nicki",
    "lastName": "Dixon",
    "content": "Nutrition and hormones",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/3.png"
  },
  {
    "firstName": "Melanie",
    "lastName": "Davis",
    "content": "I earned my BS in health and wellness about 10 years ago.  I tried to get into the industry but just couldn't make it happen. Fast fwd 10 years and I'm tired of the corporate stuff and ready to brach out on my own, be my own boss. I love the industry and would really like to be part of it. I want to be someone people can put their trust into bc I've had a lot of doctors over the years not seem to care (but maybe their burnt out) or help me or push my \"\"feelings\"\" aside -- I think maybe it's called gaslight me. I want to also learn this info for myself to help me get healthier. I struggle immensely with mental health over the last decade and am finally feeling better to take on a task like this and make it flourish into what I need and want it to be. I also plan to get a nutrition certification to assist in my work and offer more help bc the nutrition industry can be consuming. I want to work mostly with women who are in perimenopause and menopause because we should really have more practitioners in that area. Pretty much ready to quit this job but I have no interest in looking for a new job and feel if I can do something on my own, I'll be happier.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/77C8C7A5-579E-4A9B-B9DF-C446FE06D52C.jpeg"
  },
  {
    "firstName": "Norman",
    "lastName": "kennedy",
    "content": "outside, of this course i studied natural medicine,i started just small courses, like  Detoxfication,i love rife]so i bought a U.S.A. Rife machine,with M.O.P.A  copy of Rife original.so far i cured 3 people of stage 4,i like red light therapy also, Herbs like hawthorn berries, for heart,so on.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/14a622eb-707a-46b3-b607-073ae03945ac-1_all_3022.jpg"
  },
  {
    "firstName": "Lindsay",
    "lastName": "Pirie",
    "content": "I’m a Registered Holistic Nutritionist but have had a wellness business selling medical devices globally for 10 years. I’m wanting to get back into some client work but do not want to make $75/hour. I do not want to work 40 hours either.  My husband and snd I are building another online business and I’d like to be able to add monthly income through highly valuable client sessions. This won’t be my whole business but I’m hoping this will add something really wonderful to our business.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/2427-1.jpg"
  },
  {
    "firstName": "Nellie",
    "lastName": "Quiros",
    "content": "In the last two years I have been dx with mild cognitive impairment and a host of GI issues. At 67 I realize that after 30+ years on a host of prescription drugs, I am no better than when I started, in fact Im worse. Recently, I have researched and begun natural self healing with Borax, Hydrogen Peroxide, Supplements and Essential Oils Therapy but don't really understand it with the depth I want. This program seems crazy to begin at my age but I feel that truly knowledgeable people are scarce in my community and I need to know, to help myself and perhaps others.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/SAM_0300.jpg"
  },
  {
    "firstName": "Jodi",
    "lastName": "Drake",
    "content": "I have lived with many / varying degrees of chronic pain and illness since birth. While for most of my life I just accepted it as part of my life, I also always felt deep inside a feeling of \"\"there has to be more than this!\"\", \"\"we weren't meant to live on constant pain and suffering\"\". I tried looking for answers and relief in the world of western medicine, only to be pay out thousands of dollars to be told over and over again that \"\"they didn't know what was causing xyz\"\", or my favorite was \"\"you'll just have to live with it\"\". Every visit to a supposed medical professional/expert, left me with zero answers, less and less trust in Doctors/our sick-care system, and with a deeper burning desire/need to find my own answers + heal myself.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/DSCF0013.jpg"
  },
  {
    "firstName": "Susan",
    "lastName": "James",
    "content": "I have attended many lectures from Lifestyle Doctors and have learned a lot over the years.  I am an RN, and while working in the hospital, I felt the need of this kind of training.  I have given some vegetarian/vegan cooking classes.  I have supported my chiropractor husband in his work.  I wanted to be a nurse practitioner, but that has not ever happened.  I love talking to others and sharing health information.  I am getting older and due to stressful living, I have some of my own health issues.  My husband is now retiring and I can pursue some education for myself now.  I still need to earn a living, but it doesn't have to be huge numbers.  I think our health system is broken, and would love to help people navigate their health, working with their own body's God-given ability to heal itself and addressing the cause of the problem, and not just treat symptoms.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000013512.jpg"
  },
  {
    "firstName": "Heather",
    "lastName": "Walden",
    "content": "Burned out of nursing and need a change with less stress on my body.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000013028.jpg"
  },
  {
    "firstName": "Reta",
    "lastName": "Coddington",
    "content": "I want functional medicine",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0931.jpeg"
  },
  {
    "firstName": "Faumuina",
    "lastName": "Mareta Levy",
    "content": "Its promised high paying and freedom to be with my family.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_8574.jpeg"
  },
  {
    "firstName": "Peggy",
    "lastName": "Wood",
    "content": "I want to be a nurse coach and help people with chronic disease but can not yet afford nurse coach training and this seemed a good first step",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/30571834_10156097496995049_3341476254116216832_n.jpg"
  },
  {
    "firstName": "Belinda",
    "lastName": "Williamson",
    "content": "I have been contemplating being a health coach or resource for a few years.   I have had many clients just want to chat about what is going on and have also been a patient advocate or medical ear and sounding board for many family members.     I have had the blessed opportunity to attend a few longevity conferences and love learning.    My husband recently had a heart attack and we have had a scare with lesions found in his body.   He is struggling with other health issues and we are working through the process.    I have a massage therapy busy where we sell herbs and other products and services.   It is now time to take this where I see it going in the future.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_6462.jpeg"
  },
  {
    "firstName": "Racheal",
    "lastName": "Carbajal",
    "content": "I am sick of being sick but told I'm not.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_6345-1.jpeg"
  },
  {
    "firstName": "Gina",
    "lastName": "Franch",
    "content": "The short answer is that I feel a calling to heal. The longer answer is I’d like to be able to heal myself.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/20230210_190502.jpg"
  },
  {
    "firstName": "Jason",
    "lastName": "Corriveau",
    "content": "My wife and I are nurses that realize that the medical system alone is not helping anyone.   We are seriously considering establishing a business for functional coaching, physical training options and functional nutrition.  We are enrolled in a few courses this is one of them.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_5742.jpeg"
  },
  {
    "firstName": "Renex",
    "lastName": "Dorvil",
    "content": "I have one of my children who was born 27 weeks premature. I have a nurse working 24/7 at my house. I need to see if I can help my son when the nurse doesn't show, that is my why",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_6128.jpeg"
  },
  {
    "firstName": "Kim",
    "lastName": "Moisa",
    "content": "Honestly, right now I'm feeling manipulated and not sure I'm doing the right thing, and here's why. I'm a straightforward person; No fluff needed. It wasn't until after I gave my payment information that I was told that the $97 was only for level 1, which doesn't deal with the more involved cases. One of the main reasons why I'm wanting to do this is that I have a daughter suffering with a pretty debilitating autoimmune disease, and I want to help her in any way I can; and as an RN, I've felt frustrated not being able to really help her, and witnessing doctors dismissing her symptoms.  Apparently, I had to spend $397 extra in order to deal with illnesses on that level. I felt this a bit deceptive. But, I went along with it and am praying this whole program isn't a scam. That's how my heart is feeling right now. This played out like a typical marketing ploy that, unfortunately, I am very familiar with. Now, with that off my chest, I will share a little about me that brought me here. I am a BSN nurse of 32 years who has worked in adult cardiac, neonatal intensive care, longterm care, and hospice care. Due to my heart for the elderly, I left hospice to open my own private senior care home. We ran that for 9 yrs and sold a year and a half ago due to staffing issues after COVID.  I was working on starting a senior care management business when I started to learn more and more about functional medicine in looking for answers for my daughter. My Mom also suffers with some chronic issues, as well. I'm looking to start a new chapter in using my nursing skills and desire to help people to make a difference.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3179.jpeg"
  },
  {
    "firstName": "Kari",
    "lastName": "Castelli",
    "content": "The last 10 years I’ve been interested in natural/alternative health. The more I learn about our “sick care” system, the faster I’m running in the other direction. In 2021-2023 I completed levels I and II of an empowerment coaching certification program as well as level I in hypnosis and NLP. I have yet to do anything with those but thought if/when I did, I’d to focus more on health coaching. I’m also interested in having something ready for retirement. I’m 62, working full time and will probably have to work until my full retirement age of 67.  I would love to retire sooner than later if I could.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3178.jpeg"
  },
  {
    "firstName": "Calith",
    "lastName": "Sprock",
    "content": "When I was growing up I have struggled school, barely passed High school, flunked jr. college, worked at various jobs, never really being able to hold it down for a long time. Got married then she divorced me 6 years later. Was diagnosed with MDD and had 2 attempts in 2012 when I was 24. And have struggled with depression  and SI nonstop. I wanted to be a HS music teacher. And so since I loved teaching merit badges at BSA summer camps, I got into being a paraprofessional. With Autistic students. 2 years in the para position, I was desperate for any relief from the MDD and was on Medi-Cal and was approved for Electroconvulsive Therapy, (ECT … same as in “the one who flew over the cuckoo’s nest”) and did over 60 treatments. Later that year I met my the love of my life (now my wife) and got married  once things started opening up after Covid, in 2021. Two years ago I finally made I breakthrough with my SI and started addressing that. Then last year I started my spiritual healing when going through the 3 levels of becoming a prayer Minister. Then This year has been shocking because I found out I have 2 gene mutations with my MTHFR and really want everyone to know about it and the solution with Enlyte and how it is possible and helping me. I love teaching people and love seeing that lightbulb go off in their heads when they understand it. I enjoy helping people and have always been fascinated with the medical field. I have always enjoyed Math and Science. And ELA has been my biggest struggle.  Why I chose this because currently working with the current charter school that my job feels boring. (there are a few times where I feel like I get to teach and help a student, though to far separated from each other.) currently I’m getting treatment for MDD / treatment resistant depression with an integrated Treatment Doctor and am fascinated by her approach and how much it has helped me in this short 5 months vs. the 13 years from 2012-2025. Hopefully this gives a good snapshot of me. I also am a husband and Father of 5 kids (15,13,11,5,3.5 years old) I also married into the 3 older boys. So my life is chaotic with lots to do and not enough time.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/image-BFK216LightZeke2.jpg"
  },
  {
    "firstName": "Scherry",
    "lastName": "Bumpus",
    "content": "I have a BS in Healthcare Admin, Minor in Gerontology, and computer based training certifications...currently working 9-5/Job for a medical manufacturing company...looking to build a retirement income that I can do from home...help people, get paid well...without pushing the long hours.  I have two years to retirement...looking for full-time income with part time effort...and able to be be my own Boss.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1830.jpeg"
  },
  {
    "firstName": "Lisa",
    "lastName": "Gagliano",
    "content": "God called me to become a nurse in my early 30's, after being in Retail and Hospitality Management all during my 20's. Earned my RN in 2013 (36 yo), then in 2014, God said I would have a Global Dementia Biz - that Freaked me out!!! I worried about licenses and buildings and international laws, and it caused A-fib one night actually, for about 15 minutes, until I used breathwork to revert back to the parasympathic nervous system. A telehealth nurse said I should have a full cardiac workup and that I was putting my life in danger by not going to the ER. That infuriated me. I know how to handle my body, I was just overwhelmed with God's vision. This was all before Online Courses and Coaching was popular.  In 2022, I finally figured out how to create and online course, with Kajabi, and recorded videos and learned how to write an eBook (all without AI...lol) for my \"\"Decrease Dementia - Naturally and without pharmaceuticals\"\". I had been researching holistic/whole body health, like they teach in RN school, and truly fell in love with teaching people about reducing the chronic inflammation in their body to reverse and prevent: dementia (type 3 diabetes now), diabetes, congestive heart disease, chronic kidney disease, and alllllll the side effects of those major diseases - all due to inflammation and adrenal fatigue.  (tried to promote my course on YouTube and Instagram, not a single client or eBook sale yet. So, I inform the church ladies and they listen, but don't apply - so I knew I needed to learn how to coach effectively for transformation and to have the patient want to do this, instead of have to do this. I've been praying in November of 2025 - what God wants me to do, since I was not able to make any of these business ideas work.  Then your $97 ad came up on Instagram - thank you Sarah and God!!! Finally, a course where I can get the certifications (even International - so I can have a Global Business, like God said!!!) and the Coaching Training - to learn How to be an effective coach for client's transformation (what I had been looking for!), and the business skills - set up, Bookkeeping, Legal for scope of practice, and how to market, scale, and exit - this is an Extraordinary Course!!!! Others only sell pieces of this for $2000-$8000 - none of which I could afford, since I have no credit cards with my Bankruptcy. I am truly blown away by your course - I've opened all the modules to see the section titles, and I'm so blown away. This is what I've been looking for!!! Thank you soooo much Sarah!!!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/c24406c9-8a43-4874-8c0d-43112e0b45a1-1_all_2897.jpg"
  },
  {
    "firstName": "Nabila",
    "lastName": "Buhari",
    "content": "I want to improve my self and help as many as I can",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/c24406c9-8a43-4874-8c0d-43112e0b45a1-1_all_491.jpg"
  },
  {
    "firstName": "Michele",
    "lastName": "Mathers",
    "content": "I have always wanted to work in the natural health industry. I have started aromatherapy, enrolled nursing didn’t complete either. Functional medicine and herbal medicine is something that I have been following and using for a few years. Now it’s my turn to be on the other side helping others to heal from health issues that western medicine is not seeing or helping to heal.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000002069.jpg"
  },
  {
    "firstName": "Richard",
    "lastName": "Tandaju",
    "content": "I'm a graduate student in clinical mental health counseling. I was considering starting a coaching business while completing the practicum and internship requirements to supplement my income.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000001721-1.jpg"
  },
  {
    "firstName": "Kay",
    "lastName": "Dempsey",
    "content": "Chronic pain and gut issues",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3857.jpeg"
  },
  {
    "firstName": "Linda",
    "lastName": "Conner",
    "content": "Good morning.  I just want a life where I feel like I’m truly contributing.  I was a nurse I gave up my license after Covid when I realized that I had spent so much time off the floor and administration that I was no longer true asset to the floor doing patient care.  I’ve become burnt out in the toxic environment that is my job. I just want to help people feel good about it and trust that what I’m doing has value.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Aiyani-2025.jpg"
  },
  {
    "firstName": "Lori",
    "lastName": "Latona",
    "content": "I have been wanting to incorporate functional medicine into my practice but haven’t had time and money since I opened my own practice.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0913.jpeg"
  },
  {
    "firstName": "Kate",
    "lastName": "Okolie",
    "content": "Have been working hours of nursing jobs and recently had a work injury, since the injury has been under paid and want my life back",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/CraftRealty2024-6337-EditHiRes.jpeg"
  },
  {
    "firstName": "Marian",
    "lastName": "Hogan",
    "content": "I love staying healthy and helping others with discovering why they do not feel the way that I do, so felt this would be a good investment for me and my future.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/FullSizeRender.jpeg"
  },
  {
    "firstName": "Roxy",
    "lastName": "Gustafson",
    "content": "It is my calling to help people! I am passionate to get to the root cause and help people deal with the under cause. What causes the symptoms in the first place. Not manage symptoms with medication and stop there. But deal with the cause of the disease. What we eat and how it affects us, and our daily routine activities. I am a nurse. I see everyday how people are being mismanaged and being referred to different specialists with no actual results, and are being told you need to take more prescription medications. I wished I could do more for them. Help them live a live of freedom in their own body.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_7233.jpeg"
  },
  {
    "firstName": "Sara",
    "lastName": "Warth",
    "content": "Identifying problems and finding solutions for myself and others is fascinating work and something I can be passionate about. Being paid for that knowledge and value is even more motivating to me.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Tammie-15.jpg"
  },
  {
    "firstName": "Doreen",
    "lastName": "Ogoro",
    "content": "I am an RN and I always feel like the way patients are treated in healthcare is just to suppress the symptoms. I would like to learn the root causes and help them heal by the Grace of God.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Charicature-no-brands.jpg"
  },
  {
    "firstName": "Waltraud",
    "lastName": "Hebert",
    "content": "I have an integrative nutrition certificate but kept it mostly for my personal use. When I had the opportunity to share my knowledge with others I did it pro bono. Never started and used my knowledge for income.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Root-Causes-tree-diagram.jpeg"
  },
  {
    "firstName": "Elif",
    "lastName": "Mergen",
    "content": "I have psoriasis and thyroid. My son has autism and mental disability",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/503875688_10232645757541204_8121580173178761599_n.jpeg"
  },
  {
    "firstName": "Annelie",
    "lastName": "Ginn",
    "content": "My journey began as a physician trained abroad, and for the past 20+ years I’ve worked as a registered nurse here in the U.S., primarily in case management, research, and quality improvement. Over the last 15 years, care management has truly become the center of my professional life, it’s where I’ve found the deepest meaning in helping people navigate complex health systems and improve their outcomes. More recently, I’ve moved closer to the integration of mental health and behavioral health, and I see how critical this is for whole-person care. Investing in this certification felt right because it aligns with my lifelong commitment to making a tangible difference in people’s lives. It’s not just about advancing my career; it’s about equipping myself with the tools to serve patients more fully, with compassion, evidence, and impact. I am also on my way to completing my PMHNP, expect to graduate early in 2027.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0476.jpeg"
  },
  {
    "firstName": "Deborah",
    "lastName": "Adadjo",
    "content": "I'm a registered nurse, and have worked in many different fields. But I'm disappointed in the lack of care that is in our health\"\"care\"\" system. Especially as a woman. I feel like we are often overlooked, due to male doctors thinking we are \"\"just emotional,\"\" or women doctors not digging deep enough or trusting their own clinical judgement. I believe this program can bridge the disconnect. This program seems to be just what I have been searching for (for a long time), that will help me feel like I'm helping my patients, rather than just throwing pills, ordered by doctors who may not even have listened closely enough to get it right, at my patients. I decided to go ahead with the advanced programs so I can be successful out of the gate.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/66084696442__FE17E467-43C5-47F8-949F-6FA1A876E4E0.jpeg"
  },
  {
    "firstName": "Justin",
    "lastName": "Yen",
    "content": "A lot of current business issues, not equipped to handle patient issues.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/foto11.jpg"
  },
  {
    "firstName": "Justin",
    "lastName": "Yen",
    "content": "Get out of business debt, try to get contracts with corporate companies, credibility with those companies",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Li-.jpg"
  },
  {
    "firstName": "Mfon",
    "lastName": "Dancy",
    "content": "I have been a nurse for over 14yrs, got into holistic health when my husband was diagnosed with MS. I discovered healing protocols involving diet changes, mindset shifts and spiritual wholeness, I used holistic healing for DM, obesity, leukemia but I want to start my practice without becoming an NP…. I want to go deeper clinically to make a difference with preventable diseases.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/inbound8265382786610706378.jpg"
  },
  {
    "firstName": "Teri",
    "lastName": "Katzenberger",
    "content": "I have been a Functional Health and Lifestyle Wellness Specialist Practitioner since 2005. On my own personal health and body wellness journey since 1991 - People are my passion. I have dedicated my life to helping others live their best life! I help people live a healthy, well, fit, strong, whole life from the inside out without fad diets and limiting programs. Specializing in fitness, nutrition, weight management - targeting our overall health and body wellness. I help people regain control of their life by getting to the root cause of their struggles; internal health as well as mental and emotional health. I provide Food Testing, Nutrient Testing and Personal Attention. I have the solutions to unhealthy causes.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/inbound7625720570900291865.jpg"
  },
  {
    "firstName": "Bernard",
    "lastName": "Harris",
    "content": "Wanted to see whether it’s feasible for me at this stage of my career.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/20251117_110937.jpg"
  },
  {
    "firstName": "Rebecca",
    "lastName": "Lennon",
    "content": "I’m on a spiritual retreat and I heard the calling.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_8111.jpeg"
  },
  {
    "firstName": "Jan",
    "lastName": "",
    "content": "I have been a nurse for 16 years but have become increasingly more interested in functional health for chronic disorders.  I want to learn as much as I can about finding the root cause and not just treating symptoms.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1684.jpeg"
  },
  {
    "firstName": "Pamel",
    "lastName": "Badgett",
    "content": "I was recently diagnosed pre diabetic. once I started working with a nutrionist I became intrigued about lifestyle changes to help change my health. Also I take care of my mother who was hospitalized this year with b12 deficiency. with excercise and lifestyle changes she has improved. I am now on a journey where I want to help her and I live healthier lives as well as helping others",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1198.jpeg"
  },
  {
    "firstName": "Gwenda",
    "lastName": "Smith",
    "content": "The ad got my attention like a beaming headlight. I liked what you said it resonated with me. I felt it was a great certification that ad to my current bio and would support my work tremendously. I have a life time passion of helping people live a healthier, more harmonious life. My dedication to this passion began at age 16 when I began my nursing career. It was things i noticed about the way patients were not getting better, and when 4 patient in the same room had the same diagnosis on the same treatment yet they did not fully recover. I was intrigued and when an opportunity to be a seniour scrub nurse in the operating theatres presented itself I jumped at it. i wanted to know what we look like inside and what disease looks like. It was a profound experience in with a patient that changed my acceptance of sickness and disease. We opened her up to remove an abdominal tumour, when we got to the augmentum it was grey and lumpy. The surgeon said \"\"Suture up\"\" we had not done anything. he saw my quizzical look and said \"\"Well nurse, you can see the same as me. This lady has 14 days to live\"\" he asked that I go with him to deliver the news, which to this day is not protocol. She was not fully conscious when we went to her bedside. He spoke to her, she smiled until he said \"\"When you are awake I want your husband to take you home. In 8 days you will return to the hospital as you will be very unwell. Enjoy the days at home with your family. You have 14 days to live\"\" We walked away leaving her in tears. On the 8th day I admitted her to the ward, she was very unwell. I laid her out on the 14th day. I cried as I did and I made a pledge to her, I wanted her life to mean more than \"\"14 days\"\" I said I would go on a quest to know more of what is illness, disease and dying is, in her honour. And I have been on that quest for over 36 years. I have a natural ability to see into the body and energy fields like an MRI machine only I am more precise. The different studies/certificates I have done have provided a foundation that I unite with that natural ability for me   to help clients. I am thrilled and deeply grateful to take up this course with you Sarah.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0182.jpg"
  },
  {
    "firstName": "Martin",
    "lastName": "Zidell",
    "content": "My parents health have declined rapidly this year and I’m seeing the writing on the wall with all the doctor visits with no positive results. It’s now or never for them. So if I can’t help them soon, they won’t be around as long or have much good health left. I would like to help my family, friends and others that are tired of the dead ends with the doctors and are looking for real solutions other than more drugs and surgery.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1692.jpeg"
  },
  {
    "firstName": "Nazik",
    "lastName": "Meledonian",
    "content": "i was blessed by natural medicine and lost 90 pounds",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1904.jpg"
  },
  {
    "firstName": "DIANNA",
    "lastName": "STERLING",
    "content": "I have been a nurse for almost 50 years and no longer have the passion or energy to continue clinical nursing. My passion is too help others lead a healthier (physical, emotional and mental) life.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1321.jpeg"
  },
  {
    "firstName": "Marissa",
    "lastName": "Thomas",
    "content": "I believe the body was created to heal.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Bron-Paleo-Pic.jpg"
  },
  {
    "firstName": "Faye",
    "lastName": "Fields",
    "content": "I had long Covid and was very sick and researched the holistic way of healing the body and and basically it healed and I would like to help other people heal their body",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Screenshot-2025-07-17-172526.jpg"
  },
  {
    "firstName": "Doris",
    "lastName": "Hanger",
    "content": "I have been studying prevention and wellness for my own personal well being for 40+ years. It has served me well. I come across women and men frequently with health issues. I have some knowledge from Young Living Essential Oils since 2001 and other seminars, and personal learning and yet I feel like I have part of the knowledge, if someone was to follow me and trust me - I can help them. However, just to take my word for it and not have \"\"facts, figures, data\"\" to back it up what I \"\"say\"\" it falls flat and nothing happens. Mean time I am a busy girl so if you want it, you will have to actively seek me out. I am over trying to convince anyone of a better method. Too many times I hear, my insurance covers it so I will go this other route.  Overall in would say I am in excellent health and over 60 people usually think I am in my 40's. Plus I have a lot of energy, more than most. And I have many people I know with various health issues that I would like to help.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/39.png"
  },
  {
    "firstName": "Wren",
    "lastName": "Royal",
    "content": "I want to get out of bedside nursing, work for myself and help people in a different way.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0124.jpeg"
  },
  {
    "firstName": "Erica",
    "lastName": "Myers",
    "content": "I was diagnosed with PCOS and could not conceive. After lots of research and changing lots of my habits,along with using an herb called False Unicorn, I healed myself and managed to get pregnant twice.I would like to use what I learn from you to coach people on how to have happy healthy pregnancies.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0002-1.jpeg"
  },
  {
    "firstName": "Diana",
    "lastName": "Nagy",
    "content": "To be honest, I did it mostly for myself, to heal myself. I suffer from a long time bulimia, mental health also my daughter has mental health issues. If I can heal myself and plus be able to help others on the way, I would be finally happy and content with my life.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/952.jpg"
  },
  {
    "firstName": "Maureen",
    "lastName": "Delaney",
    "content": "Quest to empower self-healing beyond medical solutions",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/942.jpg"
  },
  {
    "firstName": "Diana",
    "lastName": "Nagy",
    "content": "To be honest I am here because first of all I want to heal myself and if in the process of healing I can help others the better. I also would like to have something meaningful into my life with what I can achieve financial independence. I am 53 years old, I live in Switzerland, but I am originally from Hungary. I was a stay at home mom, always doing some side hustle, just wanted to be there for my children, here in Switzerland, children come home for lunch and there are days when they don’t need to go back to school, so I decided to be a stay at home mom. Now my children are grown ups, and I try to find a job since 5 years now, with absolutely no success. Ageism is a thing in Switzerland, which I was not aware of but I can see that now. Today a I saw your ad on Facebook and something resonated and so here I am.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0406-1.jpeg"
  },
  {
    "firstName": "Keira",
    "lastName": "Schindel",
    "content": "Hi Sarah! I'm 35 and feeling so far behind on my career. I can do Admin and Customer Service with my eyes closed but I truly want to help change people's lives. I've considered taking personal training qualifications and moving towards supporting people with optimizing mobility but I've been putting that off for over 2 years. I guess that was the Universe telling me something more effective was on its way.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0406.jpeg"
  },
  {
    "firstName": "Maureen",
    "lastName": "Delaney",
    "content": "Quest to self-heal beyond doctor diagnosis",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/jimonthefarm.jpg"
  },
  {
    "firstName": "Beulah",
    "lastName": "Hammond",
    "content": "I have struggled personally for many years with weight loss resistance, migraines, arthritis, chronic pain, and now heart issues. I have spent tens of thousands on doctors, coaches, supplements, and devices — all to little result.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0483.jpg"
  },
  {
    "firstName": "Michael",
    "lastName": "Kocsis",
    "content": "I have been on my fitness & health journey for more than 40 years. I am a former 100% Natural (no drugs ever used) professional fitness model & bodybuilder; 3 times Mr. Natural USA & 6 times “Top 5 in the World”.  However, I succumbed to illness in my 40’s. I struggled for 10 years trying to recover from leaky gut syndrome, diverticulitis, colitis, and other issues. I have things under control now (in basic remission) and continue to take care of myself daily with the use of superfoods, herbs, and other supplements. I also, help others with gut issues that lead to all forms of inflammation. I want to learn more to help others more.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/b4ace562-9d2c-4fc9-ab7d-961a234e4184.jpeg"
  },
  {
    "firstName": "Hillary",
    "lastName": "Sigulinsky",
    "content": "I am a registered nurse who works at an elementary school. I have co-workers, concerned parents, and my own family members who come to me with questions because their healthcare provider is unable to help them relieve their symptoms. I have recently been researching herbal medicine, and I’m convinced that herbal remedies/diet should always be our first go to instead of jumping straight to the pharmaceuticals. I’m really excited to start this journey! Can’t wait to learn more!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Black-and-White-Abstract-Congratulations-Instagram-Post.jpeg"
  },
  {
    "firstName": "Marika",
    "lastName": "Ulbrich",
    "content": "I love to learn about how to help how to heal and make a difference to the normal medical system, I suffer from chronic pain also I am exposed to mold also I love to finnisch my university degree and love to learn in English and I am interested in knowing about the optimal health e g hormonal health for women not just the standard that’s normal you have to accept what’s happening , also I just love to learn and be professional and to earn effortlessly with purpose and real value 🙏🏻🙏🏻🙏🏻",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/tempImageAvCNhp.jpg"
  },
  {
    "firstName": "Flora",
    "lastName": "Hearst",
    "content": "I help people for free with natural health and want to instead up level my skills and also get paid and paid well. I am a busy mom and (passionate but low-paid) head teacher.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0001.jpeg"
  },
  {
    "firstName": "Shona",
    "lastName": "Hillman",
    "content": "I have been a family physician for > 30 years.  I think listening and compassion are my strengths.  I still feel wanting at times.  When I have time to study I work faster.  Still people say integrative medicine, functional medicine and natural medicine have answers I may not have.  My communications skills and boundary setting can improve.  I'm excited to be welcomed to this community.  I am ready to work less and try to retire at least part time!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_9675.jpeg"
  },
  {
    "firstName": "Felicia",
    "lastName": "Gouveia",
    "content": "All my life all I've ever wanted to be was a doctor, particularly a surgeon. I've always been drawn to the medical field but due to time and money opted to go the nursing route. I took all my prerequisites and received my associates of arts degree while being put on eternal waitlist for the programs since 2007. I had moved back to Arizona from Michigan to California and back to Arizona again From 2008-2023. Of Course I joined the waitlist whenever I moved. I had moved from Cali back to Arizona in 2015 to help my parents in caregiving for my grandmother that suffered from Parkinson's, Alzheimers and Dementia heart breaking to watch her deteriorate. I peered into other medical career options as well such as clinical research. I took a brief course on that which really helped raise my antennas when covid came on the scene. I very quick realized the game being played and how unethically things were being handled. Over the years I noticed how they try to discredit or keep hidden those helping people heal naturally since of course big Pharma doesn't want to get to the root. Don't get me wrong there are absolutely times when we need allopathic care but the healthcare system here in America is driven by greed instead of really helping people. I've seen this too many times and with medical Mal practiced that has happened to my close family members. I had 2 nephews that went autistic around 2 years of age post vaccines.  As an African American woman I have seen this in our community with those who have sons that were on todays vaccine schedule which has at least doubled since the 80's. It's an epidemic within the black community and its heart breaking seeing the families of such ones navigate to get healing for a system that has failed them. a seem this in pretty much ever  In Sept of 2020 I was finally supposed to start a nursing course at Pima medical institute However the way covid was being handled and the vaccines they were forcing people to take didn't sit with well me, nor did being in a mask 12+ hours a day if I declined the vaccine. I realized the terrible state our healthcare is in and know I will have to serve my purpose of helping people to heal in a natural way. So many have been failed by the system that more and more people are looking for an alternative route. With the rising cost of premiums and medications I believe people will have no choice but to return to the natural route and want tube able to be a part of that change and make a true difference. Cant wait to get started. Looking forward to meeting or speaking with you.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_8711.jpeg"
  },
  {
    "firstName": "Lindsay",
    "lastName": "Pirie",
    "content": "Hi Sarah :) Honestly, I am 47 years old and I am a healer by nature and find immense joy in helping people live their best quality of life, but in the last couple years I have felt more drained than joyous. I'm going through perimenopause, raising a teen that deals with some huge life struggles, cared for a sick parent for 2 years before he passed a year ago this last Monday, worrying about a mother whose now alone and too far from me to watch over.......and running a full time business that feels like its sucking the life out of my husband and I. Kind of wondering what door Joy left from? lol. I used to do one on one sessions with Nutrition clients, and I loved it but there were two issues, one is that I couldn't earn what I needed to support our family and lifestyle, and two.....although I believe nutrition is so important, I wished I could offer people more. My husband and I happened to get involved with an amazing health technology 10 years ago that led to a career in sales. Very rewarding as I was helping people while also being rewarded financially. Unfortunately, that job we had created has taken a turn and is no longer feeling the same and certainly is not producing the same financial freedom as it was. It's been two years of feeling drained and not feeling less secure financially. I want to return to my work with clients but in a wy that allows me more time with my family and supports me financially. I saw your program for a few months and it just resonated with me and so here I am :)  I am ready to work smarter and really enjoy my job, find my joy again......and makes some money doing it!!!  lol.    This won't be shared anywhere will it?  lol. As I was writing, I thought I really hope this is just a private convo .  lol. Looking forward to I'm doing this part time so might take a little longer than others.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Thrive-Haven-Facebook-cover-2.jpg"
  },
  {
    "firstName": "T. Joel",
    "lastName": "Kemna",
    "content": "I have a big story strting at an early age with health issuesd. But to fast forward I have been in Architecture and land development for over 20 years. I have lived with a rare blood immune disorder form 28 to survciving non secretoral Multi myloma. My siaste wne t a different direction than me 4 years ago with her cancer battlem and passed away this summe.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/2023-Lambert-163.jpeg"
  },
  {
    "firstName": "T. Joel",
    "lastName": "Kemna",
    "content": "A lifetime of keeping myself alive as a professional in architecture and land development. Doctors couldn't help a rare blood disorder and non-secreting multiple myeloma since the age of 28. My sister passed away this past summer from cancer, and I had no real training to help her in the way I found functional health and nutrition—a passion for education and changing lives.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Me-1.jpg"
  },
  {
    "firstName": "Juanita",
    "lastName": "Morales",
    "content": "Would like to go into business for myself when I retire. I would like to focus on wellness and disease prevention.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_8230.jpeg"
  },
  {
    "firstName": "Esther",
    "lastName": "Dollet-Hemphill",
    "content": "I am an LPN and a mother of two incredible children plus a wife. I am planning to start my RN program this coming Winter and I love solving health problems. My husband and I are very fatigued and we have gained weight, I want to start by solving our health problems first and get us to healthy weight and not feeling tired all the time. Then I want to work from home and still be  able to help others with their health issues. I love anatomy and physiology and I want to be able to solve the root cause of diseases and help as many people with chronic illnesses live a full healthy life.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Teal-Polaroid-Wellness-Influencer-Facebook-Cover_20240616_172130_0000.jpg"
  },
  {
    "firstName": "Kate",
    "lastName": "Wilson",
    "content": "I feel stuck, I injured myself halfway through a nursing degree which has pushed it back by18mths before I can graduate. Hubby and I would like to travel and that was our plan to be able to do so. I feel like I have let us down.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/20250928_115628.jpg"
  },
  {
    "firstName": "johanna",
    "lastName": "neva",
    "content": "I had thyroid (hypothyroidism) symptoms for 7 years, and doctors told me my blood tests were fine and that I was perfectly fine. I gradually lost my ability to work, and was having debilitating gut symptoms and constant neck pain. Last year I found a functional medicine coach, who finally helped me and directed me to a functional medicine doctor abroad, and finally I have gained back my health.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_7880.jpg"
  },
  {
    "firstName": "Analusette",
    "lastName": "Shaello",
    "content": "I’m a health coach and personal trainer. I want to add a level of knowledge to my coaching that I know will help me as well as my clients.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_5411.jpeg"
  },
  {
    "firstName": "Cheryl",
    "lastName": "Kling",
    "content": "I am a FNP and want to be able to offer my patients more. In addition I would like to offer more outside of the office I work for and have a business on the side to help retire and enjoy life",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000021219.jpg"
  },
  {
    "firstName": "Chelsea",
    "lastName": "Decker",
    "content": "I am looking to expand my scope of practice and ability to help my clients.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000021063.jpg"
  },
  {
    "firstName": "",
    "lastName": "",
    "content": "NP and on my own practice, but looking to expand my coaching skills for wellness, thyroid, hormones, etc.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/d410aeba-d79d-4e69-a38e-061c7da133e5-1_all_391.jpg"
  },
  {
    "firstName": "Christine",
    "lastName": "Adams",
    "content": "I personally have had health struggles and have always been interested in holistic health and want to increase knowledge and potentially help others.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/9VXaTPaDNBmIzZao9NAjhg.jpeg"
  },
  {
    "firstName": "Shawn",
    "lastName": "Durbin",
    "content": "I'm burnt out on chiropractic. I'm looking for something that excites me. I really want to help severely troubled patients. Weight loss and balancing hormones is very exciting to me. Also, helping people with Lyme's would be awesome.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/92D4D779-B2EA-454E-B0A8-DA0F9D0DCC21IMG_20221015_140912.jpeg"
  },
  {
    "firstName": "Cheryl",
    "lastName": "Kling",
    "content": "I am 62 years old and have received my masters degree as an FNP pretty late in life - age 58 to be exact.  I love what I do but I feel as if there is more to do.  In addition I am buried in student loans and wonder how I will ever retire after accumulating debt that I acquired to help others.  So, I am going all in bc I want to help others and I want to be able to pay off debts and still help others and not be married to my charting at home.   As I see it my FNP and this certification will go hand in hand.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000007097.jpg"
  },
  {
    "firstName": "Danielle",
    "lastName": "Crumble Smith",
    "content": "I am a Registered Dietitian and I have always viewed the body as a whole. On my own I've learned about Integrative and Functional Nutrition but I want to get formal training in order to best support my patients. I've learned a lot through personal experiences with autoimmune diseases but having the firm knowledge base is crucial.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000010407.jpg"
  },
  {
    "firstName": "Dawn",
    "lastName": "Van Berkel",
    "content": "It's an interest I've always had.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/heart-hands.jpg"
  },
  {
    "firstName": "Jenna",
    "lastName": "Beem",
    "content": "I’m an acupuncturist and hormone specialist who helps women over 40 reset their hormones naturally. I want more coaching skills.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Free-of-shackles.jpg"
  },
  {
    "firstName": "Deborah",
    "lastName": "Kane",
    "content": "I am a certified CBT life coach. Right now, I help moms lead with emotional intelligence at home & business, so they can raise empowered kids with EI, EF, and AI literacy.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/image.jpg"
  },
  {
    "firstName": "Scott",
    "lastName": "McKnight",
    "content": "I am a nurse by trade and my wife is an educator. We have a lavender farm where we handcraft a variety of products for our customers. In addition to those products, we also offer an abundance of health and wellness products for our customers such as supplements, essential oils, protein powders, electrolytes, etc. We continue to get asked about functional medicine and ways to improve their health. Thats why I signed up.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/2_flamingoes_standing_in_a_pond_with-3.jpeg"
  },
  {
    "firstName": "Silvia",
    "lastName": "Counts",
    "content": "Functional and Integrative Medicine is where it’s at!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/20250814_110356.jpg"
  },
  {
    "firstName": "Nikisha",
    "lastName": "Cobb",
    "content": "I want improve my health and others",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000018650.jpg"
  },
  {
    "firstName": "Regina",
    "lastName": "Mitchell",
    "content": "I have a passion for health. As a RN I like to help people. I also feel there is always more to the story, and I would like to help figure this out.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000014212.jpg"
  },
  {
    "firstName": "Heather",
    "lastName": "Gamm",
    "content": "Looking to add tools and education to address complex cases.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000002033.jpg"
  },
  {
    "firstName": "Jessica",
    "lastName": "White",
    "content": "I’m a nurse and love holistic care",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/133793351479491216.jpg"
  },
  {
    "firstName": "Taryn",
    "lastName": "Treu",
    "content": "I’ve been nurse for 19 years, between ICU and ER nursing. For the past 9 years I have been interested in holistic lifestyle and have been disappointed in how conventional healthcare treats patients concentrating on symptom management instead of root causes.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/a80712a74a384ee1bffe66c6b1ee311e.jpeg"
  },
  {
    "firstName": "Marisa",
    "lastName": "Avenengo",
    "content": "Personally very medically complex. Pre-med background looking to go into osteopathic medicine (DO) and want to be able to assist myself and others in holistic ways when possible",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000002316.jpg"
  },
  {
    "firstName": "Crystal",
    "lastName": "Powell",
    "content": "My business needs an edge",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0546.jpeg"
  },
  {
    "firstName": "Lucky",
    "lastName": "King",
    "content": "My Health Journey with Epstein Barr and ALL that God gave me to learn. I am often asked for help or opinions from others that are trying to find True help amidst the www and AI black holes. \"\"Traditional Western Med\"\" had NO answers or help because they are not taught Whole Body cause or preventive or Natural Support & Solutions. I am called to be a Servant & a Warrior.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/2011-Erien-Casual-on-Brick-alone-edited.jpg"
  },
  {
    "firstName": "Ilze",
    "lastName": "Riedelsheimer",
    "content": "Hi, Sarah, so happy to meet you. I am a chef and a hobby nutritionist. I am 46 years old, and it is time to learn something else for my future. I have been looking for options for months now, and this course is the first one that stuck with me.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0782.jpeg"
  },
  {
    "firstName": "Crystal",
    "lastName": "Biela",
    "content": "I know that I can help my clients on a deeper level.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/image0.jpeg"
  },
  {
    "firstName": "Elisha",
    "lastName": "Jones",
    "content": "As a holistic esthetician I want to be able to understand my clients better and guide them into improving their overall wellness.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_8313.jpeg"
  },
  {
    "firstName": "Karen",
    "lastName": "Maguire",
    "content": "I’ve been a licensed occupational therapist for decades. I have a license in social work as well. I love being an OT. I chose to drop my SW license (which was foolish at the time), because my passion is helping people through OT. SW skills are also used and building but OT considers the entire person. Your program (I hope) will help me to serve my clients more in-depth and help them to resolve issues… which is my goal in helping humans to be their best as they age ( at ANY AGE).",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/inbound5307315020124298583.jpg"
  },
  {
    "firstName": "Karen J",
    "lastName": "Desouches",
    "content": "I’m a wellness practitioner and I know a lot about the body but I need the science behind it. All I do is intuitive and somatic and I get great results but I don’t have a certification to show that’s why I decided to take this certification and be backed up by lawyers. I’m excited",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/download-2025-09-10T000723.487.jpg"
  },
  {
    "firstName": "Mary",
    "lastName": "Ludwig",
    "content": "Completed RN degree, wanting to become holistic health nurse..needed in today's world.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/LinkedIN_Demetria-Rutledge.jpg"
  },
  {
    "firstName": "Karen",
    "lastName": "Maguire",
    "content": "I just answered this on the initial application… but, here it is in short: I’ve been working in the health care arena for over 45 years. I treat the ‘whole’ person. Physical, mental, social, spiritual, emotional (and the rest) to be as independent as possible, through the journey of the healing process.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3562-1.jpg"
  },
  {
    "firstName": "Ashly",
    "lastName": "Dean",
    "content": "I have several illness and I work with others who do as well with my LCSW.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/BEAVER-MOON-BEAUTIFUL.jpg"
  },
  {
    "firstName": "Michelle",
    "lastName": "Millecam",
    "content": "I am a board certified health Coach and functional medicine nutritionist but need guidance on the business side to truly help and empower others. I have had my own health journey and feel called to help and empower others! Thank you",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3025.jpeg"
  },
  {
    "firstName": "Sharon",
    "lastName": "Baker-Hughes",
    "content": "I was diagnosed with a rare disease in 2015. It devastated my life. I was bedridden within 6 months and every time I went to sleep I wasn’t sure if I would wake up. I was in so much pain that I was in peace with that except for leaving my kids. In the last 10 years I earned a PhD, and another “master’s” in my disease. My life has improved tremendously. Unfortunately, my son died from the same disease. I want to be able to help women improve their daily lives and health in a way the medical system cannot. I don’t ever want to tell someone I don’t believe their symptoms because it doesn’t match what I was taught in medical school - a place that still rarely studies women.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_4414.jpeg"
  },
  {
    "firstName": "Shawna                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        Shawna",
    "lastName": "Remy",
    "content": "I am a Medical Massage Therapist and I would like to add functional medicine coaching to my practice",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_3075-2.jpeg"
  },
  {
    "firstName": "Jennifer",
    "lastName": "Gretzmacher",
    "content": "I am retiring in June, 2026,  from elementary education after 25 years. When evaluating my next stage, I really wanted to continue to help people learn more about how to be the best and healthiest they can be. I’ve been struggling myself with weight gain through menopause, finding my medical practitioner is not very helpful, and doing a lot of research on my own. I find this topic interesting and empowering. I’m also looking for a career that gives me flexibility, work on my terms, and provide a comfortable lifestyle.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_1696.jpeg"
  },
  {
    "firstName": "Neveen",
    "lastName": "Nofal",
    "content": "I coach clients to improve their health outcome inspired by my own health journey",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Liz-Sept-2023-headshot.jpg"
  },
  {
    "firstName": "Autumn",
    "lastName": "Matto",
    "content": "I am very interested in functional medicine",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/Peak-Health-VIP-087.jpg"
  },
  {
    "firstName": "Liliya",
    "lastName": "Blake",
    "content": "Overworked medical assistant trying to make a charge for better for myself and my family",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_4192.jpeg"
  },
  {
    "firstName": "William",
    "lastName": "Schuh",
    "content": "As far back as I can remember, I have been curious about what makes the human body function.  I have also been interested in electronics, various processes  and how almost anything worked.  I was discouraged by many about going into medicine because it was changing so fast and becoming an insurance servant instead of taking care of the person.  Now at 67, I am not going to let any of that hold me back.  Years ago I got a BS in Physics and a MS in Biology (Immunology and Clinical Ultrasound).  I have watched family members needlessly suffer through the medical processes most doctors follow and people ignore me because what do I know.  Because I don't see a practical way of becoming an MD, your certification looked like a safe start to see if I can contribute to my family's life, my life and many others who need help.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_7962.jpeg"
  },
  {
    "firstName": "Susan",
    "lastName": "Silva",
    "content": "I am a burnt out PA sick of throwing pills at all my patients. Plus I have personally had amazing results from working with a functional medicine provider. The combinations of those two things led me to this!",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_0583.jpeg"
  },
  {
    "firstName": "Katherine",
    "lastName": "Garcia",
    "content": "Expand my wellness career",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/22-07-2024-11-07-10-DB.jpeg"
  },
  {
    "firstName": "Naomi",
    "lastName": "Withers",
    "content": "I used to be a Professional Herbalist (about 20 years ago) and I loved helping people but didn’t have the business skillset and wasn’t brave enough to really put myself out there to sell. Then I started working in corporate financial leadership and completed my Executive MBA degree. Just left my corporate job in October 2025 and recertified as a Certified High Performance Coach in at the beginning of November and am working on my business and offering. I’ve got the business acumen to be an entrepreneur and presence to be a coach but would love to bring that altogether with my passion for health and alternative medicine. With an undergraduate degree in science, plus my western herbalism education which includes anatomy, physiology, lots of biology and nutrition I believe in the scientific method and worked in the supplements department and herb stores too. I have deep passion and expertise in empowering people with the knowledge to take responsibility for their health and well being with the best guidance that both western and alternative medicine has to offer.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/ENZI-JONES.jpeg"
  },
  {
    "firstName": "Lisa",
    "lastName": "Mckenzie",
    "content": "Everything about functional medicine, I have believed, I just didn't know how to learn or share this information.  I want to be able to assist people on their healthcare journey, empowering them to take care of their own health.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/20230701_172146.jpg"
  },
  {
    "firstName": "Tracy",
    "lastName": "Thompson",
    "content": "I'm a medical aesthetician and the spa director. My patients are typically mid 30's and up. I hear so many complaints from my patients. Women's issues that plague us all and that traditional medicine isn't helping us with. I want to offer my patients solutions. We are all so frustrated and tired of being tired (sore, cranky, hungry, not sleeping, moody, overwhelmed, no motivation...stuck! I want my patients to have beautiful skin and to feel energized and beautiful on the inside as well.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_4052.jpeg"
  },
  {
    "firstName": "Gabriela",
    "lastName": "Koeva",
    "content": "I was diagnosed with Hashimoto’s in my early 20s. Being a professional volleyball player for 15 years I didn't feel the effects of it so much, but I as constantly overtrained and eventually started feeling all the symptoms by the book.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/IMG_4345.jpeg"
  },
  {
    "firstName": "Ashley",
    "lastName": "Pease",
    "content": "I’m a WHNP ready to start something more meaningful",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000011025.jpg"
  },
  {
    "firstName": "Sibyl H.F.",
    "lastName": "Chan",
    "content": "I'm a nurse over 20 years, exhausted shift working pattern, recently finished 3year acupuncturist course and working as part time, my clients do treat me, but deep down I think I still in a routine working mode for them, I wanna to know more to solve their concerns.",
    "avatar": "https://accredipro.academy/wp-content/uploads/2025/11/1000008466.jpg"
  }
]