{
  "acronym": "RESTORE",
  "full_name": "The RESTORE Method™",
  "letters": [
    {
      "letter": "R",
      "meaning": "Rhythm Alignment",
      "description": "Focuses on synchronizing the body's internal master clock—the suprachiasmatic nucleus—with external light-dark cycles. This stage involves managing photic input, temperature fluctuations, and meal timing to optimize the natural secretion of melatonin and cortisol."
    },
    {
      "letter": "E",
      "meaning": "Environment Optimization",
      "description": "Involves transforming the physical sleep space into a 'recovery sanctuary' by meticulously controlling sensory variables. Coaches audit the bedroom for light pollution, acoustic disruptions, thermal regulation, and air quality to remove physiological barriers to deep sleep."
    },
    {
      "letter": "S",
      "meaning": "Stress & Nervous System Mitigation",
      "description": "Addresses the 'tired but wired' phenomenon by implementing protocols that shift the client from a sympathetic (fight-or-flight) state to a parasympathetic (rest-and-digest) state. This includes somatic practices, breathwork, and cognitive offloading to prevent nocturnal cortisol spikes."
    },
    {
      "letter": "T",
      "meaning": "Timing & Consistency",
      "description": "Emphasizes the stabilization of the homeostatic sleep drive through strict adherence to 'anchor' wake times and optimal sleep windows. Coaching focuses on aligning the client's schedule with their specific chronotype to maximize sleep efficiency and architecture."
    },
    {
      "letter": "O",
      "meaning": "Organic & Metabolic Support",
      "description": "Explores the biochemical relationship between nutrition, blood sugar stability, and sleep maintenance. Coaches analyze the impact of caffeine metabolism, alcohol consumption, and micronutrient status—specifically magnesium and vitamin D—on sleep quality."
    },
    {
      "letter": "R",
      "meaning": "Recovery Tracking & Metrics",
      "description": "Utilizes objective data from wearable technology alongside subjective sleep diaries to monitor progress and identify hidden disruptors. By analyzing Heart Rate Variability (HRV) and Resting Heart Rate (RHR), coaches can make evidence-based adjustments to the client's protocol."
    },
    {
      "letter": "E",
      "meaning": "Education & Cognitive Reframing",
      "description": "Empowers the client through a deep understanding of sleep science while dismantling 'sleep effort' and performance anxiety. This final step replaces maladaptive sleep beliefs with sustainable psychological frameworks that promote long-term sleep health."
    }
  ]
}