{
  "acronym": "F.U.E.L.E.D.",
  "full_name": "The F.U.E.L.E.D. Performance Framework™",
  "letters": [
    {
      "letter": "F",
      "meaning": "Foundational Physiology",
      "description": "The framework begins by assessing the athlete's unique metabolic profile, basal energy requirements, and the specific bioenergetic demands of their sport. This stage establishes a scientific baseline, ensuring that all subsequent nutritional interventions are built upon the client's actual physiological needs rather than generic templates."
    },
    {
      "letter": "U",
      "meaning": "Utilization of Macronutrients",
      "description": "This principle focuses on the strategic manipulation of protein, carbohydrates, and lipids to optimize muscle protein synthesis and glycogen resynthesis. Coaches learn to match macronutrient ratios to the intensity and volume of training phases to maximize metabolic efficiency and body composition."
    },
    {
      "letter": "E",
      "meaning": "Ergogenic & Micronutrient Optimization",
      "description": "Beyond calories, this step addresses the critical role of vitamins, minerals, and evidence-based supplements in enhancing performance margins. It involves identifying nutritional gaps and implementing safe, legal ergogenic aids that are supported by high-level clinical research."
    },
    {
      "letter": "L",
      "meaning": "Loading & Timing Strategies",
      "description": "Nutrient timing is essential for peak performance, focusing on the peri-workout window to fuel effort and kickstart recovery. This step teaches coaches how to implement carbohydrate loading, protein distribution, and intra-workout fueling to sustain high-intensity output."
    },
    {
      "letter": "E",
      "meaning": "Electrolyte & Hydration Management",
      "description": "This component involves developing individualized hydration protocols based on sweat rate, environmental factors, and sodium loss. Proper fluid and electrolyte balance is critical for maintaining blood volume, thermoregulation, and cognitive function during prolonged athletic exertion."
    },
    {
      "letter": "D",
      "meaning": "Data-Driven Recovery & Adjustment",
      "description": "The final stage involves using objective metrics and subjective feedback to monitor progress and refine the nutritional plan. By analyzing performance markers and recovery data, the coach can make precise adjustments to prevent overtraining and ensure long-term athletic adaptation."
    }
  ]
}