{
  "course_name": "Certified Postpartum Recovery Coach™",
  "total_lessons": 292,
  "modules": [
    {
      "number": 0,
      "title": "Introduction & Career Vision",
      "tier": "L1",
      "has_quiz": false,
      "lessons": [
        {
          "number": 1,
          "title": "The Evolution of Postpartum Support",
          "outline": [
            "Analyzing the 'Fourth Trimester' gap: Why current medical models fail to support long-term maternal recovery.",
            "Defining the Postpartum Recovery Coach: Distinguishing the role from birth doulas, mental health therapists, and medical providers.",
            "The cultural history of the '40-day' recovery period and its modern application in coaching.",
            "Scope of practice and ethical boundaries: Identifying the 'Red Flags' that require immediate clinical referral.",
            "The economic and social impact of unsupported postpartum recovery on families and the workforce."
          ]
        },
        {
          "number": 2,
          "title": "Core Framework: The R.E.S.T.O.R.E. Method™",
          "outline": [
            "The philosophy of 'Restoration' vs. 'Bouncing Back': Shifting the narrative from aesthetics to functional health.",
            "High-level overview of the 7 pillars: From Recovery Evaluation (R) to Empowered Matrescence (E).",
            "The science of integration: How physical healing, emotional processing, and somatic work intersect.",
            "Evidence-based foundations: The clinical research supporting the RESTORE pillars for maternal wellness.",
            "Introduction to the Coach-Client Alliance: Building trust and safety within the RESTORE framework."
          ]
        },
        {
          "number": 3,
          "title": "The Science of Matrescence & Identity",
          "outline": [
            "Defining Matrescence: Understanding the developmental transition into motherhood as a distinct life stage.",
            "Neuroplasticity and the 'Maternal Brain': How structural brain changes influence postpartum behavior and emotions.",
            "The 'Split Identity' phenomenon: Navigating the psychological shift from independent individual to primary caregiver.",
            "Hormonal cascades: Exploring the biological drivers of the emotional and physical transformation during the first year.",
            "Validation as a coaching intervention: Using matrescence theory to normalize and de-stigmatize the client experience."
          ]
        },
        {
          "number": 4,
          "title": "Career Vision & Professional Path",
          "outline": [
            "Identifying your 'Why': Aligning your personal mission with the professional demands of postpartum coaching.",
            "Market opportunities: Exploring private practice, clinical partnerships, and corporate wellness initiatives.",
            "The ROI of certification: Building professional credibility and establishing premium-tier service offerings.",
            "Defining your niche: Specializing within the postpartum landscape (e.g., twins, high-achieving professionals, or athletic recovery).",
            "The roadmap to certification: Setting milestones for mastering the RESTORE Method™ and launching your practice."
          ]
        }
      ]
    },
    {
      "number": 1,
      "title": "R: Recovery Evaluation",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Foundations of the R.E.S.T.O.R.E. Method™",
          "outline": [
            "Introduction to the R.E.S.T.O.R.E. Method™ framework and the 'R' (Recovery Evaluation) pillar.",
            "Defining the scope of practice: Coaching vs. clinical medical care in the postpartum period.",
            "The physiology of the Fourth Trimester: Why a comprehensive evaluation is critical for long-term health.",
            "Establishing the therapeutic alliance and psychological safety during the initial assessment.",
            "Overview of the evaluation timeline: Immediate (0-2 weeks), Intermediate (2-6 weeks), and Extended (6 weeks+)."
          ]
        },
        {
          "number": 2,
          "title": "Physical Healing: Monitoring Physiological Repair",
          "outline": [
            "Assessing the stages of Lochia (postpartum bleeding) and identifying abnormal patterns.",
            "Wound healing evaluation: Monitoring C-section incisions and perineal repair sites for complications.",
            "Identifying medical 'Red Flags' (preeclampsia, hemorrhage, infection) and emergency referral protocols.",
            "The impact of birth interventions (epidurals, inductions, forceps) on the physical recovery trajectory.",
            "Tracking autonomic nervous system markers: Heart Rate Variability (HRV) and resting heart rate as recovery indicators."
          ]
        },
        {
          "number": 3,
          "title": "Mental Health Screening and PMADs Identification",
          "outline": [
            "Implementing validated screening tools: The Edinburgh Postnatal Depression Scale (EPDS) and GAD-7.",
            "Differentiating between 'Baby Blues' and clinical Perinatal Mood and Anxiety Disorders (PMADs).",
            "Identifying symptoms of Postpartum Anxiety, OCD, and Birth-Related PTSD.",
            "Evaluating maternal-infant bonding markers and identifying barriers to attachment.",
            "Crisis intervention: Screening for suicidal ideation and postpartum psychosis."
          ]
        },
        {
          "number": 4,
          "title": "Hormonal Architecture: The Great Postpartum Shift",
          "outline": [
            "The 'Hormonal Crash': Understanding the precipitous drop in Estrogen and Progesterone post-delivery.",
            "Postpartum Thyroiditis: Recognizing symptoms and understanding the screening process.",
            "The HPA Axis and Cortisol: Evaluating the impact of birth trauma and stress on the endocrine system.",
            "Lactational Amenorrhea and the hormonal profile of the breastfeeding mother.",
            "Evaluating Oxytocin levels and their role in physical involution and emotional regulation."
          ]
        },
        {
          "number": 5,
          "title": "Sleep and Fatigue Evaluation Metrics",
          "outline": [
            "Quantifying sleep quality vs. quantity: The Postpartum Sleep Diary technique.",
            "The Sleep-Mood-Pain Connection: How sleep deprivation exacerbates physical and mental health symptoms.",
            "Distinguishing between 'Normal' newborn-related tiredness and 'Postpartum Depletion' syndrome.",
            "Evaluating the sleep environment and identifying behavioral barriers to restorative rest.",
            "Assessing the impact of 'Night Vigilance' on the maternal nervous system."
          ]
        },
        {
          "number": 6,
          "title": "Nutrient Depletion and Biomarker Assessment",
          "outline": [
            "The 'Pregnancy Drain': Common micronutrient deficiencies following 40 weeks of gestation.",
            "Iron and Ferritin: Evaluating the impact of blood loss on energy, mood, and cognitive function.",
            "The role of Vitamin D, B12, and Magnesium in postpartum recovery and neurotransmitter synthesis.",
            "Physical indicators of depletion: Assessing hair health, skin integrity, and nail strength.",
            "Collaborating with healthcare providers for targeted postpartum blood work panels."
          ]
        },
        {
          "number": 7,
          "title": "Pelvic Floor and Core Integrity Screening",
          "outline": [
            "Basics of Pelvic Floor Dysfunction (PFD): Screening for incontinence, prolapse symptoms, and pelvic pain.",
            "Diastasis Recti Abdominis (DRA): Performing a basic abdominal wall gap and tension assessment.",
            "The Breath-Core Synergy: Evaluating diaphragmatic breathing patterns post-pregnancy.",
            "Postural assessment: Identifying 'Mom Posture' and its impact on musculoskeletal recovery.",
            "Referral criteria for Pelvic Floor Physical Therapy (PFPT) and specialized rehabilitation."
          ]
        },
        {
          "number": 8,
          "title": "Synthesizing the Data: The Recovery Roadmap",
          "outline": [
            "Integrating physical, mental, and hormonal data into a cohesive client profile.",
            "Prioritizing interventions: Determining which area of recovery requires immediate attention.",
            "Communicating evaluation findings to the client with empathy and clinical clarity.",
            "Setting SMART recovery goals for the first 90 days of the coaching engagement.",
            "Building the multidisciplinary referral network: Connecting clients with the right specialists based on evaluation."
          ]
        }
      ]
    },
    {
      "number": 2,
      "title": "E: Emotional Processing",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Postpartum Emotional Landscape",
          "outline": [
            "Defining the 'Baby Blues' vs. clinical PMADs (Perinatal Mood and Anxiety Disorders)",
            "The endocrine-emotional connection: Navigating the 48-hour progesterone drop",
            "Statistical prevalence of emotional distress in the first year postpartum",
            "Normalizing the 'identity fracture' and the psychological shift of matrescence",
            "Establishing the coach’s role as an emotional container and facilitator"
          ]
        },
        {
          "number": 2,
          "title": "Birth Story Integration: Narrative Coaching",
          "outline": [
            "The clinical importance of the birth narrative in psychological recovery",
            "Trauma-informed listening: Creating a 'brave space' for the client's story",
            "Identifying 'stuck points' and cognitive distortions in the birth recount",
            "Techniques for reframing birth trauma into a narrative of survival and strength",
            "Distinguishing between birth disappointment and clinical Birth PTSD"
          ]
        },
        {
          "number": 3,
          "title": "The Neurobiology of Maternal Attachment",
          "outline": [
            "The role of Oxytocin and Dopamine in the bonding and reward circuitry",
            "Understanding amygdala hyper-responsiveness and the 'maternal brain' pruning",
            "How sleep deprivation impacts emotional regulation and prefrontal cortex function",
            "Coaching strategies to support bonding when the 'initial spark' is delayed",
            "The impact of the nervous system state on the mother-infant dyad"
          ]
        },
        {
          "number": 4,
          "title": "Grief, Loss, and the 'Ideal Birth' Myth",
          "outline": [
            "Navigating disenfranchised grief: Mourning the birth experience that didn't happen",
            "The 'Good Mother' archetype and its impact on maternal guilt and shame",
            "Processing the loss of autonomy and the 'former self' during early recovery",
            "Tools for reconciling expectations with the reality of the postpartum period",
            "Addressing the 'perfectionist' trap in modern intensive mothering"
          ]
        },
        {
          "number": 5,
          "title": "Anxiety and the Architecture of Intrusive Thoughts",
          "outline": [
            "Normalizing 'Scary Thoughts': Understanding the 91% prevalence rate",
            "Differentiating between protective hyper-vigilance and clinical Postpartum OCD",
            "The 'Harm vs. Intent' framework: Reducing shame around intrusive imagery",
            "Grounding techniques for acute anxiety and panic during the postpartum period",
            "Coaching the 'Overwhelmed Brain': Simplification strategies for mental load"
          ]
        },
        {
          "number": 6,
          "title": "Anger, Rage, and Emotional Volatility",
          "outline": [
            "The 'Postpartum Rage' phenomenon: Identifying triggers and underlying causes",
            "Rage as a secondary emotion: Uncovering unmet needs, exhaustion, and injustice",
            "De-escalation tools for the 'heat of the moment' maternal anger",
            "The intersection of sensory overload and emotional outbursts in new parents",
            "Developing a 'Resentment Audit' for the household and partnership"
          ]
        },
        {
          "number": 7,
          "title": "The Coach’s Scope: Screening and Referral",
          "outline": [
            "Mastering the Edinburgh Postnatal Depression Scale (EPDS) in a coaching context",
            "Red flags and 'Stop-Gap' indicators: When coaching must pause for therapy",
            "Establishing a professional referral network (psychiatry, therapy, support groups)",
            "Crisis intervention basics: Navigating thoughts of self-harm or psychosis",
            "Legal and ethical boundaries for the Postpartum Recovery Coach"
          ]
        },
        {
          "number": 8,
          "title": "Cultivating Resilience and Self-Compassion",
          "outline": [
            "Applying the Three Pillars of Self-Compassion (Neff) to the postpartum experience",
            "Mindfulness-based stress reduction (MBSR) adapted for the 'micro-moments' of motherhood",
            "The 'Good Enough Mother' concept: Moving from performance to presence",
            "Building a sustainable emotional self-care plan for long-term thriving",
            "Integration: Linking Emotional Processing (E) to Somatic Healing (S)"
          ]
        }
      ]
    },
    {
      "number": 3,
      "title": "S: Somatic Healing",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Foundations of Somatic Recovery",
          "outline": [
            "Defining Somatic Healing within the R.E.S.T.O.R.E. Method™ framework.",
            "The mind-body feedback loop: How physical states influence maternal mental health.",
            "Distinguishing somatic coaching from clinical psychotherapy and physical therapy.",
            "The physiological impact of 'holding' stress in the postpartum musculoskeletal system.",
            "Introduction to the 'felt sense' and its importance in early motherhood."
          ]
        },
        {
          "number": 2,
          "title": "Nervous System Regulation & Polyvagal Theory",
          "outline": [
            "Overview of the Autonomic Nervous System (ANS) changes during the fourth trimester.",
            "Understanding the 'Window of Tolerance' for sleep-deprived new mothers.",
            "Recognizing signs of sympathetic (fight/flight) vs. dorsal vagal (shutdown) states in clients.",
            "The role of co-regulation: How a coach's presence stabilizes the client's nervous system.",
            "Transitioning from survival mode to the 'social engagement' system."
          ]
        },
        {
          "number": 3,
          "title": "Interoception: Reconnecting with the Postpartum Body",
          "outline": [
            "The science of interoception and why it often declines after a medicalized birth.",
            "Body scanning techniques specifically adapted for postpartum physical changes and trauma.",
            "Developing internal cues for hunger, thirst, and fatigue amidst infant care demands.",
            "Overcoming body dissociation and 'numbness' through somatic awareness.",
            "The link between high interoceptive awareness and reduced postpartum depression risk."
          ]
        },
        {
          "number": 4,
          "title": "Somatic Breathwork & Core Integration",
          "outline": [
            "The functional relationship between the diaphragm, pelvic floor, and Vagus nerve.",
            "Piston breathing: A somatic approach to functional core repair and nervous system calming.",
            "Specific breath patterns to down-regulate during high-stress parenting moments.",
            "The impact of 'maternal chest breathing' on cortisol production and milk let-down.",
            "Correcting dysfunctional breathing patterns established during the third trimester."
          ]
        },
        {
          "number": 5,
          "title": "The Vagus Nerve: The Postpartum Reset Button",
          "outline": [
            "Anatomy and function of the Vagus nerve in maternal inflammatory response and mood.",
            "Somatic 'hacks' for Vagus nerve stimulation: Toning, gargling, and specific eye movements.",
            "Using cold-water face immersion as a tool for acute postpartum anxiety spikes.",
            "The connection between Vagal tone and the 'rest and digest' recovery phase.",
            "Clinical evidence for Vagus nerve stimulation in improving maternal resilience."
          ]
        },
        {
          "number": 6,
          "title": "Somatic Release for Birth Trauma & Stress",
          "outline": [
            "The 'Body Keeps the Score' in postpartum: How birth trauma is stored in tissue.",
            "Gentle shaking and therapeutic tremoring techniques for discharging 'stuck' survival energy.",
            "Emotional Freedom Technique (EFT/Tapping) basics for the postpartum coach.",
            "Identifying somatic 'discharge' signs: Yawning, temperature shifts, and spontaneous sighs.",
            "Creating a safe 'somatic sanctuary' for clients to process the physical memory of birth."
          ]
        },
        {
          "number": 7,
          "title": "Postural Somatics & Corrective Alignment",
          "outline": [
            "The 'Motherhood Hunch': Somatic impacts of nursing, rocking, and carrying.",
            "Somatic cues for neutral spine and pelvic alignment that don't feel like 'exercise'.",
            "The psychological connection between expansive posture and maternal confidence.",
            "Correcting 'rib flare' and its impact on the somatic experience of anxiety.",
            "Simple somatic movements to counteract repetitive stress patterns of infant care."
          ]
        },
        {
          "number": 8,
          "title": "Building the Somatic Toolkit for Clients",
          "outline": [
            "Designing 'Micro-Somatic' practices that take less than 60 seconds.",
            "Integrating somatic check-ins into existing daily rhythms (e.g., diaper changes, feeding).",
            "Identifying client-specific 'glimmers' (sensory cues that signal safety to the brain).",
            "The coach’s role in sustaining somatic habits through the first year postpartum.",
            "Measuring progress: Tracking somatic markers of recovery over time."
          ]
        }
      ]
    },
    {
      "number": 4,
      "title": "T: Transition Navigation",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Defining Matrescence: The Developmental Shift into Motherhood",
          "outline": [
            "Understanding the biological and psychological framework of matrescence as a developmental stage.",
            "Comparing the parallels between adolescence and matrescence: hormonal, physical, and social upheaval.",
            "The timeline of transition: Why the identity shift lasts far beyond the standard 6-week postpartum checkup.",
            "Normalizing 'Identity Ambivalence' as a standard part of the maternal transition.",
            "The role of the Postpartum Recovery Coach in facilitating the 'navigation' versus 'fixing' the transition."
          ]
        },
        {
          "number": 2,
          "title": "The Identity Split: Mourning the 'Old Self' and Welcoming the New",
          "outline": [
            "The concept of 'Identity Grief': Validating the loss of pre-baby autonomy and lifestyle.",
            "Identifying the 'Mother-Woman' tension: Strategies for balancing personal needs with maternal responsibilities.",
            "Techniques for integrating pre-pregnancy strengths and passions into the new maternal identity.",
            "Recognizing and addressing the 'invisible' identity shift in high-achieving women.",
            "Coaching exercises for reclaiming a sense of self-agency during early motherhood."
          ]
        },
        {
          "number": 3,
          "title": "Professional Pivot: Coaching through Career and Ambition Shifts",
          "outline": [
            "The psychological impact of transitioning from professional expert to maternal novice.",
            "Navigating 'Mom Guilt' related to career ambitions and the return-to-work process.",
            "Communication strategies for setting boundaries with employers and colleagues during the transition.",
            "Re-evaluating professional values: How motherhood often triggers a shift in career priorities.",
            "Practical coaching tools for managing the 'Mental Load' of work-life integration."
          ]
        },
        {
          "number": 4,
          "title": "Social Evolution: Navigating Changes in Friendships and Community",
          "outline": [
            "The 'Friendship Filter': Understanding why social circles often shift after childbirth.",
            "Managing feelings of isolation and the 'social othering' of new mothers in child-free spaces.",
            "Communication scripts for maintaining vital connections while honoring new capacity limits.",
            "The importance of the 'Village' concept: Helping clients identify and recruit their support ecosystem.",
            "Coaching clients through the transition from 'individual' social life to 'family-centric' social life."
          ]
        },
        {
          "number": 5,
          "title": "Routine Redesign: Establishing a 'New Normal' in Daily Life",
          "outline": [
            "The collapse of pre-baby structures: Why the loss of routine is a primary stressor in transition.",
            "Practical tools for time-blocking and prioritizing 'micro-wins' in a 24/7 caregiving cycle.",
            "Transitioning from 'me-time' to 'integrated self-care' within the new family rhythm.",
            "Establishing new family rituals that support the mother’s mental health and recovery.",
            "The 'Minimum Viable Day' strategy: Coaching clients to find peace in low-capacity seasons."
          ]
        },
        {
          "number": 6,
          "title": "Deconstructing the 'Perfect Mother' Myth: Managing Expectations",
          "outline": [
            "Identifying the 'Good Mother' archetype and its detrimental impact on postpartum mental health.",
            "How digital culture and social media distort the reality of the transition navigation process.",
            "Reframing 'failure' as a natural part of the maternal learning curve.",
            "Helping clients set realistic, values-based goals for their recovery journey instead of comparative ones.",
            "The 'Good Enough Mother' concept: Utilizing Winnicott’s theory in a coaching context."
          ]
        },
        {
          "number": 7,
          "title": "Relational Re-calibration: The Transition from Couple to Parents",
          "outline": [
            "The statistical drop in relationship satisfaction during the first year and how to proactively navigate it.",
            "Communication shifts: Moving from 'romantic partners' to 'effective co-parents.'",
            "Addressing the 'Invisible Load' and renegotiating household roles and expectations.",
            "Coaching techniques for fostering intimacy and connection during the transition to parenthood.",
            "Identifying when relationship challenges require specialized therapy versus coaching navigation."
          ]
        },
        {
          "number": 8,
          "title": "Integrating the New Self: Establishing Maternal Confidence",
          "outline": [
            "The final stage of Transition Navigation: Acceptance, integration, and maternal self-efficacy.",
            "Building confidence through reflection: Helping clients recognize their growth and resilience.",
            "Creating a 'Long-Term Transition Map' for the first year of matrescence.",
            "The coach’s role in facilitating the 'Empowered Matrescence' phase of the RESTORE Method™.",
            "Finalizing the transition plan: Sustainable strategies for long-term maternal thriving."
          ]
        }
      ]
    },
    {
      "number": 5,
      "title": "O: Optimized Nutrition",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Biology of Postpartum Depletion",
          "outline": [
            "Understanding the 'Nutrient Debt' incurred during the third trimester and delivery.",
            "The metabolic cost of lactation and the physiological demands of tissue remodeling.",
            "Identifying clinical signs of depletion versus normal newborn-related exhaustion.",
            "The role of Optimized Nutrition (O) within the R.E.S.T.O.R.E. Method™ framework.",
            "Stat-based overview of common postpartum deficiencies (Iron, Vitamin D, and DHA)."
          ]
        },
        {
          "number": 2,
          "title": "Protein and Healthy Fats for Structural Healing",
          "outline": [
            "Amino acid requirements for collagen synthesis, perineal repair, and C-section recovery.",
            "The role of Omega-3 fatty acids (DHA/EPA) in maternal brain health and neuro-inflammation.",
            "Cholesterol's essential role in rebuilding steroid hormones like estrogen and progesterone.",
            "Sourcing bioavailable proteins for various dietary preferences (omnivore, vegetarian, vegan).",
            "The 'Fat-First' rule for supporting the myelin sheath and cognitive function post-birth."
          ]
        },
        {
          "number": 3,
          "title": "Micronutrient Powerhouse: Iron, Zinc, and B-Vitamins",
          "outline": [
            "Managing postpartum anemia and its direct correlation to Postpartum Depression (PPD).",
            "Zinc’s critical role in immune system modulation and epithelial wound healing.",
            "B-vitamin complexes for adrenal support and efficient neurotransmitter methylation.",
            "Bioavailability strategies: Food pairing to maximize mineral absorption (e.g., Vitamin C and non-heme iron).",
            "Laboratory testing: Which markers to request for a comprehensive nutritional assessment."
          ]
        },
        {
          "number": 4,
          "title": "Blood Sugar Management and Cortisol Regulation",
          "outline": [
            "The 'Postpartum Crash': How erratic glucose levels exacerbate hormonal volatility.",
            "Nutritional strategies for maintaining stable energy during periods of extreme sleep deprivation.",
            "The relationship between insulin sensitivity, cortisol spikes, and postpartum thyroiditis.",
            "Coaching the 'PFF' (Protein, Fat, Fiber) plate method for hormonal stabilization.",
            "Managing sugar cravings and the physiological 'why' behind postpartum snacking habits."
          ]
        },
        {
          "number": 5,
          "title": "Supporting the Postpartum Gut-Brain Axis",
          "outline": [
            "The impact of birth interventions and antibiotics on the maternal microbiome.",
            "Connecting gut dysbiosis to maternal mental health through the vagus nerve.",
            "Therapeutic use of prebiotic and probiotic foods to restore intestinal integrity.",
            "Addressing common postpartum digestive issues: Constipation, bloating, and sluggish motility.",
            "The role of fermented foods in supporting the infant's developing microbiome via breast milk."
          ]
        },
        {
          "number": 6,
          "title": "Hydration, Electrolytes, and Lactation Support",
          "outline": [
            "Fluid dynamics: Balancing breast milk production with maternal intracellular hydration.",
            "The necessity of trace minerals (Sodium, Potassium, Magnesium) for postpartum nerve conduction.",
            "Hydration strategies that support oxytocin release and the let-down reflex.",
            "Identifying 'hidden dehydrators' and the danger of over-consumption of plain water without minerals.",
            "Galactagogues: Separating evidence-based lactogenic foods from cultural myths."
          ]
        },
        {
          "number": 7,
          "title": "Therapeutic Foods: Warming Traditions and Modern Science",
          "outline": [
            "The 'Cold vs. Warm' paradigm in traditional postpartum cultures (Ayurveda and TCM).",
            "The science of thermogenesis and why 'convalescent' foods are easier on the postpartum gut.",
            "The benefits of bone broths, collagen-rich stews, and slow-cooked meals for nutrient density.",
            "Anti-inflammatory spices: Utilizing turmeric, ginger, and fenugreek for systemic recovery.",
            "Bridging ancient wisdom with modern nutritional biochemistry for client buy-in."
          ]
        },
        {
          "number": 8,
          "title": "Nutrition Coaching: Implementation and Sustainability",
          "outline": [
            "Overcoming 'Decision Fatigue': Simplified meal planning for the fourth trimester.",
            "Setting up a 'Recovery Kitchen' and delegating food prep to the relational support network.",
            "Navigating maternal food sensitivities and their impact on colicky or sensitive infants.",
            "Creating a 30-day 'O' optimization plan that avoids the 'diet culture' trap.",
            "Coaching techniques for clients with limited time, budget, or cooking skills."
          ]
        }
      ]
    },
    {
      "number": 6,
      "title": "R: Relational Support",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Postpartum Ecosystem: Mapping the Support Village",
          "outline": [
            "Introduction to the Relational Support pillar within the R.E.S.T.O.R.E. Method™ framework.",
            "The Support Audit: Tools for assessing a client's current social capital and identifying support gaps.",
            "Categorizing support types: Distinguishing between emotional, instrumental, informational, and appraisal support.",
            "The psychological impact of social isolation vs. community integration on maternal mental health.",
            "Defining the 'Village' in a modern context: Moving from traditional to intentional community building."
          ]
        },
        {
          "number": 2,
          "title": "Partner Dynamics: Navigating the Shift in Intimacy and Labor",
          "outline": [
            "The 'Fair Play' framework: Strategies for equitable division of household labor and childcare.",
            "Maintaining the partner bond: Techniques for emotional connection during acute sleep deprivation.",
            "Identifying common conflict triggers in the first 90 days postpartum and proactive resolution strategies.",
            "The 'Postpartum State of the Union': Implementing structured weekly check-ins for couples.",
            "Supporting the non-birthing partner’s transition and role in the recovery process."
          ]
        },
        {
          "number": 3,
          "title": "Establishing Boundaries: Managing Visitors and Extended Family",
          "outline": [
            "Defining 'Helpers' vs. 'Visitors': Creating criteria for who enters the postpartum space.",
            "Drafting the Postpartum Visitor Policy: Scripting expectations for grandparents, friends, and relatives.",
            "Assertiveness training for the new parent: How to say 'no' without guilt to protect recovery time.",
            "Navigating generational differences and unsolicited advice regarding infant care and maternal recovery.",
            "Managing cultural expectations while prioritizing the immediate family unit's needs."
          ]
        },
        {
          "number": 4,
          "title": "Community Integration: Building Local and Digital Support Nets",
          "outline": [
            "The decline of the traditional village and strategies for engineering modern alternatives.",
            "Vetting online communities: Identifying evidence-based, supportive digital spaces vs. toxic environments.",
            "Logistical community support: Maximizing the impact of meal trains, laundry rotations, and carpools.",
            "The 'Ask List' technique: Coaching clients to articulate specific, actionable requests for help.",
            "Connecting with local peer-support groups and 'Mommy and Me' resources for social regulation."
          ]
        },
        {
          "number": 5,
          "title": "Professional Networking: Coordinating the Recovery Team",
          "outline": [
            "Identifying the 'Recovery Team': When to refer to Pelvic Floor PTs, IBCLCs, and PMH-Cs.",
            "The coach’s role as a Relational Liaison: Coordinating communication between various care providers.",
            "Advocacy skills: Coaching the client to communicate effectively with medical providers during follow-ups.",
            "Building a local referral directory: How coaches can establish a network of trusted postpartum professionals.",
            "Recognizing the limits of coaching: Clear red flags that require immediate professional intervention."
          ]
        },
        {
          "number": 6,
          "title": "Communication Mastery for the Fourth Trimester",
          "outline": [
            "Non-Violent Communication (NVC) basics tailored for sleep-deprived and stressed parents.",
            "Overcoming the 'Superwoman' complex: Deconstructing the barriers to receiving help.",
            "Expressing needs vs. venting: Using 'I' statements to foster cooperation rather than defensiveness.",
            "Crisis communication: De-escalation techniques for high-stress parenting moments.",
            "Role-playing difficult relational scenarios common in the first six months postpartum."
          ]
        },
        {
          "number": 7,
          "title": "Family Systems: Sibling Integration and Household Flow",
          "outline": [
            "Preparing older siblings for the 'New Normal' and managing 'sibling regression' behaviors.",
            "Relational shifts for the non-birthing parent: Strategies for focusing on older children while the mother recovers.",
            "Preserving family rituals: Adapting pre-baby traditions to fit the current recovery capacity.",
            "Managing the 'Default Parent' trap: Strategies for shifting household mental load.",
            "The impact of a new baby on the extended family system and hierarchy."
          ]
        },
        {
          "number": 8,
          "title": "The Sustainable Support Blueprint: Long-Term Relational Health",
          "outline": [
            "Developing the 12-month Relational Roadmap: Transitioning from crisis support to sustainable community.",
            "Evaluating support effectiveness: Using KPIs (Key Performance Indicators) for relational satisfaction.",
            "Planning for the return to work: Relational strategies for managing the 'second shift'.",
            "Finalizing the 'R' (Relational Support) component of the client’s R.E.S.T.O.R.E. Method™ plan.",
            "Course correction: How to pivot the support plan when initial strategies are no longer serving the family."
          ]
        }
      ]
    },
    {
      "number": 7,
      "title": "E: Empowered Matrescence",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Understanding Matrescence: The Developmental Shift",
          "outline": [
            "Defining matrescence as a bio-psycho-social developmental stage comparable to adolescence.",
            "The history of the term: From Dana Raphael to modern clinical frameworks in maternal psychology.",
            "Identifying the 'Split Self': Navigating the tension between the woman’s old identity and her emerging maternal role.",
            "Deconstructing the 'Bounce Back' myth and replacing it with the 'Moving Forward' empowerment model.",
            "The coach’s role in normalizing the emotional turbulence of long-term identity shifts."
          ]
        },
        {
          "number": 2,
          "title": "The Neurobiology of the Empowered Maternal Brain",
          "outline": [
            "Analyzing synaptic pruning and gray matter changes that occur during the transition to motherhood.",
            "The role of oxytocin, prolactin, and glucocorticoids in reshaping maternal cognitive priorities.",
            "Reframing 'Mom Brain': Understanding the enhanced emotional intelligence and multitasking capabilities of the maternal mind.",
            "How neuroplasticity supports long-term resilience and adaptive stress responses in mothers.",
            "Practical coaching tools to help clients harness their new cognitive strengths."
          ]
        },
        {
          "number": 3,
          "title": "Radical Self-Preservation: Beyond Basic Self-Care",
          "outline": [
            "Shifting the perspective from 'indulgent' self-care to 'essential' self-preservation for maternal longevity.",
            "Establishing internal and external boundaries: Learning to say 'no' to protect maternal energy stores.",
            "The 5 Pillars of Sustainable Maternal Wellness: Sleep, movement, nourishment, connection, and solitude.",
            "Overcoming the 'Martyrdom Complex' and the psychology of maternal guilt.",
            "Creating 'Micro-Rituals': Implementing 5-minute restorative practices for high-demand days."
          ]
        },
        {
          "number": 4,
          "title": "Identity Reclamation and Values-Based Living",
          "outline": [
            "The 'Identity Audit': Helping clients identify which pre-baby values remain and which have evolved.",
            "Integrating professional, personal, and maternal identities into a cohesive 'New Self' narrative.",
            "Using creative expression and journaling as tools for processing the 'grief' of the former self.",
            "Setting values-based goals that align with the client’s current capacity and season of life.",
            "Coaching strategies for navigating the 'comparison trap' in the digital parenting age."
          ]
        },
        {
          "number": 5,
          "title": "Cultivating Maternal Agency and Intuition",
          "outline": [
            "Defining Maternal Agency: Empowering the client to be the primary expert on her own body and child.",
            "Techniques for decoupling from 'expert-led' parenting and returning to somatic-led intuition.",
            "Evidence-based decision making: Teaching clients how to filter parenting advice through their own value system.",
            "Building confidence in maternal advocacy within medical, familial, and social settings.",
            "The 'Intuition Check-In': A somatic coaching tool for clarifying maternal instincts."
          ]
        },
        {
          "number": 6,
          "title": "Long-Term Visioning: The Fourth Trimester and Beyond",
          "outline": [
            "Transitioning from short-term recovery goals to long-term thriving and growth archetypes.",
            "Physical health maintenance: Planning for pelvic health, bone density, and hormonal balance in the years post-birth.",
            "Career and purpose re-alignment: Coaching through the return to work or the pivot to new professional paths.",
            "Financial wellness and the 'Motherhood Penalty': Advocacy and planning for long-term security.",
            "Creating a 12-month 'Empowerment Roadmap' for the first year of matrescence."
          ]
        },
        {
          "number": 7,
          "title": "The Everlasting Village: Sustaining Community Support",
          "outline": [
            "Auditing the 'Village': Identifying which support systems are sustainable and which cause 'relational drain.'",
            "The 'Relational Support' maintenance plan: Keeping the partner and community engaged after the initial postpartum period.",
            "Digital vs. Physical Community: Finding high-value, low-stress maternal connections.",
            "Professional Support Networks: Knowing when to refer to therapists, pelvic floor specialists, or nutritionists for long-term care.",
            "Teaching the client to lead their support team effectively through clear communication."
          ]
        },
        {
          "number": 8,
          "title": "Integration: Finalizing the R.E.S.T.O.R.E. Blueprint™",
          "outline": [
            "Synthesizing the seven letters of the R.E.S.T.O.R.E. Method™ into a personalized lifelong practice.",
            "The 'Empowered Matrescence Blueprint': Creating a final document for the client’s ongoing success.",
            "Coaching Exit Strategies: Transitioning the client from active coaching to self-led empowerment.",
            "Measuring Success: Utilizing the final 'Recovery Evaluation' to quantify growth and healing.",
            "The Coach’s Path Forward: Maintaining professional boundaries while celebrating the client’s transformation."
          ]
        }
      ]
    },
    {
      "number": 8,
      "title": "L1 Deep Dive Module 8: Empowered Matrescence & Long-Term Integration",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Neurobiology of Matrescence",
          "outline": [
            "Defining Matrescence: Understanding the developmental transition into motherhood as a biological and psychological parallel to adolescence.",
            "Neuroplasticity in the Maternal Brain: Analyzing gray matter changes and the 'pruning' process that enhances maternal sensitivity and intuition.",
            "The Oxytonergic System: How long-term bonding mechanisms influence the mother's stress response and social cognition.",
            "Addressing 'Mom Brain': Deconstructing the myths of cognitive decline versus the reality of cognitive prioritization and specialization.",
            "Clinical implications for coaching: Validating the mother's cognitive shifts as a functional adaptation rather than a deficit."
          ]
        },
        {
          "number": 2,
          "title": "Identity Integration: Navigating the 'New Normal'",
          "outline": [
            "The Grief of the Former Self: Coaching through the loss of pre-baby identity, career autonomy, and personal spontaneity.",
            "Narrative Therapy Techniques: Helping clients rewrite their birth and early motherhood stories to foster empowerment and agency.",
            "Internal Family Systems (IFS) in Postpartum: Identifying the 'Mother' part versus the 'Ambitious' or 'Creative' parts of the psyche.",
            "Values-Based Motherhood: Aligning daily parenting actions with core personal values to reduce 'mom guilt' and decision fatigue.",
            "Establishing the 'Matrescence Map': A visual tool for clients to track their psychological evolution over the first year."
          ]
        },
        {
          "number": 3,
          "title": "The Sustainable Self-Care Ecosystem",
          "outline": [
            "Moving Beyond Survival: Transitioning from reactive self-care (crisis management) to proactive, sustainable wellness systems.",
            "The 4 Pillars of Maternal Thriving: Identifying specific needs in the physical, emotional, social, and spiritual domains.",
            "Micro-Habit Stacking: Designing 5-minute wellness interventions that fit into a high-demand parenting schedule.",
            "Boundary Architecture: Coaching the mother on setting and maintaining boundaries with extended family, social media, and internal critics.",
            "The 'Self-Care Audit': Assessing current energy leaks and identifying high-ROI restorative activities for the individual client."
          ]
        },
        {
          "number": 4,
          "title": "Long-Term Hormonal & Physical Maintenance",
          "outline": [
            "The Post-Recovery Horizon: Monitoring thyroid health, adrenal function, and bone density beyond the initial 12-week postpartum period.",
            "Cycle Syncing for Mothers: Re-introducing the menstrual cycle and adapting nutrition/exercise to hormonal fluctuations.",
            "Pelvic Floor Longevity: Strategies for maintaining core and pelvic health during the return to high-impact exercise or subsequent pregnancies.",
            "Nutrient Density for the Long Haul: Transitioning from 'depletion repair' to 'vitality maintenance' through targeted supplementation and diet.",
            "Recognizing Delayed Postpartum Complications: Identifying late-onset PPD/PPA or autoimmune triggers that can occur up to 12-18 months post-birth."
          ]
        },
        {
          "number": 5,
          "title": "Career, Ambition, and the Postpartum Self",
          "outline": [
            "Navigating the 'Motherhood Penalty': Coaching strategies for returning to the workforce while managing the mental load.",
            "The Motherhood Premium: Highlighting the enhanced leadership, multitasking, and empathy skills developed through matrescence.",
            "Negotiating Flexibility: Practical communication frameworks for discussing work-life integration with employers.",
            "Managing Executive Function Fatigue: Tools for organizing the household 'mental load' to prevent professional burnout.",
            "Redefining Ambition: Helping mothers align their professional goals with their new capacity and priorities."
          ]
        },
        {
          "number": 6,
          "title": "The 'E' in RESTORE: Designing the Growth Plan",
          "outline": [
            "The Empowered Matrescence Framework: Synthesizing the previous 7 steps of the RESTORE Method™ into a long-term roadmap.",
            "Setting SMART Goals for the Second Year: Shifting focus from recovery to personal growth, hobby reintegration, and social expansion.",
            "Building a 'Village' for the Long Term: Moving from temporary postpartum help to a permanent community support structure.",
            "Legacy and Values: Helping the mother identify the family culture and values she wishes to cultivate as her child grows.",
            "Documenting the Transformation: Creating a 'Matrescence Portfolio' to reflect on the progress made during the coaching engagement."
          ]
        },
        {
          "number": 7,
          "title": "The Graduation Process & Ethical Closure",
          "outline": [
            "Assessing Readiness for Discharge: Using the 'Recovery Evaluation' (R) markers to determine when a client has reached self-sufficiency.",
            "The Final Review Session: Celebrating milestones, acknowledging challenges overcome, and reinforcing the client's new skills.",
            "Maintaining Professional Boundaries: Defining the shift from 'Coach' to 'Alumna' and managing post-engagement contact.",
            "Providing the 'Transition Toolkit': Curating resources for future developmental leaps (toddlerhood, weaning, subsequent pregnancies).",
            "Ethics of Referral: Knowing when to transition a client to a therapist or life coach for non-postpartum-specific goals."
          ]
        },
        {
          "number": 8,
          "title": "Case Study Synthesis: The RESTORE Method™ in Action",
          "outline": [
            "End-to-End Client Analysis: Reviewing a 6-month journey of a client from initial depletion to empowered matrescence.",
            "Troubleshooting Common Roadblocks: Strategies for when a client gets 'stuck' in the Somatic (S) or Relational (R) phases.",
            "Adapting RESTORE for Diverse Families: Modifying the framework for single mothers, adoptive parents, and LGBTQ+ families.",
            "Measuring Impact and ROI: How to track and present the tangible benefits of postpartum recovery coaching to potential clients.",
            "Final Certification Review: Integrating the core pillars of the RESTORE Method™ for the Level 1 examination."
          ]
        }
      ]
    },
    {
      "number": 9,
      "title": "L1 Deep Dive Module 9",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Biopsychosocial Framework of Recovery Evaluation",
          "outline": [
            "Implementing the RESTORE Initial Assessment tool for comprehensive client intake",
            "Identifying physical healing benchmarks vs. clinical red flags in the first 12 weeks",
            "Understanding the 'Postpartum Depletion Cycle' and its physiological markers",
            "Establishing a baseline for mental health, sleep quality, and hormonal balance",
            "Using objective data to track recovery progress over time"
          ]
        },
        {
          "number": 2,
          "title": "Birth Trauma and Emotional Processing Techniques",
          "outline": [
            "The neuroscience of the birth story and its impact on memory integration",
            "Active listening strategies for processing birth disappointment and grief",
            "Differentiating between 'Baby Blues' and clinical PMADs (Postpartum Mood and Anxiety Disorders)",
            "Facilitating the 'Emotional Release' phase of the RESTORE Method",
            "Tools for helping clients rewrite their birth narrative for empowerment"
          ]
        },
        {
          "number": 3,
          "title": "Somatic Healing: Regulating the Postpartum Nervous System",
          "outline": [
            "Polyvagal theory applied to the early postpartum period and infant care",
            "Somatic grounding exercises tailored for sleep deprivation and high-cortisol states",
            "Gentle movement protocols for pelvic floor and core reintegration (DR-safe)",
            "Using specific breathwork techniques for autonomic nervous system regulation",
            "The role of touch and physical comfort in somatic recovery"
          ]
        },
        {
          "number": 4,
          "title": "Identity Reconstruction and Transition Navigation",
          "outline": [
            "Deep dive into Matrescence: The psychological and biological shift into motherhood",
            "Coaching through the loss of professional identity and social role changes",
            "Time-blocking and energy management strategies for the 'New Normal'",
            "Developing a Postpartum Vision Statement to guide client decision-making",
            "Navigating the 'Split Self' and reconciling the pre-baby and post-baby identity"
          ]
        },
        {
          "number": 5,
          "title": "Nutritional Protocols for Hormonal and Physical Repair",
          "outline": [
            "The role of micronutrients (Iron, Zinc, Magnesium) in postpartum tissue healing",
            "Anti-inflammatory dietary patterns to support recovery and reduce oxidative stress",
            "Blood sugar regulation strategies for sustained energy and mood stability",
            "Hydration and caloric requirements for both breastfeeding and non-breastfeeding mothers",
            "Supplementation safety and evidence-based recommendations for recovery"
          ]
        },
        {
          "number": 6,
          "title": "Relational Dynamics and The Support Village",
          "outline": [
            "Navigating the shift in the primary partner relationship and intimacy",
            "Communication scripts for setting healthy boundaries with extended family and visitors",
            "Mapping the 'Support Village': Identifying instrumental vs. emotional support needs",
            "Conflict resolution strategies for the 'Sleep-Deprived Couple'",
            "Establishing a sustainable community framework for long-term support"
          ]
        },
        {
          "number": 7,
          "title": "Empowered Matrescence: Designing Sustainable Growth",
          "outline": [
            "Transitioning the client from 'Survival Mode' to 'Thriving Mode'",
            "Creating a long-term self-care architecture that evolves with the child's age",
            "Values-based decision making for the modern mother to reduce 'Mom Guilt'",
            "Cultivating maternal confidence and intuition through the RESTORE Method",
            "Setting milestones for the first year of motherhood and beyond"
          ]
        },
        {
          "number": 8,
          "title": "Integrated Case Management and Professional Ethics",
          "outline": [
            "Synthesizing the RESTORE Method into a structured 12-week coaching plan",
            "Professional scope of practice: Identifying when to refer to medical or mental health specialists",
            "Conducting the 'Final Progress Review' and the client graduation process",
            "Ethical considerations in postpartum coaching and maintaining client confidentiality",
            "Building a referral network of postpartum professionals (Pelvic PTs, IBCLCs, Therapists)"
          ]
        }
      ]
    },
    {
      "number": 10,
      "title": "L1 Deep Dive Module 10",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Clinical Foundations of the R.E.S.T.O.R.E. Method™",
          "outline": [
            "Theoretical framework: Integrating the seven pillars into a cohesive coaching model",
            "The biopsychosocial approach to postpartum recovery and long-term wellness",
            "Defining the scope of practice: When to coach vs. when to refer to clinical specialists",
            "Initial intake protocols: Utilizing the Recovery Evaluation (R) for baseline data"
          ]
        },
        {
          "number": 2,
          "title": "Advanced Recovery Evaluation: Biomarkers and Physical Assessment",
          "outline": [
            "Identifying physical red flags: Diastasis Recti, pelvic organ prolapse, and surgical scar healing",
            "The endocrine landscape: Assessing thyroid function and adrenal health post-birth",
            "Sleep architecture and its impact on hormonal regulation and tissue repair",
            "Standardized screening tools for Postpartum Mood and Anxiety Disorders (PMADs)"
          ]
        },
        {
          "number": 3,
          "title": "Emotional Processing: Birth Trauma and Identity Integration",
          "outline": [
            "The neurobiology of birth trauma: How the brain stores and processes the birth experience",
            "Narrative coaching techniques for birth story integration and cognitive reframing",
            "Navigating the 'Loss of Self': Coaching through the identity shift of matrescence",
            "Addressing 'Mom Guilt' and societal expectations through the lens of Emotional Processing (E)"
          ]
        },
        {
          "number": 4,
          "title": "Somatic Healing: Regulating the Postpartum Nervous System",
          "outline": [
            "Polyvagal Theory applications: Moving from 'Fight/Flight' to 'Rest and Digest'",
            "Somatic tools for anxiety management: Grounding, centering, and orienting techniques",
            "The role of therapeutic touch and self-massage in postpartum body reclamation",
            "Corrective breathing patterns to restore core-pelvic floor synergy"
          ]
        },
        {
          "number": 5,
          "title": "Transition Navigation: Career, Roles, and Lifestyle Re-entry",
          "outline": [
            "The Return-to-Work roadmap: Managing the emotional and logistical transition",
            "Renegotiating the 'Invisible Load': Communication strategies for domestic equity",
            "Establishing boundaries with extended family and 'The Village'",
            "Time management for the new mother: Balancing self-care with caregiving demands"
          ]
        },
        {
          "number": 6,
          "title": "Optimized Nutrition: Reversing Postpartum Depletion",
          "outline": [
            "The 'Postpartum Depletion' syndrome: Key micronutrients for replenishment (Iron, DHA, Zinc)",
            "Blood sugar regulation strategies to stabilize postpartum mood swings",
            "Nutritional support for lactation: Caloric needs vs. nutrient density",
            "Anti-inflammatory dietary protocols to support physical tissue repair (O)"
          ]
        },
        {
          "number": 7,
          "title": "Relational Support: Strengthening the Family Ecosystem",
          "outline": [
            "Partner-inclusive coaching: Improving intimacy and communication post-baby",
            "Conflict resolution frameworks for sleep-deprived couples",
            "Building a sustainable support network: Identifying community resources and peer groups",
            "The Relational Support (R) pillar: Creating a 'Postpartum Plan' for the whole family"
          ]
        },
        {
          "number": 8,
          "title": "Empowered Matrescence: Sustainable Growth and Graduation",
          "outline": [
            "Finalizing the 'Thrive Plan': Long-term wellness strategies beyond the fourth trimester",
            "Cultivating maternal intuition and self-efficacy through the Empowered Matrescence (E) pillar",
            "Measuring progress: Re-evaluating benchmarks from the initial Recovery Evaluation",
            "The graduation process: Ending the coaching relationship and fostering independence"
          ]
        }
      ]
    },
    {
      "number": 11,
      "title": "L1 Deep Dive Module 11",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Introduction to the R.E.S.T.O.R.E. Method™ Framework",
          "outline": [
            "Philosophy and origins: Why the R.E.S.T.O.R.E. Method™ is the gold standard for postpartum recovery.",
            "Defining the L1 scope of practice: Boundaries between coaching, therapy, and medical care.",
            "The biological vs. cultural 'Fourth Trimester': Bridging the gap in modern maternal care.",
            "Systemic overview: How the seven pillars interact to create a holistic recovery trajectory.",
            "The Coach-Client Alliance: Establishing trust and safety in the early postpartum weeks."
          ]
        },
        {
          "number": 2,
          "title": "Recovery Evaluation: Assessing the Postpartum Landscape",
          "outline": [
            "Physical healing markers: Identifying normal recovery vs. red flags in pelvic health and incision sites.",
            "Mental health screening: Implementing the Edinburgh Postnatal Depression Scale (EPDS) in a coaching context.",
            "Hormonal architecture: Understanding the steep drop in progesterone and estrogen and its physiological impact.",
            "The RESTORE Assessment Tool: Conducting the initial 90-minute intake and evaluation.",
            "Referral pathways: When and how to transition a client to specialized medical or psychological care."
          ]
        },
        {
          "number": 3,
          "title": "Emotional Processing: Integrating the Birth Story",
          "outline": [
            "The psychology of the birth narrative: How the story of labor shapes maternal identity.",
            "Active listening and validation: Techniques for processing birth trauma and 'birth disappointment'.",
            "Distinguishing the 'Baby Blues' from clinical perinatal mood and anxiety disorders (PMADs).",
            "Grief and loss in matrescence: Addressing the loss of the 'former self' and previous lifestyle.",
            "Journaling and narrative therapy tools for emotional integration and cognitive reframing."
          ]
        },
        {
          "number": 4,
          "title": "Somatic Healing: Nervous System Regulation",
          "outline": [
            "Polyvagal Theory in postpartum: Understanding the 'freeze' and 'fight-or-flight' responses in new mothers.",
            "Body-based grounding techniques: Using breathwork and sensory awareness to reduce cortisol.",
            "Gentle movement for physical repair: The role of tissue oxygenation and lymphatic drainage in recovery.",
            "The impact of sleep deprivation on the nervous system: Coaching strategies for 'restorative rest'.",
            "Somatic markers of stress: Teaching clients to recognize physical cues before emotional overwhelm."
          ]
        },
        {
          "number": 5,
          "title": "Transition Navigation: Coaching through Matrescence",
          "outline": [
            "Defining Matrescence: The developmental, neurobiological, and social transition into motherhood.",
            "Identity shifts: Navigating the 'split' between professional identity and maternal identity.",
            "Lifestyle redesign: Practical tools for time management and energy conservation in the first 12 weeks.",
            "Values-based goal setting: Helping clients align their new reality with their core personal values.",
            "Managing expectations: Deconstructing the 'Superwoman' myth and setting realistic recovery milestones."
          ]
        },
        {
          "number": 6,
          "title": "Optimized Nutrition: Replenishing the Postpartum Body",
          "outline": [
            "Postpartum Depletion Syndrome: Identifying the common nutrient gaps (Iron, DHA, Vitamin D, Zinc).",
            "Hormonal support through diet: Using blood sugar regulation to stabilize mood and energy.",
            "Anti-inflammatory nutrition: Foods that promote tissue healing and reduce systemic inflammation.",
            "Hydration and lactation: Nutritional requirements for breastfeeding vs. formula-feeding mothers.",
            "Meal planning for the 'fog': Low-effort, high-nutrient density strategies for exhausted parents."
          ]
        },
        {
          "number": 7,
          "title": "Relational Support: Building the Postpartum Village",
          "outline": [
            "The 'Village' Audit: Identifying existing support systems and gaps in the family's social network.",
            "Communication scripts: Teaching clients how to ask for specific help from partners and family.",
            "Boundary setting: Managing visitors and unsolicited advice to protect the mother-infant bond.",
            "Partner dynamics: Addressing the shift in the romantic relationship and preventing 'parental burnout'.",
            "Outsourcing and delegation: The economics of postpartum support and prioritizing tasks."
          ]
        },
        {
          "number": 8,
          "title": "Empowered Matrescence: Long-term Growth and Sustainability",
          "outline": [
            "From survival to thriving: Transitioning the coaching focus from acute recovery to long-term wellness.",
            "Developing a 'Sustainable Self-Care' plan: Moving beyond the bubble bath to deep restorative practices.",
            "Fostering maternal intuition: Building client confidence in decision-making and parental authority.",
            "The R.E.S.T.O.R.E. Graduation: Finalizing the 12-week plan and establishing maintenance goals.",
            "Advocacy and community: Encouraging the client to use their voice in their healthcare and social circles."
          ]
        }
      ]
    },
    {
      "number": 12,
      "title": "L1 Deep Dive Module 12",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Foundations of the R.E.S.T.O.R.E. Method™",
          "outline": [
            "Philosophical underpinnings of the R.E.S.T.O.R.E. framework in postpartum care.",
            "Defining the Level 1 Coach's scope of practice: Support vs. Clinical Intervention.",
            "Establishing the coaching container: Creating psychological safety for new mothers.",
            "Integrating the seven pillars into a cohesive 12-week recovery roadmap.",
            "The science of neuroplasticity in the postpartum brain and its role in coaching."
          ]
        },
        {
          "number": 2,
          "title": "Recovery Evaluation: Assessing the Postpartum Landscape",
          "outline": [
            "Identifying physical 'Red Flags': When to refer to pelvic floor PTs or medical providers.",
            "Utilizing the Edinburgh Postnatal Depression Scale (EPDS) within a coaching context.",
            "Tracking hormonal markers: Understanding the impact of estrogen/progesterone drops.",
            "Assessing sleep quality and its direct correlation to cognitive recovery.",
            "Evaluating physical healing: Incision care, core stability, and mobility baselines."
          ]
        },
        {
          "number": 3,
          "title": "Emotional Processing: Integrating the Birth Narrative",
          "outline": [
            "The psychology of the birth story: Techniques for narrative integration and meaning-making.",
            "Coaching through 'Birth Disappointment': Validating the gap between expectation and reality.",
            "Managing the 'Emotional Rollercoaster': Distinguishing between Baby Blues and PMADs.",
            "Tools for overcoming maternal guilt and the 'Superwoman' archetype.",
            "Active listening strategies for processing the complex emotions of early motherhood."
          ]
        },
        {
          "number": 4,
          "title": "Somatic Healing: Regulating the Postpartum Nervous System",
          "outline": [
            "Polyvagal Theory applied: Moving from 'Survival Mode' to 'Social Engagement'.",
            "Body-based techniques for down-regulating the sympathetic nervous system.",
            "Gentle somatic movements for pelvic floor awareness and core reintegration.",
            "Sensory soothing strategies for the overstimulated and 'touched-out' mother.",
            "The role of breathwork in promoting physical tissue repair and cortisol reduction."
          ]
        },
        {
          "number": 5,
          "title": "Transition Navigation: Coaching through Matrescence",
          "outline": [
            "Defining Matrescence: Understanding the biological and psychological metamorphosis.",
            "Coaching through the 'Identity Crisis': Bridging the gap between the old self and the new mother.",
            "Managing the 'Mental Load': Systems for household organization and cognitive offloading.",
            "Setting realistic expectations: Navigating societal pressures and social media influence.",
            "Goal setting for the 'New Normal': Adapting personal ambitions to the postpartum reality."
          ]
        },
        {
          "number": 6,
          "title": "Optimized Nutrition: Replenishing the Postpartum Body",
          "outline": [
            "The Postpartum Depletion Cycle: Identifying key nutrient gaps (Iron, DHA, Zinc, B12).",
            "Anti-inflammatory dietary protocols for tissue healing and hormonal stabilization.",
            "Bio-individual nutrition: Caloric needs for breastfeeding vs. non-breastfeeding mothers.",
            "Blood sugar regulation strategies to prevent postpartum mood swings and fatigue.",
            "Practical meal planning and outsourcing strategies for the exhausted parent."
          ]
        },
        {
          "number": 7,
          "title": "Relational Support: Building the Postpartum Village",
          "outline": [
            "Mapping the support network: Identifying 'The Village' in a modern, isolated society.",
            "Communication frameworks for partners: Navigating the shift in the romantic dynamic.",
            "Setting healthy boundaries with extended family and well-meaning visitors.",
            "The 'Postpartum Plan' for the family unit: Assigning roles and managing expectations.",
            "Coaching the 'Support System': How to educate partners on effective maternal support."
          ]
        },
        {
          "number": 8,
          "title": "Empowered Matrescence: Sustainable Self-Care and Growth",
          "outline": [
            "Transitioning from 'Recovery' to 'Thriving': Designing long-term self-care blueprints.",
            "Cultivating maternal intuition: Trusting the self in a world of conflicting advice.",
            "Return-to-work coaching: Navigating the professional identity shift and childcare transitions.",
            "The R.E.S.T.O.R.E. Method™ Graduation: Celebrating milestones and setting future growth targets.",
            "Maintaining the coaching momentum: Strategies for long-term maternal wellness and confidence."
          ]
        }
      ]
    },
    {
      "number": 13,
      "title": "L1 Deep Dive: The Foundation of Postpartum Recovery",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Introduction to the R.E.S.T.O.R.E. Method™ Framework",
          "outline": [
            "Overview of the seven pillars of the R.E.S.T.O.R.E. Method™ in postpartum coaching",
            "Defining the scope of practice: Recovery Coach vs. Postpartum Doula vs. Therapist",
            "The science of the 'Fourth Trimester' and why specialized recovery is essential",
            "Introduction to the Client Journey Map: From depletion to empowered matrescence",
            "Core coaching competencies for the initial postpartum intake"
          ]
        },
        {
          "number": 2,
          "title": "Recovery Evaluation (R): Clinical vs. Coaching Assessment",
          "outline": [
            "Implementing the Recovery Evaluation (R) tool to assess physical and mental baselines",
            "Distinguishing between normal postpartum discomfort and clinical 'red flags'",
            "Subjective vs. objective markers of healing in the first 0-12 weeks",
            "Creating a 'Safe Harbor' environment for honest client self-reporting",
            "Collaboration protocols with OB/GYNs, Midwives, and Pelvic Floor PTs"
          ]
        },
        {
          "number": 3,
          "title": "Physical Healing Markers: Pelvic Floor and Core Integrity",
          "outline": [
            "The anatomy of postpartum recovery: Uterine involution and tissue repair",
            "Screening for Diastasis Recti Abdominis (DRA) within a coaching scope",
            "Identifying signs of pelvic floor dysfunction: Incontinence, heaviness, and pain",
            "Bio-mechanical assessment: Posture, 'mummy thumb,' and breastfeeding ergonomics",
            "The 'Breath-Core Connection' as the first step in physical restoration"
          ]
        },
        {
          "number": 4,
          "title": "Hormonal Baseline: Identifying Postpartum Depletion",
          "outline": [
            "The endocrine 'crash': Understanding the 24-hour drop in progesterone and estrogen",
            "Thyroid health in the postpartum period: Identifying postpartum thyroiditis",
            "Cortisol and the HPA axis: How sleep deprivation impacts hormonal regulation",
            "Identifying signs of 'Postpartum Depletion' vs. clinical depression",
            "Advocating for blood work: Key markers for iron, Vitamin D, and B12"
          ]
        },
        {
          "number": 5,
          "title": "Mental Health Screening: PMADs and Red Flags",
          "outline": [
            "Utilizing the Edinburgh Postnatal Depression Scale (EPDS) in a coaching context",
            "Differentiating between 'Baby Blues' and Postpartum Depression (PPD)",
            "Recognizing Postpartum Anxiety (PPA) and Postpartum OCD (intrusive thoughts)",
            "Postpartum Psychosis: Emergency identification and crisis intervention protocols",
            "Building a referral network of specialized mental health professionals"
          ]
        },
        {
          "number": 6,
          "title": "Emotional Processing (E): The Birth Story Integration",
          "outline": [
            "The neurobiology of storytelling: Why processing the birth story aids recovery",
            "Facilitating the 'Birth Story Session': Active listening and validation techniques",
            "Identifying 'Birth Trauma' and its impact on the early postpartum experience",
            "Techniques for reframing unmet expectations and 'shattered' birth plans",
            "The role of the coach in witnessing vs. 'fixing' emotional pain"
          ]
        },
        {
          "number": 7,
          "title": "Navigating Early Motherhood Emotions: Guilt, Joy, and Grief",
          "outline": [
            "The 'Both/And' concept: Holding space for conflicting emotions in matrescence",
            "Deconstructing the 'Perfect Mother' myth and its impact on recovery",
            "Addressing 'Identity Grief': Mourning the pre-baby self while embracing the new",
            "Managing Postpartum Rage: Triggers, nervous system regulation, and shame reduction",
            "Cultivating self-compassion through specific coaching inquiry"
          ]
        },
        {
          "number": 8,
          "title": "Building the Recovery Roadmap: Setting Realistic Goals",
          "outline": [
            "Synthesizing R and E findings into a personalized recovery plan",
            "The 'Minimum Effective Dose' approach to postpartum goal setting",
            "Establishing the 'Recovery Container': Duration, frequency, and boundaries of coaching",
            "Prioritizing recovery pillars based on the client's unique depletion profile",
            "Client-led goal setting: Moving from 'surviving' to 'thriving' milestones"
          ]
        }
      ]
    },
    {
      "number": 14,
      "title": "L1 Deep Dive: Clinical Foundations & Recovery Evaluation",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Postpartum Landscape: Bridging the Gap in Maternal Care",
          "outline": [
            "Analyzing current global statistics on postpartum morbidity and the 'fourth trimester' care gap",
            "Defining the scope of the Postpartum Recovery Coach within the multidisciplinary medical team",
            "Introduction to the R.E.S.T.O.R.E. Method™ as a standardized framework for recovery",
            "The physiology of the immediate postpartum period (0-6 weeks) vs. the extended recovery window",
            "Establishing the L1 Deep Dive objectives: Moving from general support to clinical literacy"
          ]
        },
        {
          "number": 2,
          "title": "Recovery Evaluation (R): The Comprehensive Assessment Framework",
          "outline": [
            "Mastering the initial Recovery Evaluation (R) intake: Physical, mental, and hormonal markers",
            "Distinguishing between 'normal' postpartum discomfort and clinical indicators of dysfunction",
            "Utilizing the RESTORE Assessment Tool to quantify client progress across seven domains",
            "The role of longitudinal tracking: How to adjust recovery plans based on monthly evaluation data",
            "Client communication strategies for sensitive physical and emotional health reporting"
          ]
        },
        {
          "number": 3,
          "title": "Hormonal Foundations: The Endocrine Shift Post-Birth",
          "outline": [
            "The biological 'crash': Mapping the precipitous drop in Progesterone and Estrogen post-placental delivery",
            "Oxytocin dynamics: The role of the 'bonding hormone' in physical uterine involution and mental health",
            "Postpartum Thyroiditis: Identifying symptoms of thyroid dysfunction often mistaken for 'new mom fatigue'",
            "The HPA Axis and Cortisol: How sleep deprivation and stress impact the endocrine recovery timeline",
            "Nutritional precursors for hormonal synthesis: Linking the 'R' (Evaluation) to the 'O' (Optimized Nutrition)"
          ]
        },
        {
          "number": 4,
          "title": "Physical Repair: Assessing Pelvic Floor and Core Integrity",
          "outline": [
            "Functional anatomy of the postpartum core: Diastasis Recti Abdominis (DRA) screening techniques",
            "Pelvic Floor Dysfunction (PFD): Identifying signs of prolapse, incontinence, and hypertonicity",
            "The 'Breath-Core-Floor' connection: Evaluating diaphragm function in the early recovery phase",
            "Red flags in physical healing: When to refer to a Pelvic Health Physical Therapist",
            "Movement readiness: Criteria for transitioning from basic somatic healing to active exercise"
          ]
        },
        {
          "number": 5,
          "title": "Mental Health Markers: Screening for PMADs",
          "outline": [
            "Clinical literacy: Understanding the spectrum of Perinatal Mood and Anxiety Disorders (PMADs)",
            "Integrating validated screening tools (EPDS and GAD-7) into the Recovery Evaluation process",
            "Distinguishing 'Baby Blues' from Clinical Depression: Timeline and symptom severity markers",
            "Identifying Postpartum OCD and Birth Trauma: Impact on the Emotional Processing (E) pillar",
            "Partner mental health: Strategies for evaluating the secondary caregiver's psychological state"
          ]
        },
        {
          "number": 6,
          "title": "Red Flags and Referral Pathways: Safety in Coaching",
          "outline": [
            "Identifying life-threatening 'Red Flags': Pre-eclampsia, secondary hemorrhage, and infection signs",
            "Postpartum Psychosis: Recognizing the emergency markers and immediate intervention protocols",
            "Building a 'Referral Circle': Vetting and connecting with OBGYNs, Midwives, and Therapists",
            "The Coach's Crisis Protocol: Step-by-step actions for handling client emergencies",
            "Legal and ethical obligations regarding mandatory reporting and scope of practice"
          ]
        },
        {
          "number": 7,
          "title": "The Intake Process: Building the Recovery Roadmap",
          "outline": [
            "The Art of the Initial Consultation: Building trust through the R.E.S.T.O.R.E. lens",
            "Translating evaluation data into a customized 12-week Recovery Roadmap",
            "Setting SMART goals for postpartum recovery: Balancing physical repair with emotional integration",
            "Managing client expectations: Realistic timelines for 'feeling like yourself again'",
            "Digital tools for the modern coach: Onboarding systems and HIPAA-compliant data storage"
          ]
        },
        {
          "number": 8,
          "title": "Ethics, Boundaries, and the Coach-Client Relationship",
          "outline": [
            "Defining the 'Coach vs. Therapist vs. Consultant' boundaries in postpartum care",
            "Managing emotional labor: Preventing burnout while supporting clients through birth trauma",
            "Informed consent and privacy: Protecting sensitive health data in a coaching environment",
            "Professionalism in the home and virtual space: Setting communication hours and response times",
            "The ethics of 'Matrescence': Supporting identity shifts without imposing personal biases"
          ]
        }
      ]
    },
    {
      "number": 15,
      "title": "L1 Deep Dive Module 15",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Recovery Evaluation: Beyond the 6-Week Checkup",
          "outline": [
            "Implementing the 'R' in RESTORE: Identifying gaps in standard postpartum medical care.",
            "Coaching protocols for assessing Diastasis Recti (DR) and pelvic floor functional integrity.",
            "Red flag identification: When to refer to Pelvic Floor PTs, endocrinologists, or mental health specialists.",
            "Tracking 'The Fourth Trimester' biomarkers: Sleep quality, energy cycles, and physical comfort levels.",
            "Developing a custom Recovery Evaluation Scorecard for client progress monitoring."
          ]
        },
        {
          "number": 2,
          "title": "Emotional Processing: Facilitating the Birth Story Integration",
          "outline": [
            "The neurobiology of the birth story: How narrative affects postpartum physiological healing.",
            "Active listening techniques for 'E' (Emotional Processing) without crossing into clinical therapy.",
            "Identifying 'Birth Grief': Supporting clients through the loss of the 'ideal' birth experience.",
            "The impact of birth trauma on early bonding and strategies for emotional reconnection.",
            "Practical exercises for narrative reframing and emotional release in the early weeks."
          ]
        },
        {
          "number": 3,
          "title": "Somatic Healing: Regulating the Postpartum Nervous System",
          "outline": [
            "Introduction to 'S' (Somatic Healing): Understanding the polyvagal theory in the context of new motherhood.",
            "Gentle somatic movements for pelvic congestion and ribcage expansion post-pregnancy.",
            "Vagus nerve stimulation techniques to combat postpartum hypervigilance and anxiety.",
            "The role of 'Co-regulation': How a coach’s presence stabilizes the client's nervous system.",
            "Grounding protocols for 'The Witching Hour' and high-stress parenting moments."
          ]
        },
        {
          "number": 4,
          "title": "Transition Navigation: Identity Shifts and Matrescence",
          "outline": [
            "Defining Matrescence: Coaching through the psychological 'second puberty' of becoming a mother.",
            "Navigating the 'T' (Transition Navigation): Renegotiating identity in the workplace and social circles.",
            "The 'Invisible Load' audit: Identifying and delegating cognitive labor within the household.",
            "Boundary setting with extended family: Protecting the postpartum bubble during the transition.",
            "Managing the 'Motherhood Penalty' and career re-entry anxiety."
          ]
        },
        {
          "number": 5,
          "title": "Optimized Nutrition: Micronutrient Replenishment Strategies",
          "outline": [
            "The 'O' in RESTORE: Identifying common postpartum nutrient depletions (Iron, Zinc, DHA, Choline).",
            "Anti-inflammatory dietary protocols to support tissue repair and hormonal stabilization.",
            "Nutritional support for lactation: Caloric demands vs. nutrient density.",
            "Blood sugar regulation for mood stability: The link between glucose and postpartum irritability.",
            "Meal planning for the 'Time-Poor' mother: Practical 'RESTORE' snacks and quick-prep meals."
          ]
        },
        {
          "number": 6,
          "title": "Relational Support: Strengthening the Family Unit",
          "outline": [
            "The 'R' (Relational Support) framework: Moving from 'Couple' to 'Co-parents'.",
            "Communication scripts for expressing needs to partners without resentment or blame.",
            "Building the 'Village': Identifying and vetting local support resources (doulas, sitters, community groups).",
            "Navigating intimacy and physical reconnection: A coach's guide to sensitive conversations.",
            "Conflict resolution strategies for sleep-deprived households."
          ]
        },
        {
          "number": 7,
          "title": "Empowered Matrescence: Designing Sustainable Self-Care",
          "outline": [
            "The final 'E' in RESTORE: Moving from survival mode to long-term thriving.",
            "Values-based goal setting: Aligning motherhood with personal passions and growth.",
            "The 'Micro-Self-Care' model: Finding restorative moments in a 24/7 caregiving schedule.",
            "Future-pacing: Helping clients visualize their identity 6-12 months postpartum.",
            "Developing a 'Resilience Plan' for future setbacks or subsequent pregnancies."
          ]
        },
        {
          "number": 8,
          "title": "The RESTORE Integration: Case Studies and Client Success",
          "outline": [
            "Synthesis of the R.E.S.T.O.R.E. Method™: Managing a full client intake and assessment.",
            "Case Study 1: Navigating physical recovery complications with 'R' and 'S' interventions.",
            "Case Study 2: Overcoming relational strain and identity loss using 'T' and 'R' strategies.",
            "Troubleshooting common coaching obstacles: Client resistance and 'stuck' progress.",
            "Finalizing the Postpartum Recovery Roadmap: A step-by-step guide for L1 Coaches."
          ]
        }
      ]
    },
    {
      "number": 16,
      "title": "L2: Advanced Case Studies",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Complex Physical Recovery: C-Section Complications & Pelvic Dysfunction",
          "outline": [
            "Applying 'Recovery Evaluation' to identify secondary complications like incisional adhesions and pelvic floor hypertonicity.",
            "Integrating 'Somatic Healing' techniques for scar tissue release and abdominal wall reconnection.",
            "Case Study: A client with emergency C-section, chronic pelvic pain, and secondary diastasis recti (n=1).",
            "Coordinating with Pelvic Floor Physical Therapists (PFPT) to optimize the R.E.S.T.O.R.E. timeline.",
            "Psychological impacts of 'failed' birth plans on physical healing and somatic awareness."
          ]
        },
        {
          "number": 2,
          "title": "Navigating Severe PMADs: Clinical Collaboration & Emotional Processing",
          "outline": [
            "Utilizing 'Emotional Processing' for clients diagnosed with clinical PPD or PPA while maintaining coaching boundaries.",
            "Case Study: Managing a client with Postpartum OCD and intrusive thoughts through the R.E.S.T.O.R.E. framework.",
            "Establishing a multidisciplinary care team: When to refer out and how to support the clinical treatment plan.",
            "The role of 'Somatic Healing' in down-regulating the sympathetic nervous system during panic episodes.",
            "Data-driven tracking of emotional triggers and recovery markers over a 6-month period."
          ]
        },
        {
          "number": 3,
          "title": "Nutritional Rehabilitation for Severe Hormonal & Nutrient Depletion",
          "outline": [
            "Advanced 'Optimized Nutrition' strategies for clients with postpartum thyroiditis or adrenal dysfunction.",
            "Case Study: A multipara client (3+ children) presenting with 'Postpartum Depletion Syndrome' and extreme fatigue.",
            "Analyzing the impact of breastfeeding on micronutrient demands (Zinc, Copper, Magnesium, and B-vitamins).",
            "Implementing blood sugar stabilization protocols to mitigate hormonal mood swings and energy crashes.",
            "The 'Recovery Evaluation' of metabolic health: Interpreting labs and symptom clusters for targeted intervention."
          ]
        },
        {
          "number": 4,
          "title": "Traumatic Birth Integration: Somatic & Emotional Frameworks",
          "outline": [
            "Deep dive into 'Somatic Healing' for birth-related PTSD and nervous system dysregulation.",
            "Facilitating the 'Birth Story Integration' process to move from trauma to empowered narrative.",
            "Case Study: A client navigating the aftermath of medical gaslighting and birth trauma during a NICU stay.",
            "Utilizing grounding techniques and Polyvagal Theory to facilitate 'Transition Navigation' post-trauma.",
            "Measuring progress in trauma recovery using the Posttraumatic Growth Inventory (PTGI)."
          ]
        },
        {
          "number": 5,
          "title": "The Executive Mother: Navigating Identity & Career Transitions",
          "outline": [
            "Advanced 'Transition Navigation' for high-performance professionals returning to demanding careers.",
            "Case Study: Managing the identity shift (Matrescence) of a C-suite executive balancing breastfeeding and boardrooms.",
            "Strategies for 'Relational Support' in dual-career households with minimal extended family assistance.",
            "Boundary setting and time-blocking techniques to protect the 'Empowered Matrescence' plan.",
            "Addressing the 'invisible load' and cognitive labor of motherhood within the R.E.S.T.O.R.E. context."
          ]
        },
        {
          "number": 6,
          "title": "Relational Conflict & The Postpartum Partnership",
          "outline": [
            "Implementing 'Relational Support' protocols for couples experiencing severe postpartum relationship strain.",
            "Case Study: Navigating the 'Roommate Syndrome' and intimacy challenges 6-12 months postpartum.",
            "Communication frameworks for renegotiating domestic labor and childcare responsibilities.",
            "The impact of paternal postpartum depression on the maternal recovery trajectory.",
            "Building a 'Village' from scratch: Community framework development for isolated families."
          ]
        },
        {
          "number": 7,
          "title": "Autoimmune Flares & Chronic Health in the Postpartum Period",
          "outline": [
            "Managing the 'Recovery Evaluation' for clients with pre-existing or new-onset autoimmune conditions (Hashimoto's, RA, Lupus).",
            "Anti-inflammatory 'Optimized Nutrition' protocols for mitigating postpartum inflammatory markers.",
            "Case Study: A client navigating a Crohn's disease flare-up while managing a newborn and toddler.",
            "The intersection of 'Somatic Healing' and chronic pain management in the fourth trimester.",
            "Balancing medication side effects with the R.E.S.T.O.R.E. holistic recovery goals."
          ]
        },
        {
          "number": 8,
          "title": "Empowered Matrescence: Long-term Integration & Coaching Exit",
          "outline": [
            "Finalizing the 'Empowered Matrescence' plan for sustainable, long-term maternal thriving.",
            "Case Study: A 12-month transformation analysis from 'survival mode' to 'thriving motherhood'.",
            "Strategies for preventing 'Postpartum Relapse' and maintaining hormonal/emotional balance long-term.",
            "The ethics of the coaching exit: Ensuring client self-efficacy and independence.",
            "Advanced goal setting for the 'Next Phase' of motherhood: Career, fitness, and personal growth."
          ]
        }
      ]
    },
    {
      "number": 17,
      "title": "L2: Complex Client Scenarios",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Birth Trauma and Somatic Integration",
          "outline": [
            "Defining subjective vs. objective birth trauma and its impact on the nervous system.",
            "Applying 'Somatic Healing' techniques to de-escalate PTSD triggers during coaching sessions.",
            "The R.E.S.T.O.R.E. framework for facilitating 'Emotional Processing' of the traumatic birth story.",
            "Identifying 'Red Flags' in Recovery Evaluation that require immediate clinical referral.",
            "Tools for grounding and stabilization when a client experiences a flashback."
          ]
        },
        {
          "number": 2,
          "title": "Coaching the Neurodivergent Postpartum Client",
          "outline": [
            "Managing sensory processing challenges (overstimulation) in ADHD and Autistic mothers.",
            "Adapting 'Optimized Nutrition' protocols for executive dysfunction and sensory food aversions.",
            "Executive function coaching for 'Transition Navigation': Managing the mental load of a newborn.",
            "Recognizing 'Autistic Burnout' vs. Postpartum Depression during Recovery Evaluation.",
            "Creating neuro-affirming 'Relational Support' structures within the family unit."
          ]
        },
        {
          "number": 3,
          "title": "Chronic Illness and Autoimmune Flares",
          "outline": [
            "The 'Postpartum Flare' window: Identifying triggers for RA, Lupus, and Hashimoto’s.",
            "Targeted 'Optimized Nutrition' strategies to reduce systemic inflammation and support the gut-immune axis.",
            "Pacing and energy conservation techniques within the 'Somatic Healing' pillar.",
            "Collaborating with rheumatologists and endocrinologists for an integrated Recovery Evaluation.",
            "Navigating the identity shift of being a 'SICK' mother during Transition Navigation."
          ]
        },
        {
          "number": 4,
          "title": "High-Order Multiples: Advanced Recovery Logistics",
          "outline": [
            "Physical recovery nuances: Managing severe Diastasis Recti and pelvic floor load after twins/triplets.",
            "Advanced 'Relational Support': Organizing 'Help Teams' and managing volunteer burnout.",
            "The impact of extreme sleep deprivation on hormonal markers in Recovery Evaluation.",
            "Transition Navigation: Shifting from 'Individual Mothering' to 'System Management'.",
            "Optimized Nutrition for the high-demand lactation needs of multiple infants."
          ]
        },
        {
          "number": 5,
          "title": "Postpartum Recovery After Pregnancy or Infant Loss",
          "outline": [
            "The physical reality of postpartum: Managing lactation suppression and hormonal drops without a baby.",
            "Grief-informed 'Emotional Processing': Holding space for the 'Empty Arms' transition.",
            "Somatic techniques for processing 'Body Memory' and physical grief stored in the tissues.",
            "Relational Support: Coaching the partner and siblings through the bereavement process.",
            "Redefining 'Empowered Matrescence' in the context of loss and memorialization."
          ]
        },
        {
          "number": 6,
          "title": "The NICU Experience: Coaching Through Medical Fragility",
          "outline": [
            "Addressing the 'Hyper-Vigilance' state: Somatic Healing for the parent in the NICU.",
            "Optimized Nutrition for the pumping mother under chronic hospital-grade stress.",
            "Navigating the 'Delayed Transition': Coaching the shift from hospital care to home care.",
            "Relational Support: Bridging the communication gap between NICU staff and the family unit.",
            "Recovery Evaluation for the 'Secondary Trauma' often experienced by NICU parents."
          ]
        },
        {
          "number": 7,
          "title": "Advanced Hormonal Dysregulation and PMADs",
          "outline": [
            "Distinguishing between 'Baby Blues,' clinical PPD/PPA, and Postpartum Thyroiditis.",
            "Nutritional co-factors for neurotransmitter production (Tryptophan, B6, and Zinc) in 'Optimized Nutrition'.",
            "Recovery Evaluation markers for 'Adrenal Fatigue' vs. clinical depression symptoms.",
            "Integrating 'Somatic Healing' with medical interventions (medication management coaching).",
            "Developing a long-term hormonal health roadmap for 'Empowered Matrescence'."
          ]
        },
        {
          "number": 8,
          "title": "Culturally Competent Coaching for Marginalized Identities",
          "outline": [
            "Addressing the impact of systemic stressors (racism, bias) on the postpartum nervous system.",
            "Culturally responsive 'Relational Support': Working with non-traditional and chosen family structures.",
            "Applying the R.E.S.T.O.R.E. method through an intersectional and trauma-informed lens.",
            "Advocacy skills for the coach: Helping clients navigate biased healthcare systems.",
            "Community-based healing models for 'Empowered Matrescence' in marginalized groups."
          ]
        }
      ]
    },
    {
      "number": 18,
      "title": "L2: Integration & Synthesis",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Case Conceptualization & The RESTORE Framework",
          "outline": [
            "Developing a multi-dimensional intake process integrating all seven R.E.S.T.O.R.E. pillars for complex L2 cases",
            "Identifying 'Priority Pillars' based on clinical presentation, trauma history, and client readiness",
            "Cross-referencing physical markers (Recovery Evaluation) with emotional narratives (Emotional Processing) to find root causes",
            "Creating a dynamic 12-week synthesis roadmap that moves a client from acute recovery to empowered matrescence",
            "Advanced goal-setting: Aligning physiological healing with psychological identity shifts"
          ]
        },
        {
          "number": 2,
          "title": "Interdisciplinary Synthesis: Bridging Somatic and Emotional Healing",
          "outline": [
            "The neurobiology of birth trauma: Understanding how Somatic Healing (S) facilitates deeper Emotional Processing (E)",
            "Techniques for 'Titration' in postpartum coaching—balancing body-based regulation with narrative birth story integration",
            "Recognizing somatic markers (physical tension, breath patterns) of emotional breakthroughs and vice versa",
            "Case study synthesis: Resolving 'stuck' emotional patterns through targeted autonomic nervous system regulation",
            "Managing 'Somatic Flooding': Ethical boundaries when emotional release occurs during body-based work"
          ]
        },
        {
          "number": 3,
          "title": "Metabolic & Nervous System Integration: Somatics and Nutrition",
          "outline": [
            "The Gut-Brain-Hormone axis: How Optimized Nutrition (O) stabilizes the nervous system to support Somatic Healing (S)",
            "Nutrient-dense protocols for adrenal recovery and neurotransmitter synthesis during high-stress transitions",
            "Using somatic cues (hunger/fullness, energy dips) to guide intuitive eating and nutritional replenishment",
            "Managing 'Postpartum Depletion' through a combined metabolic and body-based regulation approach",
            "The impact of blood sugar stability on emotional regulation and relational communication"
          ]
        },
        {
          "number": 4,
          "title": "Advanced Transition Navigation: Identity Synthesis and Matrescence",
          "outline": [
            "Deconstructing the 'Good Mother' archetype through the lens of Empowered Matrescence (E)",
            "Navigating identity shifts (T) in career, partnership, and self-perception post-birth using cognitive reframing",
            "Values Synthesis: Aligning the new maternal identity with pre-existing personal goals and professional ambitions",
            "Coaching through the 'Matrescence Gap'—the psychological space between the pre-parent self and the emerging mother",
            "Developing rituals of transition to mark the end of the 'Recovery' phase and the start of 'Empowerment'"
          ]
        },
        {
          "number": 5,
          "title": "Relational Ecosystems: Synthesizing Support and Communication",
          "outline": [
            "Advanced Relational Support (R): Mapping the family system and identifying 'Support Leakage' or toxic dynamics",
            "Communication synthesis: Teaching couples to navigate the Transition (T) through RESTORE-based active listening",
            "Building a 'Village Architecture' that sustains long-term recovery and prevents maternal isolation",
            "Strategies for integrating extended family and community into the client’s long-term wellness framework",
            "Navigating relational friction during the 'Somatic Healing' phase: Helping partners understand nervous system regulation"
          ]
        },
        {
          "number": 6,
          "title": "Long-term Sustainability: From Recovery to Empowered Matrescence",
          "outline": [
            "Transitioning from 'Recovery' to 'Thriving': The final synthesis stage of the RESTORE Method",
            "Developing a 'Matrescence Maintenance Plan' for years 1-3 postpartum to prevent burnout",
            "Synthesizing self-care as a non-negotiable component of family health and relational stability",
            "Future-proofing: Using RESTORE principles to prepare for subsequent pregnancies or major life transitions",
            "The psychology of confidence: How physical recovery (R) and emotional processing (E) build maternal self-efficacy"
          ]
        },
        {
          "number": 7,
          "title": "Troubleshooting the Synthesis: Managing Resistance and Setbacks",
          "outline": [
            "Identifying 'Pillar Collapse': Diagnostic strategies for when one area of the RESTORE method fails to progress",
            "Managing client resistance to emotional processing or somatic awareness through motivational interviewing",
            "Synthesis in crisis: Adapting the RESTORE method for clients experiencing PMADs (Postpartum Mood and Anxiety Disorders)",
            "Ethical boundaries and referral synthesis: Determining when the coach’s role ends and clinical therapy begins",
            "Reframing setbacks as 'Integration Opportunities' within the matrescence process"
          ]
        },
        {
          "number": 8,
          "title": "The Master Practitioner: Integrating RESTORE into Professional Practice",
          "outline": [
            "Defining your unique coaching voice and niche within the Certified Postpartum Recovery Coach™ framework",
            "Synthesis of business ethics, professional boundaries, and high-level postpartum advocacy",
            "Final Case Study: A comprehensive review of a successful L2 RESTORE-based coaching journey from intake to empowerment",
            "Continuous Education: Staying current with emerging research in somatic healing and maternal nutrition",
            "The evolution of the Postpartum Recovery Coach™: Leading the shift in maternal healthcare standards"
          ]
        }
      ]
    },
    {
      "number": 19,
      "title": "L2: Research & Evidence",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Evidence-Based Foundations of Postpartum Recovery",
          "outline": [
            "Defining Evidence-Based Practice (EBP) within the scope of postpartum coaching.",
            "Analysis of the 'Fourth Trimester' research gap and current clinical limitations.",
            "Understanding the hierarchy of evidence: From meta-analyses to expert consensus in maternal health.",
            "The scientific rationale behind the R.E.S.T.O.R.E. Method™ framework.",
            "Ethical application of research findings in a non-clinical coaching environment."
          ]
        },
        {
          "number": 2,
          "title": "Clinical Validity of Recovery Evaluation (R)",
          "outline": [
            "Comparative analysis of standardized screening tools (EPDS, GAD-7) vs. holistic coaching assessments.",
            "Biomarker research: The role of cortisol, thyroid function, and ferritin in postpartum fatigue.",
            "Evidence-based indicators for pelvic floor and core dysfunction referral.",
            "The predictive value of early 'Recovery Evaluation' on long-term maternal wellness outcomes.",
            "Data-driven approaches to tracking physical and mental health markers over time."
          ]
        },
        {
          "number": 3,
          "title": "Neuroplasticity and Emotional Processing (E)",
          "outline": [
            "The neurobiology of matrescence: Structural brain changes and functional reorganization.",
            "Oxytocin and Vasopressin: The hormonal science of bonding and maternal mental health.",
            "Evidence-based trauma-informed strategies for birth story integration and processing.",
            "Research on the efficacy of narrative coaching in reducing postpartum distress.",
            "The impact of emotional regulation on the infant-caregiver attachment bond."
          ]
        },
        {
          "number": 4,
          "title": "Somatic Science and Nervous System Regulation (S)",
          "outline": [
            "Polyvagal Theory in the postpartum context: Understanding the 'freeze' and 'fawn' responses.",
            "The science of the Vagus nerve and its role in postpartum anxiety management.",
            "Research-backed somatic techniques: Breathwork, grounding, and progressive muscle relaxation.",
            "The physiological impact of chronic stress on postpartum tissue repair and wound healing.",
            "Interoception and proprioception: Re-establishing the mind-body connection after birth."
          ]
        },
        {
          "number": 5,
          "title": "Psychosocial Research on Matrescence (T)",
          "outline": [
            "The sociology of motherhood: Transition Navigation and identity shift research.",
            "Cognitive dissonance in early motherhood: The gap between 'ideal' and 'real' maternal experiences.",
            "Gottman-based research on relationship satisfaction and conflict during the transition to parenthood.",
            "Impact of societal expectations and 'intensive mothering' on maternal self-efficacy.",
            "Longitudinal studies on maternal identity and its influence on long-term psychological health."
          ]
        },
        {
          "number": 6,
          "title": "Nutritional Biochemistry and Postpartum Depletion (O)",
          "outline": [
            "The 'Nutrient Depletion' hypothesis: Clinical evidence for micronutrient deficiencies in the fourth trimester.",
            "Omega-3 fatty acids and PPD: A review of meta-analyses and clinical guidelines.",
            "The gut-brain axis: Research on probiotics and their influence on postpartum mood disorders.",
            "Evidence-based dietary protocols for HPA axis stabilization and hormonal balance.",
            "The biochemistry of lactation: Nutrient requirements and metabolic demands of breastfeeding."
          ]
        },
        {
          "number": 7,
          "title": "Sociology and Impact of Relational Support (R)",
          "outline": [
            "Epidemiological data on the 'Village' effect: How social support correlates with maternal health.",
            "The impact of partner support on breastfeeding duration and maternal mental health outcomes.",
            "Research on community-based interventions and peer support models for postpartum recovery.",
            "Communication frameworks: Evidence-based strategies for reducing family unit conflict.",
            "The role of professional coaching in the modern maternal support ecosystem."
          ]
        },
        {
          "number": 8,
          "title": "Longitudinal Outcomes of Empowered Matrescence (E)",
          "outline": [
            "Defining 'Thriving' vs. 'Surviving': Longitudinal research on maternal well-being.",
            "The ROI of postpartum coaching: Analyzing health system impacts and economic benefits.",
            "Long-term effects of maternal self-care efficacy on child developmental milestones.",
            "Future directions in postpartum recovery research and the evolution of the R.E.S.T.O.R.E. Method™.",
            "Synthesizing evidence into a sustainable, long-term growth plan for clients."
          ]
        }
      ]
    },
    {
      "number": 20,
      "title": "L2: Assessment Tools",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Scope of Practice and Assessment Ethics",
          "outline": [
            "Distinguishing between diagnostic screening (clinical) and recovery assessment (coaching).",
            "Establishing clear referral pathways and 'red flag' protocols for immediate medical or psychological intervention.",
            "Ethical considerations in trauma-informed data collection and client confidentiality.",
            "The role of the Postpartum Recovery Coach within the multidisciplinary care team.",
            "Informed consent processes specific to physical and emotional assessments."
          ]
        },
        {
          "number": 2,
          "title": "The RESTORE Recovery Evaluation (R) Protocol",
          "outline": [
            "Implementing the comprehensive RESTORE intake questionnaire for holistic client profiling.",
            "Biopsychosocial modeling: Assessing the interplay of biology, psychology, and social environment.",
            "Establishing baseline metrics for physical healing, sleep architecture, and daily functioning.",
            "Differentiating between subjective client experience and objective recovery markers.",
            "Utilizing the 'R' phase to build rapport and psychological safety during the initial intake."
          ]
        },
        {
          "number": 3,
          "title": "Advanced Mental Health and Mood Screening",
          "outline": [
            "Administering and interpreting the Edinburgh Postnatal Depression Scale (EPDS) in a coaching context.",
            "Utilizing the Postpartum Anxiety Screening Scale (PASS) to identify sub-clinical anxiety trends.",
            "Screening for Postpartum OCD, intrusive thoughts, and the distinction from postpartum psychosis.",
            "Assessing emotional regulation and the 'Emotional Processing' (E) capacity of the client.",
            "Tracking mood fluctuations in relation to hormonal shifts and sleep deprivation."
          ]
        },
        {
          "number": 4,
          "title": "Physical Recovery and Structural Assessment",
          "outline": [
            "Identifying indicators of Diastasis Recti Abdominis (DRA) and pelvic floor dysfunction through client self-report.",
            "Assessing scar tissue health (C-section or perineal) and its impact on mobility and comfort.",
            "Evaluation of postpartum postural shifts, gait changes, and common repetitive strain injuries (e.g., De Quervain's).",
            "Identifying physical 'red flags' that require specialized Physical Therapy or OBGYN referral.",
            "Coordinating with Pelvic Health PTs to integrate clinical findings into the coaching plan."
          ]
        },
        {
          "number": 5,
          "title": "Bio-Nutritional and Hormonal Markers",
          "outline": [
            "Assessing clinical signs of postpartum nutrient depletion (Iron, B12, Vitamin D, and Magnesium).",
            "Evaluating symptoms of thyroid dysfunction and adrenal fatigue common in the fourth trimester.",
            "Tracking the return of the menstrual cycle and the impact of breastfeeding on hormonal baseline.",
            "Nutritional intake logging: Assessing caloric and micronutrient density for tissue repair.",
            "Utilizing the 'Optimized Nutrition' (O) assessment to identify inflammatory triggers."
          ]
        },
        {
          "number": 6,
          "title": "Relational and Environmental Assessment",
          "outline": [
            "Mapping the 'Relational Support' (R) framework: Assessing partner dynamics and family involvement.",
            "Quantifying the 'invisible load' and division of labor within the household.",
            "Evaluating the physical environment for safety, rest optimization, and stress reduction.",
            "Identifying social isolation markers and gaps in the client's local community resources.",
            "Assessing communication patterns and conflict resolution styles within the family unit."
          ]
        },
        {
          "number": 7,
          "title": "Somatic and Nervous System Profiling",
          "outline": [
            "Assessing Heart Rate Variability (HRV) as a metric for autonomic nervous system resilience.",
            "Identifying the client’s 'Window of Tolerance' and current state (Hyper-arousal vs. Hypo-arousal).",
            "Body mapping: Identifying somatic storage of birth trauma or physical tension patterns.",
            "Evaluating breath patterns and the coordination of the 'Core-Breath' mechanism.",
            "Applying 'Somatic Healing' (S) assessments to determine readiness for physical exercise."
          ]
        },
        {
          "number": 8,
          "title": "Data Synthesis and the Empowered Recovery Plan",
          "outline": [
            "Triangulating data from all RESTORE domains to identify primary recovery priorities.",
            "Translating assessment findings into client-centered SMART goals.",
            "Creating the 'Empowered Matrescence' (E) roadmap for long-term growth and confidence.",
            "Establishing a re-assessment schedule to measure progress and adjust coaching interventions.",
            "Synthesizing assessment data into a professional 'Recovery Summary' for the client's medical providers."
          ]
        }
      ]
    },
    {
      "number": 21,
      "title": "L2: Treatment Planning",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Clinical Assessment & The RESTORE Framework",
          "outline": [
            "Translating Recovery Evaluation (R) data into high-level actionable coaching objectives for Tier L2 clients.",
            "Stratifying client risk levels (Green, Yellow, Red) to determine intervention intensity and frequency.",
            "The hierarchy of postpartum recovery: Prioritizing somatic safety and nervous system regulation over emotional processing.",
            "Setting clinical SMART goals within the context of the RESTORE methodology for measurable outcomes."
          ]
        },
        {
          "number": 2,
          "title": "Designing the Recovery Evaluation (R) Protocol",
          "outline": [
            "Advanced interpretation of physical healing markers including diastasis recti severity and pelvic floor dysfunction patterns.",
            "Mental health screening beyond the EPDS: Utilizing GAD-7, PHQ-9, and trauma-informed intake assessments.",
            "Identifying hormonal red flags (HPA-axis dysfunction and thyroid imbalances) that necessitate medical referral.",
            "Establishing baseline metabolic and nutrient status assessments to inform the Optimized Nutrition (O) pillar."
          ]
        },
        {
          "number": 3,
          "title": "Integrating Emotional & Somatic Healing (E & S) into Care Plans",
          "outline": [
            "Strategic sequencing: Why Somatic Healing (S) must stabilize the nervous system before Emotional Processing (E) can begin.",
            "Designing personalized nervous system regulation protocols (vagus nerve work and grounding) for high-anxiety presentations.",
            "Creating a Birth Story Integration timeline within the treatment plan to address birth trauma.",
            "Somatic techniques for pelvic floor reconnection and the release of stored physical tension from labor."
          ]
        },
        {
          "number": 4,
          "title": "Nutritional Optimization (O) for Complex Postpartum Pathologies",
          "outline": [
            "Targeted replenishment strategies for Stage 3 Postpartum Depletion and severe micronutrient deficiencies.",
            "Designing anti-inflammatory protocols for postpartum autoimmune flare-ups (Hashimoto’s and Rheumatoid Arthritis).",
            "Therapeutic dosing and timing of key nutrients (Iron, B12, Magnesium, Vitamin D) in a clinical coaching plan.",
            "Balancing lactation demands with maternal nutrient density to prevent 'burnout breastfeeding' syndrome."
          ]
        },
        {
          "number": 5,
          "title": "Transition Navigation (T) & Identity Reconstruction",
          "outline": [
            "Mapping the 'Matrescence Map': Identifying identity friction points in the transition to motherhood.",
            "Values-based coaching for navigating the return-to-work transition or the shift to a stay-at-home role.",
            "Cognitive reframing techniques for addressing 'Mom Guilt' and perfectionism in the treatment plan.",
            "Energy preservation strategies and time-blocking for the first 12 months of the matrescence process."
          ]
        },
        {
          "number": 6,
          "title": "Relational Support (R) & Family Systems Planning",
          "outline": [
            "The 'Postpartum Pact': Facilitating partner communication and renegotiating domestic roles post-birth.",
            "Building a 'Village Map': Identifying, vetting, and managing external support systems (family, doulas, help).",
            "Conflict resolution frameworks for managing the specific relationship strains inherent in early parenthood.",
            "Setting clinical boundaries with extended family to protect the maternal-infant dyad and mental health."
          ]
        },
        {
          "number": 7,
          "title": "Case Conceptualization & Multi-Disciplinary Coordination",
          "outline": [
            "Writing professional progress reports and referral letters for OB/GYNs, therapists, and pelvic floor PTs.",
            "Recognizing the scope of practice: When a treatment plan requires psychiatric intervention or surgical consultation.",
            "Collaborative care models: Positioning the Recovery Coach as the lead coordinator of the care team.",
            "Ethical considerations in data sharing, client confidentiality, and HIPAA/GDPR compliance in L2 coaching."
          ]
        },
        {
          "number": 8,
          "title": "Long-Term Empowered Matrescence (E) & Discharge Planning",
          "outline": [
            "Defining 'Recovery Success': Utilizing objective clinical markers and subjective client milestones for graduation.",
            "The 'Sustainability Plan': Transitioning the client from intensive coaching to self-led maintenance and growth.",
            "Relapse prevention: Creating a 'Red Flag' action plan for future stressors and subsequent pregnancies.",
            "Legacy coaching: Empowering the mother to integrate her recovery journey into long-term family leadership and confidence."
          ]
        }
      ]
    },
    {
      "number": 22,
      "title": "L2: Ethical Considerations",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Defining the Scope of Practice in Postpartum Recovery",
          "outline": [
            "The legal and ethical boundaries between coaching, psychotherapy, and medical care.",
            "Identifying 'Red Flags' during the Recovery Evaluation (R) that require immediate medical referral.",
            "The ethics of nutritional coaching: Distinguishing between 'Optimized Nutrition' and clinical dietetics.",
            "Establishing a professional referral network to support the R.E.S.T.O.R.E. Method™ framework.",
            "Communicating the coach's role clearly to prevent client over-reliance or medical misconceptions."
          ]
        },
        {
          "number": 2,
          "title": "Informed Consent and the RESTORE Method™ Agreement",
          "outline": [
            "Essential elements of a postpartum-specific informed consent document.",
            "Transparency in the R.E.S.T.O.R.E. Method™: Setting expectations for somatic and emotional work.",
            "The 'Right to Withdraw': Honoring client autonomy during vulnerable recovery phases.",
            "Ethical documentation: Balancing clinical-style notes with coaching-focused progress tracking.",
            "Disclosing the coach's credentials and limitations as a Certified Postpartum Recovery Coach™."
          ]
        },
        {
          "number": 3,
          "title": "Confidentiality and Privacy in Emotional Processing",
          "outline": [
            "Ethical handling of sensitive birth stories and trauma narratives (Emotional Processing).",
            "Data protection standards: HIPAA-compliant communication and digital storage of client records.",
            "The ethics of sharing: When and how to use anonymized case studies for professional growth.",
            "Privacy boundaries in home-visit settings versus virtual coaching environments.",
            "Managing confidentiality within the 'Relational Support' (R) framework when partners are involved."
          ]
        },
        {
          "number": 4,
          "title": "Mandatory Reporting and Crisis Intervention Protocols",
          "outline": [
            "Ethical and legal obligations regarding Postpartum Mood and Anxiety Disorders (PMADs).",
            "Screening vs. Diagnosis: The ethical use of assessment tools in the Recovery Evaluation (R).",
            "Navigating mandatory reporting for child safety and self-harm concerns in the postpartum period.",
            "Creating a 'Crisis Resource Plan' as part of the initial coaching intake process.",
            "The ethics of 'Hand-offs': Ensuring a warm and safe transition to clinical care when necessary."
          ]
        },
        {
          "number": 5,
          "title": "Cultural Competency and Inclusivity in Matrescence",
          "outline": [
            "Ethical engagement with diverse cultural traditions of 'sitting-in' and postpartum seclusion.",
            "Gender-inclusive language and supporting non-binary or trans-masculine parents through matrescence.",
            "Addressing systemic barriers and 'The Motherhood Penalty' within the Transition Navigation (T) phase.",
            "Decolonizing postpartum care: Respecting traditional wisdom while maintaining evidence-based standards.",
            "Mitigating unconscious bias in coaching assessments and recommendations."
          ]
        },
        {
          "number": 6,
          "title": "Professional Boundaries and Dual Relationships",
          "outline": [
            "Identifying and managing conflicts of interest in small communities or online spaces.",
            "The ethics of social media: Boundary-setting for DMs, comments, and public interactions.",
            "Physical boundaries in Somatic Healing (S): The ethics of touch and body-based coaching.",
            "Managing 'Transference' and 'Counter-transference' in the coach-client relationship.",
            "Ethical termination: Closing the coaching container once 'Empowered Matrescence' (E) is achieved."
          ]
        },
        {
          "number": 7,
          "title": "Ethical Marketing and Evidence-Based Claims",
          "outline": [
            "Avoiding predatory marketing: Steering clear of 'Bounce Back' culture and body-shame tactics.",
            "Truth in advertising: Making responsible claims regarding 'Optimized Nutrition' and 'Somatic Healing'.",
            "The ethical use of testimonials and 'Before and After' narratives in postpartum recovery.",
            "Representational ethics: Ensuring marketing materials reflect diverse postpartum experiences.",
            "Maintaining the integrity of the Certified Postpartum Recovery Coach™ brand in public discourse."
          ]
        },
        {
          "number": 8,
          "title": "The Ethics of Self-Care and Practitioner Integrity",
          "outline": [
            "The ethical obligation to maintain personal nervous system regulation (Somatic Healing).",
            "Identifying and preventing compassion fatigue and secondary traumatic stress.",
            "The role of professional supervision and peer-mentorship in maintaining ethical standards.",
            "Scope creep: The ethics of recognizing when a coach's personal experience interferes with professional objectivity.",
            "Committing to lifelong learning and the evolution of evidence-based postpartum recovery."
          ]
        }
      ]
    },
    {
      "number": 23,
      "title": "L2: Advanced Techniques",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Recovery Evaluation: Beyond the Basics",
          "outline": [
            "Interpreting comprehensive postpartum blood panels: Cortisol rhythms, thyroid antibodies, and ferritin nuances.",
            "Clinical assessment of the 'Depletion-Inflammation Cycle' in the late postpartum period (6-12 months).",
            "Advanced screening for Pelvic Floor Dysfunction: Identifying prolapse, hypertonicity, and referral triggers.",
            "Utilizing the EPDS and GAD-7 with clinical nuance to identify 'Sub-threshold' perinatal mood disorders.",
            "Assessing the 'Biochemical Birth Story': How physiological birth interventions impact long-term recovery markers."
          ]
        },
        {
          "number": 2,
          "title": "Neuro-Emotional Processing & Birth Trauma Integration",
          "outline": [
            "Applying Narrative Therapy techniques for birth story reconstruction and trauma discharge.",
            "The Neurobiology of Birth Trauma: Understanding the amygdala's role in postpartum PTSD.",
            "Cognitive reframing strategies for 'The Perfect Mother' myth and chronic maternal guilt.",
            "Facilitating grief work: Navigating the loss of the 'pre-baby self' and identity dissonance.",
            "Advanced active listening: Identifying 'The Unspoken Story' in client communication."
          ]
        },
        {
          "number": 3,
          "title": "Somatic Healing: Polyvagal Theory in Postpartum",
          "outline": [
            "Applying Polyvagal Theory to regulate the postpartum nervous system: Moving from 'Freeze' to 'Flow'.",
            "Somatic Experiencing (SE) tools for releasing physical birth trauma stored in the fascia.",
            "Vagus Nerve stimulation techniques to promote oxytocin production and downregulate cortisol.",
            "Proprioceptive Neuromuscular Facilitation (PNF) for correcting 'Nursing Posture' and chronic tension.",
            "The Mind-Body connection in Diastasis Recti repair: Integrating breathwork with physical alignment."
          ]
        },
        {
          "number": 4,
          "title": "Navigating Complex Identity Shifts for High-Achievers",
          "outline": [
            "Coaching the 'Return to Work' transition for executive-level and high-performance mothers.",
            "Strategies for managing the 'Mental Load' and cognitive labor redistribution within the home.",
            "Overcoming career-identity dissonance: Integrating the 'Mother' and 'Professional' archetypes.",
            "Advanced time-blocking and boundary-setting frameworks for the recovering mother.",
            "Addressing 'Ambition Grief': Coaching through the temporary shift in professional velocity."
          ]
        },
        {
          "number": 5,
          "title": "Clinical Nutrition for Postpartum Pathologies",
          "outline": [
            "Therapeutic nutritional protocols for Postpartum Thyroiditis and Adrenal Fatigue (HPA-axis dysfunction).",
            "The Microbiome-Mood Connection: Managing gut dysbiosis to improve postpartum mental health.",
            "Micronutrient replenishment for 'The Depleted Mother': Targeted zinc, B12, and Omega-3 strategies.",
            "Botanical support and adaptogens for hormonal recalibration: Safety, efficacy, and timing.",
            "Developing customized meal frameworks for breastfeeding mothers with complex dietary restrictions."
          ]
        },
        {
          "number": 6,
          "title": "Advanced Relational Dynamics & Family Systems",
          "outline": [
            "The 'Parental Partnership' Framework: Advanced communication tools for conflict resolution.",
            "Managing extended family systems: Setting high-level boundaries with in-laws and grandparents.",
            "Re-establishing intimacy and sexual health: Navigating physical and emotional barriers post-birth.",
            "Coaching the 'Second Child' transition: Managing sibling regression and maternal overwhelm.",
            "Identifying and addressing 'Relationship Enmeshment' during the matrescence process."
          ]
        },
        {
          "number": 7,
          "title": "Empowered Matrescence: Post-Traumatic Growth",
          "outline": [
            "Cultivating 'Post-Traumatic Growth' (PTG) following difficult or traumatic birth experiences.",
            "Developing a long-term 'Maternal Wellness Roadmap' for years two through five.",
            "Integrating the 'Mother-Leader' archetype in community, career, and social spheres.",
            "Building sustainable self-care systems that resist 'Burnout Culture' and maternal martyrdom.",
            "Legacy Planning: Coaching mothers on defining their maternal values and family culture."
          ]
        },
        {
          "number": 8,
          "title": "Integrated Case Management & Ethical Scopes",
          "outline": [
            "Synthesizing the R.E.S.T.O.R.E. Method™ for complex, multi-layered client cases.",
            "Determining clinical referral thresholds: When to refer to Psychiatry, Pelvic PT, or Endocrinology.",
            "Ethical boundaries in L2 Coaching: Liability, scope of practice, and professional 'red flags'.",
            "Building a Collaborative Care Network: Working effectively with OBGYNs, Midwives, and Therapists.",
            "Case Study Analysis: Deconstructing a complex recovery plan from evaluation to empowerment."
          ]
        }
      ]
    },
    {
      "number": 24,
      "title": "L3: Master Practitioner Skills",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Clinical Assessment: The Deep Recovery Evaluation",
          "outline": [
            "Mastering the 'R' in RESTORE: Moving beyond basic intake forms to clinical-grade diagnostic intuition.",
            "Differential screening: Distinguishing between 'Baby Blues,' Postpartum Depression, and Postpartum Depletion.",
            "Interpreting physiological markers: Understanding the impact of cortisol rhythms and thyroid function on recovery pace.",
            "Longitudinal tracking: Utilizing advanced metrics to measure progress across physical, emotional, and hormonal domains.",
            "The Art of the Deep Listen: Identifying 'hidden' symptoms through linguistic cues and non-verbal somatic markers."
          ]
        },
        {
          "number": 2,
          "title": "Neuro-Linguistic Processing of the Birth Story",
          "outline": [
            "Advanced Emotional Processing (E): Utilizing narrative reconstruction to integrate traumatic or unexpected birth events.",
            "The Neuroscience of Birth Trauma: How the amygdala and hippocampus store birth memories and how to facilitate 'reconsolidation.'",
            "Reframing the 'Birth Map': Helping clients reconcile the gap between their idealized birth plan and their actual experience.",
            "Cognitive Dissonance in Matrescence: Techniques for resolving the conflict between the 'Ideal Mother' archetype and the lived reality.",
            "Linguistic anchors: Using specific coaching language to shift a client from a 'victim' narrative to a 'survivor and thriver' perspective."
          ]
        },
        {
          "number": 3,
          "title": "Advanced Somatic Healing & Polyvagal Application",
          "outline": [
            "Mastering Somatic Healing (S): Implementing advanced nervous system regulation protocols for the postpartum body.",
            "Polyvagal Theory in Practice: Mapping the client's autonomic state (ventral, sympathetic, dorsal) to customize coaching interventions.",
            "Fascial Release and C-Section Recovery: Understanding the mind-body connection in surgical scar tissue and physical trauma.",
            "Somatic Experiencing (SE) basics for coaches: Techniques to help clients 'discharge' stored physiological stress safely.",
            "Breathwork and Pelvic Floor Integration: Coordinating respiratory mechanics with core recovery to restore physical integrity."
          ]
        },
        {
          "number": 4,
          "title": "Identity Reconstruction: The Psychology of Matrescence",
          "outline": [
            "Transition Navigation (T) at a Master level: Coaching through the profound neurobiological shift of the maternal brain.",
            "The 'Good Enough Mother': Applying Winnicott’s psychological theories to reduce maternal perfectionism and burnout.",
            "Archetypal Coaching: Identifying and navigating the 'Matriarch,' 'Nurturer,' and 'Individual' archetypes within a single client.",
            "Grief and Growth: Processing the 'loss of self' as a necessary precursor to the emergence of the new maternal identity.",
            "Values Alignment: Helping clients reconstruct their professional and personal goals through the lens of their new identity."
          ]
        },
        {
          "number": 5,
          "title": "Bio-Individual Nutritional Biochemistry for Recovery",
          "outline": [
            "Optimized Nutrition (O): Advanced strategies for replenishing the 'Big Five' nutrient depletions (Iron, Zinc, B12, DHA, Magnesium).",
            "The Gut-Brain-Axis in Postpartum: How microbiome health influences neurotransmitter production and mood stability.",
            "HPA-Axis Regulation: Using targeted micronutrients and adaptogens to support adrenal recovery and circadian rhythm.",
            "Functional Lab Interpretation: Empowering coaches to understand (not diagnose) blood panels to better advocate for client care.",
            "Metabolic Flexibility: Strategies for sustainable energy management without triggering the stress response or compromising lactation."
          ]
        },
        {
          "number": 6,
          "title": "High-Stakes Relational Dynamics & Family Systems",
          "outline": [
            "Relational Support (R): Navigating complex family systems, including toxic dynamics and 'unhelpful' helpers.",
            "The 'Parental Gap': Coaching couples through the shift from romantic partners to a co-parenting executive team.",
            "Boundary Architecture: Teaching clients how to set and enforce high-level boundaries with in-laws, friends, and workplaces.",
            "The Modern Village: Strategies for building a sustainable support network in an era of hyper-individualism.",
            "Conflict Resolution for New Parents: Advanced communication frameworks for sleep-deprived and high-stress environments."
          ]
        },
        {
          "number": 7,
          "title": "Cultivating Agency: The Path to Empowered Matrescence",
          "outline": [
            "Empowered Matrescence (E): Shifting from 'recovery' mode to 'thriving' mode using Positive Psychology frameworks.",
            "Self-Actualization in Motherhood: Utilizing the RESTORE method to facilitate long-term personal growth and maternal confidence.",
            "Post-Traumatic Growth (PTG): Identifying opportunities for resilience and strength following difficult postpartum periods.",
            "Designing the 'Thrive Plan': Creating a 12-month roadmap for sustainable self-care that evolves with the child’s development.",
            "Mastering Intuition: Teaching clients how to filter external 'expert' noise and reconnect with their internal maternal authority."
          ]
        },
        {
          "number": 8,
          "title": "Master Practitioner Ethics, Scope, and Leadership",
          "outline": [
            "Defining the Master Practitioner: Professional boundaries, scope of practice, and when to refer to clinical specialists.",
            "Ethical Complexity: Navigating 'grey area' scenarios in postpartum coaching, including privacy and emergency protocols.",
            "Consultative Coaching: Transitioning from a 'support person' to a high-level consultant for families and organizations.",
            "Leadership in the Field: How to mentor junior coaches and contribute to the evolution of the Postpartum Recovery industry.",
            "The Business of Mastery: Scaling your practice while maintaining the integrity of the RESTORE Method™."
          ]
        }
      ]
    },
    {
      "number": 25,
      "title": "L3: Supervision & Mentoring",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Foundations of Clinical Supervision in Postpartum Coaching",
          "outline": [
            "Defining the L3 Role: Distinguishing between coaching, mentoring, and clinical supervision",
            "The Ethics of Oversight: Legal responsibilities and liability in a supervisory capacity",
            "Establishing the Supervisory Alliance: Building trust and psychological safety with mentees",
            "Models of Supervision: Applying the R.E.S.T.O.R.E. Method™ as a framework for professional evaluation",
            "Setting Performance Benchmarks: Creating measurable KPIs for junior postpartum recovery coaches"
          ]
        },
        {
          "number": 2,
          "title": "Supervising Recovery Evaluation (R) & Somatic Healing (S)",
          "outline": [
            "Auditing Physical Assessments: Ensuring mentees identify red flags requiring medical referral",
            "Advanced Somatic Oversight: Supervising the application of nervous system regulation techniques",
            "Managing 'Scope Creep': Mentoring coaches on the boundary between somatic coaching and physical therapy",
            "Case Review Protocols: Evaluating the efficacy of physical recovery plans and somatic interventions",
            "Safety Standards: Ensuring trauma-informed protocols are maintained during body-based coaching"
          ]
        },
        {
          "number": 3,
          "title": "Mentoring for Emotional Processing (E) & Transition Navigation (T)",
          "outline": [
            "Secondary Traumatic Stress: Guiding coaches through the emotional toll of hearing birth trauma",
            "Advanced Matrescence Supervision: Mentoring coaches through complex client identity shifts",
            "Reflective Practice: Using the 'Birth Story' integration as a tool for coach development",
            "Boundary Management: Supervising the emotional distance between coach and client to prevent enmeshment",
            "Conflict Resolution: Mentoring coaches on handling resistant or emotionally volatile clients"
          ]
        },
        {
          "number": 4,
          "title": "Nutritional Oversight (O) & Evidence-Based Standards",
          "outline": [
            "Technical Review: Auditing coach-developed nutritional plans for scientific accuracy and safety",
            "Hormonal Health Compliance: Ensuring nutritional advice aligns with postpartum endocrine recovery",
            "The Referral Loop: Mentoring coaches on when to involve Registered Dietitians or Endocrinologists",
            "Identifying Disordered Eating: Supervising the coach's role in spotting postpartum orthorexia or restriction",
            "Evidence Updates: Keeping mentees informed on the latest peer-reviewed postpartum nutrition research"
          ]
        },
        {
          "number": 5,
          "title": "Supervising Relational Support (R) & Family Systems",
          "outline": [
            "Family Dynamics Oversight: Supervising coach interventions in high-conflict partner or in-law situations",
            "Community Framework Evaluation: Auditing the 'Relational Support' networks built for clients",
            "Cultural Competency in Mentoring: Ensuring coaches provide inclusive and sensitive relational advice",
            "The Ethics of Dual Relationships: Managing boundaries in small communities or group coaching settings",
            "Communication Coaching: Mentoring the mentor on facilitating family-wide postpartum planning"
          ]
        },
        {
          "number": 6,
          "title": "Coach Longevity: Empowered Matrescence (E) for Professionals",
          "outline": [
            "The 'Coach's Matrescence': Supervising the professional identity shift of the mentee",
            "Burnout Prevention: Applying R.E.S.T.O.R.E. principles to the coach's own self-care and workload",
            "Advanced Self-Regulation: Teaching supervisors how to model nervous system health for their team",
            "Professional Development Planning: Creating long-term career growth strategies for Level 1 and 2 coaches",
            "Sustainability Audits: Evaluating the coach's business model for long-term emotional and financial viability"
          ]
        },
        {
          "number": 7,
          "title": "Group Supervision & Peer Consultation Models",
          "outline": [
            "Facilitating Peer-Review Circles: Implementing structured group feedback using R.E.S.T.O.R.E. standards",
            "The Reflective Practice Model: Moving from 'telling' to 'asking' in the supervisory relationship",
            "Managing Group Dynamics: Handling competition, conflict, and ego within a coaching team",
            "Standardizing Quality Control: Ensuring consistent client outcomes across multiple practitioners",
            "Case Presentation Skills: Training mentees to present complex cases for collaborative review"
          ]
        },
        {
          "number": 8,
          "title": "Leadership, Business Ethics, and Brand Integrity",
          "outline": [
            "The Business of Mentoring: Structuring profitable and ethical supervision contracts",
            "Brand Guardianship: Upholding the integrity and reputation of the Certified Postpartum Recovery Coach™ title",
            "Legal Documentation: Best practices for supervisory notes, evaluations, and incident reporting",
            "Leadership Psychology: Transitioning from a practitioner mindset to an industry leader mindset",
            "Finalizing the L3 Leadership Portfolio: Requirements for master-level certification completion"
          ]
        }
      ]
    },
    {
      "number": 26,
      "title": "L3: Program Development",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Architecting the R.E.S.T.O.R.E. Client Journey",
          "outline": [
            "Defining the three phases of the postpartum recovery arc: Acute Healing, Transitional Integration, and Empowered Matrescence.",
            "Mapping the seven pillars of the R.E.S.T.O.R.E. Method™ across a 12-week high-level coaching program.",
            "Identifying critical 'Success Milestones' for clients to ensure measurable progress in physical and mental health.",
            "Developing a program 'Skeleton' that balances structured curriculum with bio-individual flexibility.",
            "Designing the onboarding experience: From the initial discovery call to the first 'Recovery Evaluation' session."
          ]
        },
        {
          "number": 2,
          "title": "Operationalizing the Recovery Evaluation (R)",
          "outline": [
            "Developing comprehensive L3 intake assessments covering physical healing markers, hormonal symptoms, and mental health screenings.",
            "Creating a 'Recovery Scorecard' to quantify client progress across the RESTORE pillars.",
            "Establishing clinical red flags and referral protocols to ensure safety within the coaching scope of practice.",
            "Techniques for baseline data collection: Sleep quality, nutritional status, and nervous system tone.",
            "Customizing the coaching roadmap based on the initial assessment findings and client-specific goals."
          ]
        },
        {
          "number": 3,
          "title": "Curriculum Design for Emotional and Somatic Healing (E & S)",
          "outline": [
            "Structuring the 'Birth Story Integration' module: Prompts and frameworks for emotional processing.",
            "Designing a library of somatic movement sequences for various stages of physical recovery (0-6 weeks vs. 6-12 weeks).",
            "Integrating nervous system regulation tools (breathwork, grounding) into weekly coaching touchpoints.",
            "Creating educational content that bridges the gap between physiological repair and emotional resilience.",
            "Developing 'Somatic Home-Play' assignments to encourage daily body-based healing practices."
          ]
        },
        {
          "number": 4,
          "title": "Transition Navigation and Matrescence Frameworks (T & E)",
          "outline": [
            "Developing the 'Identity Shift' curriculum: Navigating the psychological transition into motherhood.",
            "Creating tools for 'Lifestyle Auditing' to help clients manage time, energy, and household labor shifts.",
            "Building a roadmap for the return-to-work transition or the shift to stay-at-home parenting.",
            "Designing long-term 'Empowerment Plans' that extend beyond the initial 12-week recovery period.",
            "Facilitating the 'Values Alignment' exercise to help mothers define their unique parenting and self-care philosophy."
          ]
        },
        {
          "number": 5,
          "title": "Nutritional Protocol Development and Resource Kits (O)",
          "outline": [
            "Creating the 'Depletion Audit' to identify common postpartum nutrient deficiencies (Iron, DHA, Magnesium).",
            "Developing modular meal planning templates focused on hormone stabilization and tissue repair.",
            "Building a 'Postpartum Pantry' resource guide and supplement education handouts.",
            "Designing specific protocols for breastfeeding support vs. non-breastfeeding nutritional needs.",
            "Integrating 'Mindful Eating' and 'Blood Sugar Balance' education into the core program curriculum."
          ]
        },
        {
          "number": 6,
          "title": "Building Relational Support and Community Systems (R)",
          "outline": [
            "Designing 'Partner Integration' sessions: Communication frameworks for the family unit.",
            "Creating a 'Village Map' tool to help clients identify and activate their local support networks.",
            "Developing templates for setting boundaries with extended family and visitors during the fourth trimester.",
            "Structuring group coaching components or community circles to foster peer-to-peer connection.",
            "Establishing a vetted referral network of local specialists (Pelvic Floor PTs, IBCLCs, PMH-C therapists)."
          ]
        },
        {
          "number": 7,
          "title": "Delivery Models: 1-on-1 vs. Group Program Logistics",
          "outline": [
            "Comparing the high-touch 1-on-1 coaching model with the scalable group coaching framework.",
            "Tech stack selection: Choosing the right LMS (Learning Management System) and communication tools for L3 delivery.",
            "Designing 'Hybrid' models: Combining pre-recorded content with live implementation sessions.",
            "Pricing strategies for premium L3 postpartum recovery programs based on value and duration.",
            "Developing a 'Program Handbook' that outlines expectations, communication boundaries, and client responsibilities."
          ]
        },
        {
          "number": 8,
          "title": "Program Evaluation, Outcome Tracking, and Scaling",
          "outline": [
            "Implementing 'Exit Evaluations' to measure the total impact of the R.E.S.T.O.R.E. Method™.",
            "Collecting and documenting powerful case studies and testimonials for marketing and program refinement.",
            "Establishing a feedback loop: Using client data to iterate and improve the program curriculum.",
            "Scaling strategies: Moving from a solo-practitioner model to a multi-coach or agency structure.",
            "Finalizing the L3 Professional Portfolio: Demonstrating mastery of program development and client outcomes."
          ]
        }
      ]
    },
    {
      "number": 27,
      "title": "L3: Specialty Applications",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Post-Cesarean Recovery Protocols",
          "outline": [
            "Physiological stages of surgical wound healing and identifying red flags for infection or dehiscence.",
            "Somatic Healing: Techniques for scar tissue mobilization and desensitization to prevent chronic pelvic pain.",
            "Optimized Nutrition for post-surgical tissue repair: Collagen synthesis, vitamin C, and zinc loading.",
            "Emotional Processing of the 'unplanned' surgical birth story and resolving birth trauma.",
            "Biomechanical adjustments for movement and infant handling during the 0-12 week surgical window."
          ]
        },
        {
          "number": 2,
          "title": "Recovery After Pregnancy Loss and Stillbirth",
          "outline": [
            "Adapting the R.E.S.T.O.R.E. Method™ for the 'Empty Arms' postpartum period.",
            "Somatic techniques for regulating the nervous system during acute grief and trauma processing.",
            "Recovery Evaluation: Monitoring physical health markers (lactation suppression, hormonal drops) in the absence of a baby.",
            "Relational Support: Coaching the partner and family through shared and individual grief cycles.",
            "Empowered Matrescence: Redefining identity and finding meaning after loss."
          ]
        },
        {
          "number": 3,
          "title": "The High-Performance Athlete: Return to Sport",
          "outline": [
            "Advanced Recovery Evaluation: Assessing readiness for high-impact loading and plyometrics.",
            "Managing the Female Athlete Triad and RED-S (Relative Energy Deficiency in Sport) in the postpartum context.",
            "Somatic Healing: Dynamic core and pelvic floor integration for heavy lifting and running.",
            "Nutritional periodization for breastfeeding athletes to maintain supply while meeting high caloric demands.",
            "Transition Navigation: Managing the identity shift from 'athlete' to 'mother' and the pressure of the 'bounce back'."
          ]
        },
        {
          "number": 4,
          "title": "Multiples and High-Order Births",
          "outline": [
            "Managing extreme nutrient depletion and the 'double' or 'triple' depletion syndrome.",
            "Relational Support: Building a high-functioning 'village' and delegating tasks in high-demand households.",
            "Somatic strategies for managing the physical toll of carrying and nursing multiple infants.",
            "Transition Navigation: Coaching through the logistical complexity and sleep deprivation of multiples.",
            "Emotional Processing: Addressing the unique guilt and 'divided attention' anxiety in parents of multiples."
          ]
        },
        {
          "number": 5,
          "title": "Neurodivergence in Matrescence (ADHD and Autism)",
          "outline": [
            "Identifying sensory processing challenges in the postpartum period (noise, touch, and sleep hygiene).",
            "Transition Navigation: Executive function coaching for managing newborn schedules and household demands.",
            "Somatic Healing: Tailoring nervous system regulation tools for neurodivergent sensory profiles.",
            "Optimized Nutrition: Addressing dopamine-seeking eating patterns and blood sugar regulation for ADHD.",
            "Empowered Matrescence: Validation of the neurodivergent parenting experience and identity."
          ]
        },
        {
          "number": 6,
          "title": "LGBTQ+ Postpartum Care and Inclusive Recovery",
          "outline": [
            "Gender-affirming recovery language and navigating the healthcare system as a non-traditional family.",
            "Chest-feeding/Body-feeding support and somatic considerations for binding or gender-affirming surgeries.",
            "Transition Navigation: Addressing the unique identity shifts for non-gestational and trans parents.",
            "Relational Support: Navigating legal and social challenges unique to LGBTQ+ families during matrescence.",
            "Emotional Processing: Healing from minority stress and medical trauma during the birth process."
          ]
        },
        {
          "number": 7,
          "title": "Advanced Pelvic Health: Prolapse and Dyspareunia",
          "outline": [
            "Recovery Evaluation: Recognizing symptoms of Pelvic Organ Prolapse (POP) and referral pathways.",
            "Somatic Healing: Intra-abdominal pressure management and 'hypopressive' breathing techniques.",
            "Optimized Nutrition: The role of hydration and fiber in preventing constipation-related pelvic strain.",
            "Emotional Processing: Navigating the psychological impact of sexual dysfunction and pelvic floor trauma.",
            "Coaching strategies for returning to intimacy and sexual wellness after a traumatic birth."
          ]
        },
        {
          "number": 8,
          "title": "Integrative Management of PMADs",
          "outline": [
            "Differentiating between 'Baby Blues' and clinical Postpartum Mood and Anxiety Disorders (PMADs).",
            "The Coach’s Role: Collaborative care with psychotherapists and psychiatrists in the R.E.S.T.O.R.E. framework.",
            "Somatic tools for acute anxiety management and grounding during panic attacks.",
            "Optimized Nutrition: The gut-brain axis and specific micronutrients (Omega-3s, Magnesium) for mood support.",
            "Safety protocols and crisis intervention for Postpartum Psychosis and suicidal ideation."
          ]
        }
      ]
    },
    {
      "number": 28,
      "title": "L3: Crisis & Complex Cases",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Severe PMADs and Postpartum Psychosis: Identification and Stabilization",
          "outline": [
            "Advanced Recovery Evaluation (R): Identifying clinical red flags for Postpartum Psychosis vs. severe OCD",
            "The neurobiology of severe mood disorders: Hormonal triggers and sleep deprivation as catalysts",
            "Immediate crisis intervention protocols: Suicide risk assessment and emergency stabilization",
            "Emotional Processing (E): Supporting the family unit during acute psychiatric hospitalization",
            "Relational Support (R): Coordination with psychiatric teams and multidisciplinary care"
          ]
        },
        {
          "number": 2,
          "title": "Birth Trauma and PTSD: Somatic and Emotional Integration",
          "outline": [
            "Somatic Healing (S): Body-based techniques for discharging 'frozen' trauma from the nervous system",
            "Emotional Processing (E): Narrative reconstruction of the birth story to reduce intrusive memories",
            "The impact of obstetric violence: Recognizing and validating medical trauma in the Recovery Evaluation (R)",
            "Transition Navigation (T): Reconciling the 'ideal' birth with the traumatic reality to prevent identity fragmentation",
            "Clinical markers of PTSD: When to refer for EMDR or specialized trauma therapy"
          ]
        },
        {
          "number": 3,
          "title": "Perinatal Loss and Bereavement: Coaching Through Empty Arms",
          "outline": [
            "Transition Navigation (T): Navigating the unique matrescence of a mother without a living child",
            "Optimized Nutrition (O): Physical recovery and hormonal balancing after stillbirth or late-term loss",
            "Somatic Healing (S): Addressing the 'phantom' sensations and physical ache of grief",
            "Relational Support (R): Facilitating communication between partners with differing grief styles",
            "Empowered Matrescence (E): Long-term rituals for honoring the child while reclaiming personal agency"
          ]
        },
        {
          "number": 4,
          "title": "Medical Crises: Recovery After Preeclampsia, HELLP, and Hemorrhage",
          "outline": [
            "Recovery Evaluation (R): Monitoring long-term cardiovascular and renal health markers post-crisis",
            "Optimized Nutrition (O): Targeted dietary strategies for iron replenishment and blood pressure stabilization",
            "Somatic Healing (S): Re-establishing body trust after life-threatening medical interventions",
            "Transition Navigation (T): Managing the 'medicalized' postpartum period and frequent follow-ups",
            "Emotional Processing (E): Addressing the 'near-miss' mortality trauma and health-related anxiety"
          ]
        },
        {
          "number": 5,
          "title": "Substance Use Disorders and Recovery in the Postpartum Period",
          "outline": [
            "Recovery Evaluation (R): Non-judgmental screening for postpartum relapse and substance misuse",
            "Relational Support (R): Navigating CPS, social services, and community-based recovery frameworks",
            "Somatic Healing (S): Utilizing nervous system regulation to manage cravings and emotional dysregulation",
            "Optimized Nutrition (O): Repairing nutrient depletions caused by substance use to support brain health",
            "Empowered Matrescence (E): Building a sustainable recovery plan within the context of new motherhood"
          ]
        },
        {
          "number": 6,
          "title": "Intimate Partner Violence (IPV): Safety Planning and Advocacy",
          "outline": [
            "Recovery Evaluation (R): Subtle screening for IPV and coercive control in the postpartum home",
            "Relational Support (R): Establishing confidential 'safe-exit' pathways and community resources",
            "Empowered Matrescence (E): Rebuilding maternal autonomy and agency after domestic abuse",
            "Somatic Healing (S): Addressing hypervigilance and the chronic stress response in survivors",
            "Legal and ethical boundaries: Mandatory reporting vs. client confidentiality in crisis cases"
          ]
        },
        {
          "number": 7,
          "title": "The NICU Experience: Complex Transitions and Caregiver Burnout",
          "outline": [
            "Transition Navigation (T): Managing the 'split' life between home and the hospital",
            "Somatic Healing (S): Techniques for 'touch hunger' and bonding through the barrier of an incubator",
            "Emotional Processing (E): Processing the grief of a 'stolen' fourth trimester",
            "Relational Support (R): Building a support squad to handle domestic logistics during long NICU stays",
            "Optimized Nutrition (O): Sustaining maternal energy and milk supply under extreme chronic stress"
          ]
        },
        {
          "number": 8,
          "title": "Crisis Management and the Professional Scope of the L3 Coach",
          "outline": [
            "The R.E.S.T.O.R.E. Crisis Framework: Adapting the methodology for rapid response",
            "Establishing Referral Pathways: Building a pre-vetted network of clinical specialists",
            "Secondary Traumatic Stress: Advanced self-regulation and supervision for the coach",
            "Scope of Practice: Defining the line between 'coaching through crisis' and 'clinical therapy'",
            "Case Closure and Transition: Ensuring long-term stability after the crisis subsides"
          ]
        }
      ]
    },
    {
      "number": 29,
      "title": "L3: Master Integration",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The R.E.S.T.O.R.E. Synthesis: Holistic Integration of Recovery",
          "outline": [
            "Analyzing the interconnectivity of the 7 pillars of the R.E.S.T.O.R.E. Method™",
            "Developing a master-level framework for simultaneous physical and emotional healing",
            "The feedback loop: How hormonal balance (R) influences emotional processing (E)",
            "Mastering the 'flow' of a coaching engagement from assessment to empowerment",
            "Identifying and resolving bottlenecks in the multi-disciplinary recovery process"
          ]
        },
        {
          "number": 2,
          "title": "Advanced Clinical Correlation in Recovery Evaluation",
          "outline": [
            "Interpreting complex biomarkers: Advanced thyroid, iron, and cortisol patterns in postpartum",
            "Differentiating between 'Red Flags' (clinical referral) and 'Yellow Flags' (coaching intervention)",
            "The role of the L3 Coach in a multidisciplinary care team (OBGYN, PT, Psych)",
            "Advanced assessment tools for pelvic floor synergy and core functional integrity",
            "Longitudinal tracking: Measuring recovery progress over a 12-month trajectory"
          ]
        },
        {
          "number": 3,
          "title": "Neuro-Somatic Integration: Merging Body and Story",
          "outline": [
            "The intersection of Somatic Healing (S) and Emotional Processing (E) for trauma release",
            "Advanced vagus nerve stimulation techniques for postpartum nervous system regulation",
            "Processing birth trauma through a somatic lens: Moving story from the body to the mind",
            "Polyvagal Theory application: Coaching the client out of 'Freeze' and 'Fawn' maternal states",
            "Somatic tools for managing the physical manifestations of postpartum anxiety"
          ]
        },
        {
          "number": 4,
          "title": "Advanced Nutritional Bio-Individuality for Depletion Recovery",
          "outline": [
            "Customizing the 'Optimized Nutrition' pillar for complex pathologies (PCOS, Hashimoto's)",
            "The Gut-Brain-Breastmilk axis: Microbiome support for maternal mental health",
            "Micronutrient repletion strategies for chronic postpartum depletion (CPD)",
            "Targeted supplementation protocols for hormonal recalibration and adrenal support",
            "Nutritional strategies for supporting lactation while prioritizing maternal tissue repair"
          ]
        },
        {
          "number": 5,
          "title": "Identity Architecture: Navigating the Matrescence Transition",
          "outline": [
            "Deconstructing the 'Supermom' archetype and the 'Perfect Mother' mythos",
            "Values-based coaching: Realigning personal identity with the new maternal reality",
            "Career reintegration and professional boundary setting for the returning mother",
            "The psychological shift: Transitioning from 'Primary Caregiver' to 'Integrated Self'",
            "Navigating the grief of the 'Pre-Motherhood Self' to facilitate growth"
          ]
        },
        {
          "number": 6,
          "title": "Relational Systems: Building the Postpartum Village",
          "outline": [
            "Advanced communication frameworks for the family unit and co-parenting dynamics",
            "Navigating intimacy and sexual health shifts in the fourth trimester and beyond",
            "Conflict resolution strategies for managing 'unsolicited advice' and boundary violations",
            "Architecting a sustainable community support network: The 'Village' design",
            "Coaching the partner: Inclusion strategies for holistic family recovery"
          ]
        },
        {
          "number": 7,
          "title": "Master Case Conceptualization: The L3 Practitioner Lens",
          "outline": [
            "Developing a 12-month comprehensive recovery roadmap using the R.E.S.T.O.R.E. Method™",
            "Troubleshooting stalled progress: Identifying hidden barriers to physical or emotional healing",
            "Ethical boundaries in high-level coaching: Scope of practice and professional integrity",
            "Integrating clinical data with intuitive coaching to personalize client interventions",
            "Case Study Review: Analyzing complex recovery outcomes in high-stress environments"
          ]
        },
        {
          "number": 8,
          "title": "Empowered Matrescence: Long-term Thriving & Legacy",
          "outline": [
            "Transitioning the client from 'Recovery' to 'Thriving' and long-term wellness",
            "Establishing sustainable self-care as a non-negotiable standard for maternal health",
            "The coach as a leader: Contributing to the wider maternal health landscape and advocacy",
            "Finalizing the R.E.S.T.O.R.E. Master Plan: Ensuring long-term confidence and autonomy",
            "Building a legacy of health: The impact of a recovered mother on the family lineage"
          ]
        }
      ]
    },
    {
      "number": 30,
      "title": "L4: Building Your Practice",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Defining Your Niche and Value Proposition",
          "outline": [
            "Identifying your ideal postpartum client profile based on specific recovery needs",
            "Crafting a Unique Selling Proposition (USP) centered on the R.E.S.T.O.R.E. Method™",
            "Conducting market research to identify service gaps in your local and digital community",
            "Developing a brand voice that balances clinical expertise with maternal empathy",
            "Positioning yourself as a specialist in matrescence and long-term postpartum recovery"
          ]
        },
        {
          "number": 2,
          "title": "Legal Foundations and Scope of Practice",
          "outline": [
            "Defining the boundaries between coaching, therapy, and medical advice in a postpartum context",
            "Essential legal documents: Informed consent, coaching agreements, and liability waivers",
            "Navigating HIPAA compliance and data privacy for sensitive health and birth history data",
            "Professional liability insurance requirements for high-level recovery coaches",
            "Establishing clear referral protocols for clinical red flags identified during Recovery Evaluation"
          ]
        },
        {
          "number": 3,
          "title": "Designing R.E.S.T.O.R.E. Centered Coaching Packages",
          "outline": [
            "Structuring 12-week and 6-month intensive recovery programs",
            "Integrating the seven pillars of the R.E.S.T.O.R.E. Method™ into a logical session flow",
            "Value-based pricing strategies vs. hourly rates for specialized postpartum support",
            "Creating hybrid models: Combining 1-on-1 coaching with digital resources and toolkits",
            "Designing 'Transition Navigation' packages specifically for the return-to-work phase"
          ]
        },
        {
          "number": 4,
          "title": "Marketing for the Postpartum Professional",
          "outline": [
            "Content marketing strategies for 'Empowered Matrescence' and identity shifts",
            "Building an educational lead magnet (e.g., The Postpartum Nutrient Depletion Checklist)",
            "Social media ethics: Sharing birth stories and client testimonials responsibly",
            "Local SEO strategies for connecting with expectant parents in your geographic area",
            "Email marketing sequences that nurture clients from pregnancy through the fourth trimester"
          ]
        },
        {
          "number": 5,
          "title": "Strategic Partnerships and Referral Networks",
          "outline": [
            "Building professional alliances with OBGYNs, Midwives, and Pelvic Floor PTs",
            "Creating a 'Relational Support' directory of vetted local specialists for client referrals",
            "Pitching collaborative workshops to pediatric offices and birth centers",
            "Developing a reciprocal referral system that ensures a steady stream of qualified leads",
            "Networking with corporate HR departments for postpartum return-to-work coaching"
          ]
        },
        {
          "number": 6,
          "title": "Onboarding Systems and Client Management",
          "outline": [
            "The Discovery Call framework: Qualifying clients for the R.E.S.T.O.R.E. Method™",
            "Automating the 'Recovery Evaluation' intake process and initial assessment",
            "Selecting the right Practice Management Software (CRM) for coaching workflows",
            "Setting professional boundaries: Communication hours, response times, and emergency protocols",
            "Client retention strategies and offboarding into long-term 'Empowered Matrescence' plans"
          ]
        },
        {
          "number": 7,
          "title": "Financial Management and Scaling Your Practice",
          "outline": [
            "Budgeting for a specialized coaching practice: Overhead, marketing, and continuing education",
            "Revenue diversification: Incorporating group coaching and digital products",
            "Tracking Key Performance Indicators (KPIs) for business growth and client outcomes",
            "Scaling through 'The R.E.S.T.O.R.E. Method™' licensed workshops or retreats",
            "Time management for the coach: Balancing client hours with business development"
          ]
        },
        {
          "number": 8,
          "title": "Professional Sustainability and Coach Self-Care",
          "outline": [
            "Preventing compassion fatigue and secondary traumatic stress in birth-work",
            "Implementing the 'Somatic Healing' pillar for your own nervous system regulation",
            "The role of clinical supervision and peer support for postpartum coaches",
            "Creating a long-term professional development plan and advanced certifications",
            "Building a sustainable business model that honors your own family-life balance"
          ]
        }
      ]
    },
    {
      "number": 31,
      "title": "L4: Marketing & Client Acquisition",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Defining Your Postpartum Niche & Brand Identity",
          "outline": [
            "Identifying your 'Postpartum Avatar': From C-section recovery to high-achieving corporate mothers",
            "Integrating The R.E.S.T.O.R.E. Method™ into your Unique Value Proposition (UVP)",
            "The aesthetics of healing: Choosing brand colors and imagery that resonate with the postpartum nervous system",
            "Developing your 'Elevator Pitch' for sleep-deprived and overwhelmed potential clients",
            "Positioning yourself as an L4 Certified Specialist vs. a general postpartum doula"
          ]
        },
        {
          "number": 2,
          "title": "Ethical Marketing & The Psychology of the Postpartum Client",
          "outline": [
            "The ethics of marketing to vulnerable populations: Avoiding fear-based sales tactics",
            "Neuro-marketing for mothers: Understanding how 'mom-brain' affects information processing and decision making",
            "Building the 'Vulnerability Loop': Establishing trust through authentic storytelling and professional boundaries",
            "Consent-based marketing: Handling client testimonials and birth stories with clinical sensitivity",
            "Addressing the 'Invisible Load' in your marketing copy to demonstrate deep empathy"
          ]
        },
        {
          "number": 3,
          "title": "Content Strategy: Educating on Matrescence & Recovery",
          "outline": [
            "Creating content pillars based on the seven R.E.S.T.O.R.E. pillars",
            "Educational vs. Promotional content: The 80/20 rule for maternal health authorities",
            "Lead Magnet Development: Crafting 'Recovery Evaluation' checklists and 'Somatic Healing' guides",
            "SEO for Postpartum: Targeting high-intent keywords like 'postpartum depletion' and 'matrescence coaching'",
            "Using case studies to demonstrate the transition from 'Surviving' to 'Empowered Matrescence'"
          ]
        },
        {
          "number": 4,
          "title": "Referral Networks: Partnering with Clinical Providers",
          "outline": [
            "Identifying key stakeholders: OB-GYNs, Midwives, Pelvic Floor PTs, and IBCLCs",
            "The 'Professional One-Sheet': Designing a clinical-grade referral document for medical offices",
            "The Mutual Referral Protocol: How to ethically cross-refer while maintaining scope of practice",
            "Educational Lunch-and-Learns: Pitching your R.E.S.T.O.R.E. expertise to local birth centers",
            "Tracking referral ROI and maintaining long-term professional relationships"
          ]
        },
        {
          "number": 5,
          "title": "Social Media Mastery for Postpartum Coaches",
          "outline": [
            "Platform selection: Why Instagram and Pinterest dominate the maternal health market",
            "Visual storytelling for Somatic Healing (S): Using video to demonstrate regulation techniques",
            "Community Management: Building 'The Village' through private Facebook groups and community hubs",
            "Leveraging 'Micro-Influencers': Partnering with local sleep consultants and prenatal yoga instructors",
            "Managing the algorithm while maintaining the 'Slow Coaching' ethos of postpartum recovery"
          ]
        },
        {
          "number": 6,
          "title": "High-Conversion Discovery Calls for Postpartum Services",
          "outline": [
            "The 'Recovery Evaluation' (R) Sales Framework: Leading with assessment rather than a pitch",
            "Overcoming 'Mom-Guilt' and financial objections in the fourth trimester",
            "Active listening techniques for identifying Emotional Processing (E) needs during the call",
            "The 'Soft-Close' technique: Transitioning from empathetic listener to professional guide",
            "Post-call follow-up sequences that provide value without adding to the client's overwhelm"
          ]
        },
        {
          "number": 7,
          "title": "Packaging & Pricing Your R.E.S.T.O.R.E. Programs",
          "outline": [
            "Moving from hourly rates to high-value 'Fourth Trimester Intensive' packages",
            "Tiered service models: From digital self-paced guides to 1:1 concierge recovery coaching",
            "Communicating the ROI of postpartum coaching: Health outcomes, relationship stability, and career return",
            "Implementing 'Scholarship' seats or sliding scales ethically in a premium practice",
            "Contractual essentials: Scope of practice disclaimers and cancellation policies for new mothers"
          ]
        },
        {
          "number": 8,
          "title": "Scaling Your Practice: Workshops, Groups, and Automation",
          "outline": [
            "Transitioning to Group Coaching: Facilitating 'Relational Support' (R) in a cohort setting",
            "Corporate Postpartum Wellness: Pitching recovery coaching as a 'Return to Work' benefit",
            "Email Marketing Automation: Creating a 'Nurture Sequence' that follows the client's postpartum timeline",
            "Building an Alumni Program: Maintaining 'Empowered Matrescence' (E) beyond the first year",
            "Hiring and managing junior coaches to expand your R.E.S.T.O.R.E. Method™ impact"
          ]
        }
      ]
    },
    {
      "number": 32,
      "title": "L4: Business Operations",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Legal Foundations & Risk Management for Postpartum Coaches",
          "outline": [
            "Defining scope of practice: Distinguishing coaching from clinical therapy or medical midwifery in the R.E.S.T.O.R.E. framework",
            "Essential contract clauses: Liability waivers, refund policies, and emergency protocols for postpartum crises",
            "HIPAA and GDPR compliance: Managing sensitive health data related to 'Recovery Evaluation' and 'Emotional Processing'",
            "Professional liability insurance: Selecting the right coverage for somatic and nutritional coaching interventions",
            "Intellectual property: Protecting your unique application of the R.E.S.T.O.R.E. Method™ in your business materials"
          ]
        },
        {
          "number": 2,
          "title": "Client Lifecycle Management: From Intake to Graduation",
          "outline": [
            "The R.E.S.T.O.R.E. intake process: Designing comprehensive assessment forms for 'Recovery Evaluation'",
            "Onboarding workflows: Automating the transition from lead to active client to ensure professional first impressions",
            "Managing 'Transition Navigation': Setting clear boundaries and communication expectations during the 4th trimester",
            "The 'Empowered Matrescence' exit strategy: Offboarding clients with long-term growth plans and referral opportunities",
            "Systematizing client feedback: Using testimonials and case studies to refine operational excellence"
          ]
        },
        {
          "number": 3,
          "title": "Financial Infrastructure & Value-Based Pricing Models",
          "outline": [
            "Designing high-ticket postpartum packages: Pricing 'Optimized Nutrition' and 'Somatic Healing' as premium services",
            "Revenue stream diversification: Balancing 1:1 coaching, intensive 'Relational Support' workshops, and digital assets",
            "Financial tracking for the postpartum professional: Managing overhead, tax obligations, and profit margins",
            "Payment processing and billing: Implementing recurring payment plans for long-term matrescence support",
            "The 'Cost of Care' analysis: Evaluating the ROI of specialized recovery tools and client materials"
          ]
        },
        {
          "number": 4,
          "title": "Digital Tech Stack: Streamlining the Coaching Workflow",
          "outline": [
            "Practice management software: Comparing CRMs tailored for holistic and health-based coaching",
            "Telehealth security: Selecting secure video platforms for 'Emotional Processing' and virtual consultations",
            "Content delivery systems: Organizing 'Optimized Nutrition' guides and 'Somatic Healing' videos for client access",
            "Automation for efficiency: Using Zapier and scheduling tools to reduce administrative load",
            "Digital document storage: Maintaining organized records for 'Recovery Evaluation' tracking over time"
          ]
        },
        {
          "number": 5,
          "title": "Scaling the R.E.S.T.O.R.E. Method™: Group Programs & Memberships",
          "outline": [
            "Curriculum design for group coaching: Adapting 'Relational Support' frameworks for community-based cohorts",
            "Hybrid coaching models: Combining 1:1 'Somatic Healing' with automated 'Transition Navigation' modules",
            "Membership site architecture: Creating a sustainable 'Empowered Matrescence' community platform",
            "Quality control in scaling: Maintaining the integrity of the R.E.S.T.O.R.E. Method™ while serving larger volumes",
            "Launch strategies for postpartum programs: Timing and messaging for the maternal market"
          ]
        },
        {
          "number": 6,
          "title": "Professional Networking & Referral Ecosystems",
          "outline": [
            "Strategic alliances: Building referral bridges with OBGYNs, Midwives, and Pelvic Floor Therapists",
            "The 'Relational Support' network: Partnering with doulas and night nurses to provide holistic care",
            "Affiliate marketing ethics: Navigating commissions for postpartum products and nutritional supplements",
            "Public speaking and workshops: Positioning yourself as a Postpartum Recovery expert in local and digital communities",
            "B2B opportunities: Pitching postpartum recovery coaching as a corporate wellness benefit"
          ]
        },
        {
          "number": 7,
          "title": "Ethical Marketing & Brand Authority in Matrescence",
          "outline": [
            "Trauma-informed marketing: Crafting copy that honors 'Emotional Processing' without exploiting vulnerability",
            "Visual branding for the postpartum space: Communicating safety, expertise, and 'Somatic Healing' through design",
            "Content strategy: Using the R.E.S.T.O.R.E. Method™ pillars to drive educational and authoritative social media",
            "Email marketing for maternal health: Nurturing leads through the stages of pregnancy and early postpartum",
            "SEO for the recovery coach: Optimizing for keywords related to 'Postpartum Recovery' and 'Matrescence'"
          ]
        },
        {
          "number": 8,
          "title": "Sustainable Growth: Operational Wellness for the Coach",
          "outline": [
            "Preventing compassion fatigue: Applying 'Somatic Healing' and nervous system regulation to your own business life",
            "Time blocking and boundary setting: Managing the 'always-on' nature of postpartum support",
            "Outsourcing and team building: Identifying when to hire virtual assistants or junior R.E.S.T.O.R.E. coaches",
            "The Annual Business Audit: Evaluating business health through the lens of 'Empowered Matrescence'",
            "Long-term visioning: Scaling your impact while maintaining personal and professional alignment"
          ]
        }
      ]
    },
    {
      "number": 33,
      "title": "L4: Legal & Compliance",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Defining Professional Scope of Practice & Medical Boundaries",
          "outline": [
            "Distinguishing between coaching, therapy, and medical care within the postpartum context.",
            "Safe harbor language for the 'Recovery Evaluation' (R) phase to avoid unlicensed medical practice.",
            "Legal implications of 'prescribing' vs. 'suggesting' in 'Optimized Nutrition' (O).",
            "Identifying clinical 'Red Flags' that necessitate immediate mandatory referral to licensed providers.",
            "Developing a 'Scope of Practice' statement for your professional website and marketing materials."
          ]
        },
        {
          "number": 2,
          "title": "Ironclad Client Contracts & Service Agreements",
          "outline": [
            "Essential legal clauses: Informed Consent, Liability Waivers, and Assumption of Risk.",
            "Defining the duration and boundaries of the 'Empowered Matrescence' (E) phase in legal terms.",
            "Structuring refund policies, late fees, and termination clauses for sleep-deprived clientele.",
            "The legality of digital signatures and maintaining an audit trail of signed agreements.",
            "Customizing contracts for group coaching vs. 1-on-1 intensive recovery support."
          ]
        },
        {
          "number": 3,
          "title": "Data Privacy, HIPAA, and Confidentiality Standards",
          "outline": [
            "Determining 'Covered Entity' status and navigating HIPAA compliance for non-licensed coaches.",
            "Secure storage protocols for sensitive 'Emotional Processing' (E) notes and birth story data.",
            "Implementing encrypted communication tools for 'Relational Support' (R) check-ins.",
            "Legal requirements for client testimonials, case studies, and the use of 'Before/After' imagery.",
            "Developing a Data Breach Response Plan and privacy policy for digital platforms."
          ]
        },
        {
          "number": 4,
          "title": "Professional Liability Insurance & Risk Mitigation",
          "outline": [
            "Comparing General Liability vs. Professional Liability (Errors & Omissions) for postpartum coaches.",
            "Ensuring coverage for 'Somatic Healing' (S) techniques and body-based nervous system regulation.",
            "Risk management through meticulous documentation of the RESTORE Method™ application.",
            "Understanding 'Occurrence' vs. 'Claims-Made' policies and tail coverage requirements.",
            "How to handle an incident report or a formal complaint from a client or family member."
          ]
        },
        {
          "number": 5,
          "title": "Mandated Reporting & Crisis Intervention Protocols",
          "outline": [
            "Legal obligations regarding Postpartum Depression (PPD), Anxiety (PPA), and Psychosis (PPP).",
            "State and regional requirements for reporting suspected child abuse, neglect, or self-harm.",
            "Establishing a 'Crisis Referral Network' as part of the 'Relational Support' (R) framework.",
            "Ethical and legal boundaries when navigating domestic issues or partner conflict during 'Transition Navigation' (T).",
            "Documenting high-risk interactions to protect both the client and the coach's license."
          ]
        },
        {
          "number": 6,
          "title": "Protecting Intellectual Property & Brand Assets",
          "outline": [
            "Legal guidelines for using 'The R.E.S.T.O.R.E. Method™' trademarks and certification marks.",
            "Copyrighting original postpartum guides, nutritional protocols, and somatic exercise videos.",
            "Utilizing Non-Disclosure Agreements (NDAs) when hiring contractors or virtual assistants.",
            "Cease and Desist protocols for addressing content theft or brand infringement in the coaching space.",
            "Structuring licensing agreements if scaling your recovery framework to other practitioners."
          ]
        },
        {
          "number": 7,
          "title": "Regulatory Compliance for Virtual & Global Coaching",
          "outline": [
            "Navigating cross-border legalities and state-specific coaching legislation in the US and abroad.",
            "GDPR compliance for European clients and international data portability requirements.",
            "Tax nexus and sales tax implications for digital products and virtual coaching services.",
            "Drafting 'Terms of Use' for online membership communities and postpartum support forums.",
            "Understanding the 'Corporate Transparency Act' and its impact on small coaching businesses."
          ]
        },
        {
          "number": 8,
          "title": "Ethical Standards & The ASI Code of Conduct",
          "outline": [
            "Adhering to the AccrediPro Standards Institute (ASI) ethical guidelines for L4 practitioners.",
            "Managing dual relationships and professional boundaries during 'Transition Navigation' (T).",
            "Disclosure requirements for affiliate links, referral kickbacks, and nutritional supplement endorsements.",
            "Continuing Education (CEU) requirements for maintaining professional standing and L4 certification.",
            "The role of professional supervision and peer review in maintaining high-level compliance."
          ]
        }
      ]
    },
    {
      "number": 34,
      "title": "L4: Group Programs & Workshops",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Psychology of Group Healing in Postpartum",
          "outline": [
            "The concept of 'Common Humanity' and its role in reducing postpartum shame and isolation.",
            "How group dynamics accelerate 'Emotional Processing' (E) through collective witnessing.",
            "The neurological benefits of social safety and co-regulation in a group setting.",
            "Defining the coach's role: Transitioning from expert-led to facilitator-led dynamics.",
            "Research on group-based interventions for improving maternal mental health outcomes."
          ]
        },
        {
          "number": 2,
          "title": "Curriculum Design: The R.E.S.T.O.R.E. Group Framework",
          "outline": [
            "Mapping the 7 pillars of the R.E.S.T.O.R.E. Method™ into an 8-12 week group curriculum.",
            "Creating progressive 'Somatic Healing' (S) rituals designed for group participation.",
            "Integrating 'Optimized Nutrition' (O) through group meal-prep challenges and shared resources.",
            "Structuring 'Recovery Evaluation' (R) checkpoints at the start, middle, and end of the program.",
            "Designing weekly themes that guide participants toward 'Empowered Matrescence' (E)."
          ]
        },
        {
          "number": 3,
          "title": "Advanced Facilitation Skills for Postpartum Coaches",
          "outline": [
            "Techniques for holding space during intense 'Emotional Processing' (E) without trauma-dumping.",
            "Managing group energy: Grounding exercises for a dysregulated or anxious room.",
            "Navigating conflict and 'dominant voices' to ensure equitable participation for all mothers.",
            "The art of the 'Powerful Question' in a group context to trigger peer-to-peer coaching.",
            "Establishing group containers: Rules of engagement, confidentiality, and mutual respect."
          ]
        },
        {
          "number": 4,
          "title": "High-Impact Workshop Models & Themes",
          "outline": [
            "Designing a 'Birth Story Integration' workshop focused on 'Emotional Processing' (E).",
            "Developing 'Relational Support' (R) workshops specifically for couples and partners.",
            "The 'Return-to-Work' intensive: A 'Transition Navigation' (T) workshop for career-focused mothers.",
            "Logistics of 'Somatic Healing' (S) workshops: In-person vs. virtual movement considerations.",
            "Creating 'Mini-Workshops' as lead magnets for high-ticket L4 group programs."
          ]
        },
        {
          "number": 5,
          "title": "Hybrid Coaching: Scaling with Technology & Community",
          "outline": [
            "The 'Hub and Spoke' model: Combining pre-recorded R.E.S.T.O.R.E. lessons with live coaching.",
            "Selecting the right community platform to foster ongoing 'Relational Support' (R).",
            "Automating the 'Recovery Evaluation' (R) intake process for large group cohorts.",
            "Tiered access strategies: Balancing group coaching with VIP 1:1 'add-on' sessions.",
            "Maintaining the 'High-Touch' feel of L4 coaching in a scalable digital environment."
          ]
        },
        {
          "number": 6,
          "title": "Marketing & Launching Your Premium Group Program",
          "outline": [
            "Identifying your 'Niche-within-a-Niche' for group success (e.g., Postpartum for Executive Moms).",
            "Messaging the 'Group Advantage': Why collective healing is superior for certain matrescence stages.",
            "Pricing strategies for L4: Setting premium rates for high-value group transformations.",
            "The 4-week launch runway: From 'Transition Navigation' (T) awareness to enrollment.",
            "Utilizing 'Recovery Evaluation' (R) data and testimonials to prove program efficacy."
          ]
        },
        {
          "number": 7,
          "title": "Measuring Group Outcomes & ROI",
          "outline": [
            "Implementing standardized pre- and post-program assessments using RESTORE markers.",
            "Tracking group 'Somatic Healing' (S) progress through self-reported nervous system regulation scores.",
            "Analyzing 'Transition Navigation' (T) success rates and identity shift milestones.",
            "Using participant feedback loops to refine the curriculum for future cohorts.",
            "Reporting ROI (Return on Investment) for corporate-sponsored postpartum workshops."
          ]
        },
        {
          "number": 8,
          "title": "Ethics, Boundaries, & Safety in Group Settings",
          "outline": [
            "Screening protocols: Identifying participants who require 1:1 clinical therapy vs. group coaching.",
            "Managing high-risk disclosures (PPD/PPA/Psychosis) within a group environment.",
            "The legalities of 'Scope of Practice' when facilitating group 'Emotional Processing' (E).",
            "Maintaining professional boundaries: Avoiding 'friendship' traps in peer-support models.",
            "Crisis intervention protocols and referral networks for group facilitators."
          ]
        }
      ]
    },
    {
      "number": 35,
      "title": "L4: Scaling & Growth",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Transitioning from 1:1 to Group Coaching Models",
          "outline": [
            "Designing curriculum-based group programs using the R.E.S.T.O.R.E. Method™ phases",
            "Managing group dynamics and psychological safety in a postpartum setting",
            "Pricing strategies and financial modeling for scalable group recovery cohorts",
            "Tech stack requirements for hosting and managing high-engagement group programs",
            "Balancing individualized Recovery Evaluation (R) with group-based delivery"
          ]
        },
        {
          "number": 2,
          "title": "Leveraging the R.E.S.T.O.R.E. Method™ Content Ecosystem",
          "outline": [
            "Creating a multi-tier content strategy: Free, Mid-tier, and High-ticket offers",
            "Developing 'Signature Series' workshops based on specific method pillars (e.g., Somatic Healing Masterclass)",
            "Using the methodology to drive SEO and authority-building content marketing",
            "Automating the educational components of Recovery Evaluation (R) to save coaching hours",
            "Repurposing coaching insights into evergreen digital assets"
          ]
        },
        {
          "number": 3,
          "title": "Building and Managing a Postpartum Coaching Agency",
          "outline": [
            "Recruiting and vetting associate coaches aligned with R.E.S.T.O.R.E. core values",
            "Standardizing quality control and client experience (CX) across a diverse coaching team",
            "Legal and financial structures for agency-style business models in the wellness space",
            "The shift from Practitioner to CEO: Managing a team of recovery specialists",
            "Implementing a 'Lead Coach' system to maintain high-touch support during growth"
          ]
        },
        {
          "number": 4,
          "title": "Digital Product Suites: Beyond Active Coaching",
          "outline": [
            "Developing self-paced recovery guides and digital workbooks for global reach",
            "Building subscription-based 'Postpartum Maintenance' memberships for long-term support",
            "Creating 'Coach-in-a-Box' toolkits for specific Transition Navigations (T)",
            "Marketing funnels for low-touch, high-impact digital recovery assets",
            "Validating product-market fit for digital postpartum tools"
          ]
        },
        {
          "number": 5,
          "title": "Scaling Impact through Corporate Wellness & B2B",
          "outline": [
            "Pitching postpartum recovery services to HR departments and insurance providers",
            "Designing 'Return-to-Work' recovery packages for corporate maternal benefits",
            "Quantifying the ROI of postpartum support for employee retention and productivity",
            "Navigating B2B contracts, service level agreements (SLAs), and corporate compliance",
            "Scaling the Relational Support (R) pillar for professional environments"
          ]
        },
        {
          "number": 6,
          "title": "High-Ticket Immersions and Postpartum Retreats",
          "outline": [
            "Curating luxury recovery experiences focusing on Somatic Healing (S) and Emotional Processing (E)",
            "Logistics of high-end retreats: Staffing, medical safety, and childcare considerations",
            "Psychological benefits of immersive 'deep work' environments for new mothers",
            "Sales and application processes for premium, high-ticket recovery immersions",
            "Integrating the full R.E.S.T.O.R.E. framework into a 3-5 day intensive format"
          ]
        },
        {
          "number": 7,
          "title": "Advanced Systems: Automating the R.E.S.T.O.R.E. Journey",
          "outline": [
            "Implementing advanced CRM systems to track long-term maternal thriving (E) markers",
            "Automating data collection for Recovery Evaluations (R) and client progress reports",
            "Using AI and automation to personalize client communication without losing the 'human touch'",
            "Scaling intake and onboarding systems for high-volume practice management",
            "Data-driven decision making: Using client outcomes to fuel business growth"
          ]
        },
        {
          "number": 8,
          "title": "The CEO Mindset: Sustainable Growth and Longevity",
          "outline": [
            "Navigating the identity shift from 'Service Provider' to 'Business Visionary'",
            "Burnout prevention strategies for scaling in a high-empathy, high-intensity industry",
            "Succession planning and the long-term vision of the R.E.S.T.O.R.E. Method™ legacy",
            "Measuring success beyond revenue: Impact, reach, and maternal health outcomes",
            "Cultivating Empowered Matrescence (E) within your own professional journey"
          ]
        }
      ]
    },
    {
      "number": 36,
      "title": "L4: Certification & Final Review",
      "tier": "L4",
      "has_quiz": false,
      "lessons": [
        {
          "number": 1,
          "title": "Mastering the R.E.S.T.O.R.E. Method™ Framework",
          "outline": [
            "Holistic integration of the seven pillars to create individualized, high-tier recovery plans.",
            "Identifying cross-pillar synergies: How Somatic Healing (S) accelerates Emotional Processing (E).",
            "Adapting the framework for diverse family structures, cultural contexts, and high-risk recovery scenarios.",
            "Advanced application of the Recovery Evaluation (R) tools for long-term progress tracking.",
            "The 'Recovery Architect' mindset: Moving from tactical coaching to strategic maternal advocacy."
          ]
        },
        {
          "number": 2,
          "title": "High-Stakes Case Management & Clinical Reasoning",
          "outline": [
            "Navigating complex postpartum presentations including multi-fetal births and NICU-related trauma.",
            "Advanced clinical decision-making: Determining when to pivot strategies within the RESTORE Method.",
            "Documenting outcomes and measuring the statistical efficacy of coaching interventions.",
            "Case analysis: Identifying subtle markers of depletion in the Optimized Nutrition (O) and Relational Support (R) phases.",
            "Analyzing long-term maternal thriving markers (Empowered Matrescence) post-intervention."
          ]
        },
        {
          "number": 3,
          "title": "Ethical Standards and Legal Scope of Practice",
          "outline": [
            "Defining the precise boundaries between coaching, psychotherapy, and medical advice in postpartum care.",
            "Mandatory reporting requirements and identifying 'Red Flag' clinical symptoms requiring immediate referral.",
            "Professional liability, informed consent, and data privacy (HIPAA/GDPR) for the independent coach.",
            "Maintaining professional integrity and the ethics of 'self-care' for the practitioner to prevent secondary trauma.",
            "Navigating the 'gray areas' of maternal health advocacy within a medicalized birth culture."
          ]
        },
        {
          "number": 4,
          "title": "The L4 Certification Practicum: Portfolio Development",
          "outline": [
            "Comprehensive breakdown of the final case study submission requirements and grading rubric.",
            "Demonstrating mastery of the 'Transition Navigation' (T) pillar through identity-shift coaching logs.",
            "Evidence-based rationale: Connecting every coaching intervention to peer-reviewed maternal health research.",
            "Structuring the 'Empowered Matrescence' (E) final plan for a mock client to demonstrate long-term vision.",
            "Peer review protocols and the importance of professional supervision in the certification process."
          ]
        },
        {
          "number": 5,
          "title": "Advanced Communication & Relational Support (R)",
          "outline": [
            "Facilitating high-tension conversations within the family unit and navigating partner dynamics.",
            "Conflict resolution strategies for the 'Transition Navigation' phase of early parenthood.",
            "Coaching the support system: Targeted strategies for empowering partners and extended family members.",
            "Using the RESTORE Method to bridge communication gaps between clients and their primary medical providers.",
            "The art of the 'Discovery Call': Communicating the value of L4-tier recovery coaching to prospective clients."
          ]
        },
        {
          "number": 6,
          "title": "Business Mastery for the Postpartum Professional",
          "outline": [
            "Designing high-value, multi-month coaching packages based on the full RESTORE framework.",
            "Marketing ethics: Communicating recovery outcomes without making unsubstantiated medical claims.",
            "Client retention and the transition from acute postpartum recovery to long-term wellness coaching.",
            "Operational scaling: Evaluating group coaching models versus 1-on-1 intensive recovery programs.",
            "Financial sustainability and professional positioning as a premium Certified Postpartum Recovery Coach™."
          ]
        },
        {
          "number": 7,
          "title": "Integrative Collaboration & The Referral Network",
          "outline": [
            "Identifying and vetting a 'Gold Standard' referral network (Pelvic Floor PTs, IBCLCs, PMH-C therapists).",
            "Professional networking: Positioning the coach as the 'Recovery Lead' within a multidisciplinary care team.",
            "Collaborative care plans: Best practices for working alongside OB/GYNs, midwives, and doulas.",
            "Community leadership: Building local and digital advocacy groups for postpartum health awareness.",
            "The role of the L4 coach in changing systemic postpartum care standards."
          ]
        },
        {
          "number": 8,
          "title": "Comprehensive Final Review & Examination Prep",
          "outline": [
            "Synthesis of key physiological and psychological milestones in the first 12 months postpartum.",
            "Final review of the R.E.S.T.O.R.E. Method™ core competencies and assessment tools.",
            "Examination strategy: Analyzing complex multiple-choice scenarios and essay requirements.",
            "The path forward: Maintaining the Certified Postpartum Recovery Coach™ credential and continuing education.",
            "Closing the loop: From student to expert practitioner in the field of maternal recovery."
          ]
        }
      ]
    }
  ]
}