{
  "course_name": "Certified Naturopathic Practitioner™",
  "niche": "default",
  "total_reviews": 54,
  "average_rating": 4.54,
  "distribution": {
    "5_star": 35,
    "4_star": 13,
    "3_star": 6,
    "2_star": 0,
    "1_star": 0
  },
  "reviews": [
    {
      "id": "rev_045",
      "user_id": "user_045",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from general wellness coaching to Default, and this course gave me the exact framework I needed. The client onboarding module alone was worth the investment. Now I have 7 new clients and finally feel confident in my niche.",
      "date": "2026-01-17",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_053",
      "user_id": "user_053",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Decent course. The the assessment section module was fantastic, but the marketing section didn't deliver as much value. Wanted more interactive elements. Still learned enough to justify the cost, but room for improvement.",
      "date": "2025-12-20",
      "verified_purchase": true,
      "helpful_count": 42
    },
    {
      "id": "rev_009",
      "user_id": "user_009",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "The depth of research behind this curriculum is impressive. Every claim backed by academic sources, which builds massive credibility with clients. The intake protocol has become my go-to for intake sessions. Thoroughly evidence-based.",
      "date": "2025-12-16",
      "verified_purchase": true,
      "helpful_count": 22
    },
    {
      "id": "rev_044",
      "user_id": "user_044",
      "rating": 4,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from traditional therapy to Default, and this course gave me the exact framework I needed. The ethical boundaries module alone was worth the investment. Now I have 11 new clients and finally feel confident in my niche.",
      "date": "2025-12-13",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_046",
      "user_id": "user_046",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "I've taken 9 courses in this field, but this one stands out. The practical focus on outcome measurement helped me pivot my entire business model. Within 6 weeks I had built a waitlist. The community support was incredible too.",
      "date": "2025-11-22",
      "verified_purchase": true,
      "helpful_count": 10
    },
    {
      "id": "rev_034",
      "user_id": "user_034",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "The depth of research behind this curriculum is impressive. Every claim backed by academic sources, which builds massive credibility with clients. The intake protocol has become my go-to for intake sessions. Thoroughly evidence-based.",
      "date": "2025-11-05",
      "verified_purchase": true,
      "helpful_count": 7
    },
    {
      "id": "rev_014",
      "user_id": "user_014",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied intake assessment with my first client post-certification. Revenue up 130% in 6 weeks. Worth every penny.",
      "date": "2025-10-19",
      "verified_purchase": true,
      "helpful_count": 40
    },
    {
      "id": "rev_040",
      "user_id": "user_040",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from teaching to Default, and this course gave me the exact framework I needed. The assessment framework module alone was worth the investment. Now I have 11 new clients and finally feel confident in my niche.",
      "date": "2025-10-18",
      "verified_purchase": true,
      "helpful_count": 35
    },
    {
      "id": "rev_033",
      "user_id": "user_033",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "The business-building modules were pure gold. Implemented the value ladder and saw 47% revenue increase in 90 days. Finally feel like a legitimate professional in the default space.",
      "date": "2025-10-15",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_015",
      "user_id": "user_015",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied intake assessment with my first client post-certification. Revenue up 71% in 2 months. Worth every penny.",
      "date": "2025-10-13",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_039",
      "user_id": "user_039",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "I've taken 12 courses in this field, but this one stands out. The practical focus on outcome measurement helped me pivot my entire business model. Within 3 months I had launched group programs. The community support was incredible too.",
      "date": "2025-10-07",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_042",
      "user_id": "user_042",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "I've taken 8 courses in this field, but this one stands out. The practical focus on session structure helped me pivot my entire business model. Within 3 months I had launched group programs. The community support was incredible too.",
      "date": "2025-09-22",
      "verified_purchase": true,
      "helpful_count": 15
    },
    {
      "id": "rev_019",
      "user_id": "user_019",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from traditional therapy to Default, and this course gave me the exact framework I needed. The advanced protocols module alone was worth the investment. Now I have 11 new clients and finally feel confident in my niche.",
      "date": "2025-09-19",
      "verified_purchase": true,
      "helpful_count": 43
    },
    {
      "id": "rev_018",
      "user_id": "user_018",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The instructor support was exceptional. Sarah personally answered my question about setting boundaries within the same day. The private Facebook group helped me troubleshoot real client scenarios. Never felt alone in the learning process.",
      "date": "2025-09-09",
      "verified_purchase": true,
      "helpful_count": 26
    },
    {
      "id": "rev_020",
      "user_id": "user_020",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "Finally, a certification that respects your intelligence. The theoretical framework section gave me the conceptual foundation I was missing from my undergraduate studies. Now I can confidently explain systems theory to clients and colleagues.",
      "date": "2025-09-05",
      "verified_purchase": true,
      "helpful_count": 24
    },
    {
      "id": "rev_054",
      "user_id": "user_054",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Solid content overall, but I wish there was more on group coaching. The the ethics module module felt rushed compared to others. Still valuable, just expected more depth given the price point. Would recommend, but set expectations accordingly.",
      "date": "2025-08-26",
      "verified_purchase": true,
      "helpful_count": 12
    },
    {
      "id": "rev_043",
      "user_id": "user_043",
      "rating": 4,
      "focus_type": "support",
      "review_text": "I've taken 8 courses in this field, but this one stands out. The practical focus on ethical practice helped me pivot my entire business model. Within 3 months I had built a waitlist. The community support was incredible too.",
      "date": "2025-08-07",
      "verified_purchase": true,
      "helpful_count": 36
    },
    {
      "id": "rev_017",
      "user_id": "user_017",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "Finally, a certification that respects your intelligence. The research foundation section gave me the conceptual foundation I was missing from my previous training. Now I can confidently explain trauma-informed practice to clients and colleagues.",
      "date": "2025-08-02",
      "verified_purchase": true,
      "helpful_count": 36
    },
    {
      "id": "rev_028",
      "user_id": "user_028",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "I've taken 14 courses in this field, but this one stands out. The practical focus on outcome measurement helped me pivot my entire business model. Within 2 months I had filled my calendar. The community support was incredible too.",
      "date": "2025-07-20",
      "verified_purchase": true,
      "helpful_count": 2
    },
    {
      "id": "rev_012",
      "user_id": "user_012",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from general wellness coaching to Default, and this course gave me the exact framework I needed. The client onboarding module alone was worth the investment. Now I have 7 new clients and finally feel confident in my niche.",
      "date": "2025-07-15",
      "verified_purchase": true,
      "helpful_count": 7
    },
    {
      "id": "rev_052",
      "user_id": "user_052",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Solid content overall, but I wish there was more on group coaching. The Module 3 module felt rushed compared to others. Still valuable, just expected more depth given the price point. Would recommend, but set expectations accordingly.",
      "date": "2025-07-15",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_025",
      "user_id": "user_025",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the assessment forms templates alone saved me 37 hours of work. Closed 13 new clients in 3 months using the pitch framework from Module 5. Already made back 5x my investment.",
      "date": "2025-06-22",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_024",
      "user_id": "user_024",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied goal-setting framework with my first client post-certification. Revenue up 77% in 90 days. Worth every penny.",
      "date": "2025-06-20",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_027",
      "user_id": "user_027",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The practical focus made complex topics accessible, and I immediately applied intake assessment with my first client post-certification. Revenue up 60% in 3 months. Worth every penny.",
      "date": "2025-06-09",
      "verified_purchase": true,
      "helpful_count": 43
    },
    {
      "id": "rev_030",
      "user_id": "user_030",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the assessment forms templates alone saved me 13 hours of work. Closed 4 new clients in 90 days using the pitch framework from the ethics module. Already made back 3x my investment.",
      "date": "2025-05-23",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_021",
      "user_id": "user_021",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from teaching to Default, and this course gave me the exact framework I needed. The ethical boundaries module alone was worth the investment. Now I have 6 new clients and finally feel confident in my niche.",
      "date": "2025-05-14",
      "verified_purchase": true,
      "helpful_count": 17
    },
    {
      "id": "rev_048",
      "user_id": "user_048",
      "rating": 4,
      "focus_type": "knowledge_depth",
      "review_text": "Best professional investment I've made in years. The step-by-step breakdown made complex topics accessible, and I immediately applied intake assessment with my first client post-certification. Revenue up 127% in 3 months. Worth every penny.",
      "date": "2025-05-11",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_041",
      "user_id": "user_041",
      "rating": 4,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from traditional therapy to Default, and this course gave me the exact framework I needed. The client onboarding module alone was worth the investment. Now I have 9 new clients and finally feel confident in my niche.",
      "date": "2025-04-29",
      "verified_purchase": true,
      "helpful_count": 28
    },
    {
      "id": "rev_011",
      "user_id": "user_011",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "The business-building modules were pure gold. Implemented the niche positioning and saw 67% revenue increase in 2 months. Finally feel like a legitimate professional in the default space.",
      "date": "2025-04-17",
      "verified_purchase": true,
      "helpful_count": 40
    },
    {
      "id": "rev_004",
      "user_id": "user_004",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the marketing scripts templates alone saved me 39 hours of work. Closed 14 new clients in 2 months using the pitch framework from Module 5. Already made back 4x my investment.",
      "date": "2025-04-11",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_016",
      "user_id": "user_016",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "The depth of research behind this curriculum is impressive. Every claim backed by academic sources, which builds massive credibility with clients. The diagnostic framework has become my go-to for intake sessions. Thoroughly evidence-based.",
      "date": "2025-03-29",
      "verified_purchase": true,
      "helpful_count": 27
    },
    {
      "id": "rev_026",
      "user_id": "user_026",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The video demonstrations made all the difference. I learn best by reading and reflecting, and the course accommodated that perfectly. The video demonstrations helped me finally understand boundary setting.",
      "date": "2025-03-24",
      "verified_purchase": true,
      "helpful_count": 27
    },
    {
      "id": "rev_010",
      "user_id": "user_010",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "I've taken 12 courses in this field, but this one stands out. The practical focus on session structure helped me pivot my entire business model. Within 3 months I had built a waitlist. The community support was incredible too.",
      "date": "2025-03-16",
      "verified_purchase": true,
      "helpful_count": 39
    },
    {
      "id": "rev_003",
      "user_id": "user_003",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "Finally, a certification that respects your intelligence. The conceptual model section gave me the conceptual foundation I was missing from my previous training. Now I can confidently explain systems theory to clients and colleagues.",
      "date": "2025-03-11",
      "verified_purchase": true,
      "helpful_count": 24
    },
    {
      "id": "rev_029",
      "user_id": "user_029",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The step-by-step breakdown made complex topics accessible, and I immediately applied goal-setting framework with my first client post-certification. Revenue up 54% in 3 months. Worth every penny.",
      "date": "2025-03-08",
      "verified_purchase": true,
      "helpful_count": 23
    },
    {
      "id": "rev_051",
      "user_id": "user_051",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Decent course. The Module 2 module was fantastic, but the practice building didn't deliver as much value. Wanted more interactive elements. Still learned enough to justify the cost, but room for improvement.",
      "date": "2025-02-22",
      "verified_purchase": true,
      "helpful_count": 14
    },
    {
      "id": "rev_035",
      "user_id": "user_035",
      "rating": 5,
      "focus_type": "constructive",
      "review_text": "Best professional investment I've made in years. The clear explanations made complex topics accessible, and I immediately applied goal-setting framework with my first client post-certification. Revenue up 117% in 90 days. Worth every penny.",
      "date": "2025-01-25",
      "verified_purchase": true,
      "helpful_count": 45
    },
    {
      "id": "rev_037",
      "user_id": "user_037",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from traditional therapy to Default, and this course gave me the exact framework I needed. The advanced protocols module alone was worth the investment. Now I have 9 new clients and finally feel confident in my niche.",
      "date": "2025-01-13",
      "verified_purchase": true,
      "helpful_count": 9
    },
    {
      "id": "rev_002",
      "user_id": "user_002",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied progress tracker with my first client post-certification. Revenue up 147% in 90 days. Worth every penny.",
      "date": "2024-12-21",
      "verified_purchase": true,
      "helpful_count": 30
    },
    {
      "id": "rev_031",
      "user_id": "user_031",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from traditional therapy to Default, and this course gave me the exact framework I needed. The client onboarding module alone was worth the investment. Now I have 7 new clients and finally feel confident in my niche.",
      "date": "2024-12-02",
      "verified_purchase": true,
      "helpful_count": 20
    },
    {
      "id": "rev_032",
      "user_id": "user_032",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from general wellness coaching to Default, and this course gave me the exact framework I needed. The client onboarding module alone was worth the investment. Now I have 12 new clients and finally feel confident in my niche.",
      "date": "2024-12-01",
      "verified_purchase": true,
      "helpful_count": 25
    },
    {
      "id": "rev_022",
      "user_id": "user_022",
      "rating": 5,
      "focus_type": "constructive",
      "review_text": "Best professional investment I've made in years. The clear explanations made complex topics accessible, and I immediately applied goal-setting framework with my first client post-certification. Revenue up 120% in 90 days. Worth every penny.",
      "date": "2024-11-22",
      "verified_purchase": true,
      "helpful_count": 11
    },
    {
      "id": "rev_050",
      "user_id": "user_050",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Solid content overall, but I wish there was more on group coaching. The the assessment section module felt rushed compared to others. Still valuable, just expected more depth given the price point. Would recommend, but set expectations accordingly.",
      "date": "2024-11-18",
      "verified_purchase": true,
      "helpful_count": 20
    },
    {
      "id": "rev_006",
      "user_id": "user_006",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "The business-building modules were pure gold. Implemented the value ladder and saw 74% revenue increase in 2 months. Finally feel like a legitimate professional in the default space.",
      "date": "2024-11-15",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_008",
      "user_id": "user_008",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The instructor support was exceptional. the instructor personally answered my question about handling resistance within 24 hours. The live Q&A sessions helped me troubleshoot real client scenarios. Never felt alone in the learning process.",
      "date": "2024-11-02",
      "verified_purchase": true,
      "helpful_count": 15
    },
    {
      "id": "rev_036",
      "user_id": "user_036",
      "rating": 4,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from traditional therapy to Default, and this course gave me the exact framework I needed. The assessment framework module alone was worth the investment. Now I have 6 new clients and finally feel confident in my niche.",
      "date": "2024-10-18",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_013",
      "user_id": "user_013",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The instructor support was exceptional. the instructor personally answered my question about handling resistance within a few hours. The study group helped me troubleshoot real client scenarios. Never felt alone in the learning process.",
      "date": "2024-09-28",
      "verified_purchase": true,
      "helpful_count": 19
    },
    {
      "id": "rev_001",
      "user_id": "user_001",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the marketing scripts templates alone saved me 15 hours of work. Closed 9 new clients in 2 months using the pitch framework from the assessment section. Already made back 3x my investment.",
      "date": "2024-09-11",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_049",
      "user_id": "user_049",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Decent course. The the assessment section module was fantastic, but the practice building didn't deliver as much value. Some videos felt too long. Still learned enough to justify the cost, but room for improvement.",
      "date": "2024-09-08",
      "verified_purchase": true,
      "helpful_count": 36
    },
    {
      "id": "rev_007",
      "user_id": "user_007",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "The business-building modules were pure gold. Implemented the consultation funnel and saw 96% revenue increase in 90 days. Finally feel like a legitimate professional in the default space.",
      "date": "2024-09-05",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_023",
      "user_id": "user_023",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the client handouts templates alone saved me 12 hours of work. Closed 6 new clients in 2 months using the pitch framework from the ethics module. Already made back 3x my investment.",
      "date": "2024-08-31",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_047",
      "user_id": "user_047",
      "rating": 4,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from traditional therapy to Default, and this course gave me the exact framework I needed. The ethical boundaries module alone was worth the investment. Now I have 10 new clients and finally feel confident in my niche.",
      "date": "2024-08-21",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_038",
      "user_id": "user_038",
      "rating": 4,
      "focus_type": "support",
      "review_text": "Best professional investment I've made in years. The step-by-step breakdown made complex topics accessible, and I immediately applied progress tracker with my first client post-certification. Revenue up 34% in 90 days. Worth every penny.",
      "date": "2024-08-20",
      "verified_purchase": true,
      "helpful_count": 10
    },
    {
      "id": "rev_005",
      "user_id": "user_005",
      "rating": 5,
      "focus_type": "constructive",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from teaching to Default, and this course gave me the exact framework I needed. The ethical boundaries module alone was worth the investment. Now I have 3 new clients and finally feel confident in my niche.",
      "date": "2024-07-29",
      "verified_purchase": true,
      "helpful_count": 11
    }
  ],
  "zombie_profiles": [
    {
      "name": "Anthony A. Mitchell",
      "location": "New York, NY",
      "occupation": "Holistic Practitioner",
      "profile_photo": "avatar_08.jpg",
      "member_since": "2022-03",
      "courses_completed": 1,
      "total_reviews": 7
    },
    {
      "name": "Amanda Martinez",
      "location": "Wichita, KS",
      "occupation": "Therapist",
      "profile_photo": "avatar_15.jpg",
      "member_since": "2022-07",
      "courses_completed": 1,
      "total_reviews": 2
    },
    {
      "name": "Matthew Garcia",
      "location": "Charlotte, NC",
      "occupation": "Teacher",
      "profile_photo": "avatar_13.jpg",
      "member_since": "2024-06",
      "courses_completed": 1,
      "total_reviews": 4
    },
    {
      "name": "David I. Young, RN",
      "location": "Charlotte, NC",
      "occupation": "Yoga Instructor",
      "profile_photo": "avatar_13.jpg",
      "member_since": "2020-02",
      "courses_completed": 2,
      "total_reviews": 9
    },
    {
      "name": "Catherine Lewis, LCSW",
      "location": "Tucson, AZ",
      "occupation": "HR Professional",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2024-02",
      "courses_completed": 6,
      "total_reviews": 2
    },
    {
      "name": "Robert Q. Nguyen",
      "location": "Atlanta, GA",
      "occupation": "Executive Coach",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2023-06",
      "courses_completed": 3,
      "total_reviews": 10
    },
    {
      "name": "Nicole Scott, PhD",
      "location": "Oakland, CA",
      "occupation": "Business Consultant",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2023-11",
      "courses_completed": 1,
      "total_reviews": 12
    },
    {
      "name": "Kelly Jackson, LCSW",
      "location": "Columbus, OH",
      "occupation": "Personal Trainer",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2023-10",
      "courses_completed": 1,
      "total_reviews": 6
    },
    {
      "name": "Brian Wright",
      "location": "San Diego, CA",
      "occupation": "Holistic Practitioner",
      "profile_photo": "avatar_17.jpg",
      "member_since": "2022-07",
      "courses_completed": 5,
      "total_reviews": 11
    },
    {
      "name": "Jessica Lewis, LMFT",
      "location": "Chicago, IL",
      "occupation": "HR Professional",
      "profile_photo": "avatar_14.jpg",
      "member_since": "2024-11",
      "courses_completed": 1,
      "total_reviews": 9
    },
    {
      "name": "Jessica Robinson, MBA",
      "location": "Minneapolis, MN",
      "occupation": "Yoga Instructor",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2020-08",
      "courses_completed": 8,
      "total_reviews": 1
    },
    {
      "name": "Lisa P. Young, LMFT",
      "location": "Raleigh, NC",
      "occupation": "Nutritionist",
      "profile_photo": "avatar_08.jpg",
      "member_since": "2020-07",
      "courses_completed": 1,
      "total_reviews": 3
    },
    {
      "name": "Lauren Hall, LPC",
      "location": "Columbus, OH",
      "occupation": "Business Consultant",
      "profile_photo": "avatar_05.jpg",
      "member_since": "2024-01",
      "courses_completed": 1,
      "total_reviews": 3
    },
    {
      "name": "Robert F. Walker, MA",
      "location": "Minneapolis, MN",
      "occupation": "Teacher",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2023-12",
      "courses_completed": 8,
      "total_reviews": 10
    },
    {
      "name": "Paul Martin",
      "location": "Colorado Springs, CO",
      "occupation": "Relationship Counselor",
      "profile_photo": "avatar_15.jpg",
      "member_since": "2021-05",
      "courses_completed": 7,
      "total_reviews": 7
    },
    {
      "name": "Amanda Moore",
      "location": "Memphis, TN",
      "occupation": "Wellness Consultant",
      "profile_photo": "avatar_02.jpg",
      "member_since": "2024-12",
      "courses_completed": 3,
      "total_reviews": 5
    },
    {
      "name": "Daniel Young, MEd",
      "location": "Louisville, KY",
      "occupation": "HR Professional",
      "profile_photo": "avatar_10.jpg",
      "member_since": "2021-09",
      "courses_completed": 4,
      "total_reviews": 8
    },
    {
      "name": "Emily Martinez",
      "location": "Minneapolis, MN",
      "occupation": "Relationship Counselor",
      "profile_photo": "avatar_07.jpg",
      "member_since": "2021-08",
      "courses_completed": 3,
      "total_reviews": 8
    },
    {
      "name": "Brian X. Garcia",
      "location": "Nashville, TN",
      "occupation": "HR Professional",
      "profile_photo": "avatar_13.jpg",
      "member_since": "2023-10",
      "courses_completed": 6,
      "total_reviews": 5
    },
    {
      "name": "Amanda Davis, LPC",
      "location": "Dallas, TX",
      "occupation": "Business Consultant",
      "profile_photo": "avatar_12.jpg",
      "member_since": "2024-02",
      "courses_completed": 5,
      "total_reviews": 10
    },
    {
      "name": "Jason I. Clark, LMFT",
      "location": "Mesa, AZ",
      "occupation": "Business Consultant",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2021-06",
      "courses_completed": 5,
      "total_reviews": 5
    },
    {
      "name": "Andrew Jackson",
      "location": "Mesa, AZ",
      "occupation": "Executive Coach",
      "profile_photo": "avatar_14.jpg",
      "member_since": "2020-03",
      "courses_completed": 3,
      "total_reviews": 5
    },
    {
      "name": "Emily Hill, MA",
      "location": "Albuquerque, NM",
      "occupation": "Counselor",
      "profile_photo": "avatar_07.jpg",
      "member_since": "2023-12",
      "courses_completed": 2,
      "total_reviews": 7
    },
    {
      "name": "David Hall",
      "location": "Los Angeles, CA",
      "occupation": "Mindfulness Coach",
      "profile_photo": "avatar_10.jpg",
      "member_since": "2024-08",
      "courses_completed": 6,
      "total_reviews": 1
    },
    {
      "name": "Rebecca J. Young",
      "location": "Arlington, TX",
      "occupation": "Health Coach",
      "profile_photo": "avatar_04.jpg",
      "member_since": "2023-07",
      "courses_completed": 8,
      "total_reviews": 2
    },
    {
      "name": "Kimberly W. Flores",
      "location": "Albuquerque, NM",
      "occupation": "Nutritionist",
      "profile_photo": "avatar_13.jpg",
      "member_since": "2021-05",
      "courses_completed": 8,
      "total_reviews": 1
    },
    {
      "name": "Laura P. Jackson, MBA",
      "location": "Tucson, AZ",
      "occupation": "Recovery Specialist",
      "profile_photo": "avatar_10.jpg",
      "member_since": "2021-12",
      "courses_completed": 7,
      "total_reviews": 1
    },
    {
      "name": "Thomas Brown",
      "location": "Fresno, CA",
      "occupation": "School Counselor",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2020-11",
      "courses_completed": 5,
      "total_reviews": 8
    },
    {
      "name": "Robert White",
      "location": "Tulsa, OK",
      "occupation": "Relationship Counselor",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2022-06",
      "courses_completed": 1,
      "total_reviews": 8
    },
    {
      "name": "Angela Hall",
      "location": "Memphis, TN",
      "occupation": "Family Therapist",
      "profile_photo": "avatar_06.jpg",
      "member_since": "2023-06",
      "courses_completed": 3,
      "total_reviews": 1
    },
    {
      "name": "David Rodriguez, MS",
      "location": "Memphis, TN",
      "occupation": "Fitness Coach",
      "profile_photo": "avatar_17.jpg",
      "member_since": "2024-05",
      "courses_completed": 2,
      "total_reviews": 12
    },
    {
      "name": "Catherine Allen",
      "location": "Fort Worth, TX",
      "occupation": "Teacher",
      "profile_photo": "avatar_15.jpg",
      "member_since": "2022-12",
      "courses_completed": 3,
      "total_reviews": 5
    },
    {
      "name": "Rebecca Hill",
      "location": "Kansas City, MO",
      "occupation": "Leadership Trainer",
      "profile_photo": "avatar_15.jpg",
      "member_since": "2021-02",
      "courses_completed": 4,
      "total_reviews": 12
    },
    {
      "name": "Kimberly Hernandez",
      "location": "Seattle, WA",
      "occupation": "Personal Trainer",
      "profile_photo": "avatar_12.jpg",
      "member_since": "2022-05",
      "courses_completed": 3,
      "total_reviews": 5
    },
    {
      "name": "Nicole Adams",
      "location": "Memphis, TN",
      "occupation": "Business Consultant",
      "profile_photo": "avatar_04.jpg",
      "member_since": "2022-11",
      "courses_completed": 1,
      "total_reviews": 3
    },
    {
      "name": "Mark Miller",
      "location": "Louisville, KY",
      "occupation": "Mental Health Professional",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2020-01",
      "courses_completed": 2,
      "total_reviews": 12
    },
    {
      "name": "Amanda Allen, MA",
      "location": "Chicago, IL",
      "occupation": "Leadership Trainer",
      "profile_photo": "avatar_08.jpg",
      "member_since": "2023-09",
      "courses_completed": 7,
      "total_reviews": 11
    },
    {
      "name": "Kevin Smith",
      "location": "Tucson, AZ",
      "occupation": "Mentor",
      "profile_photo": "avatar_14.jpg",
      "member_since": "2021-04",
      "courses_completed": 4,
      "total_reviews": 2
    },
    {
      "name": "Ryan M. Harris",
      "location": "Detroit, MI",
      "occupation": "Life Coach",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2022-03",
      "courses_completed": 4,
      "total_reviews": 6
    },
    {
      "name": "Michelle Thompson",
      "location": "Austin, TX",
      "occupation": "Nutritionist",
      "profile_photo": "avatar_05.jpg",
      "member_since": "2023-12",
      "courses_completed": 2,
      "total_reviews": 2
    },
    {
      "name": "Robert Miller",
      "location": "Fresno, CA",
      "occupation": "Yoga Instructor",
      "profile_photo": "avatar_09.jpg",
      "member_since": "2023-06",
      "courses_completed": 2,
      "total_reviews": 5
    },
    {
      "name": "Robert Baker",
      "location": "Chicago, IL",
      "occupation": "Academic Advisor",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2024-09",
      "courses_completed": 5,
      "total_reviews": 1
    },
    {
      "name": "Michelle Jackson",
      "location": "Raleigh, NC",
      "occupation": "Relationship Counselor",
      "profile_photo": "avatar_06.jpg",
      "member_since": "2024-07",
      "courses_completed": 8,
      "total_reviews": 2
    },
    {
      "name": "Rachel Robinson",
      "location": "New York, NY",
      "occupation": "Career Coach",
      "profile_photo": "avatar_16.jpg",
      "member_since": "2020-04",
      "courses_completed": 2,
      "total_reviews": 4
    },
    {
      "name": "Brian G. Moore",
      "location": "San Antonio, TX",
      "occupation": "Therapist",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2022-08",
      "courses_completed": 6,
      "total_reviews": 10
    },
    {
      "name": "Angela Z. Miller",
      "location": "Houston, TX",
      "occupation": "Personal Trainer",
      "profile_photo": "avatar_09.jpg",
      "member_since": "2022-04",
      "courses_completed": 5,
      "total_reviews": 11
    },
    {
      "name": "Christopher White, MS",
      "location": "Fresno, CA",
      "occupation": "Career Coach",
      "profile_photo": "avatar_13.jpg",
      "member_since": "2021-03",
      "courses_completed": 3,
      "total_reviews": 11
    },
    {
      "name": "Robert Robinson",
      "location": "Tulsa, OK",
      "occupation": "Career Coach",
      "profile_photo": "avatar_15.jpg",
      "member_since": "2020-05",
      "courses_completed": 6,
      "total_reviews": 6
    },
    {
      "name": "Amanda E. Hill",
      "location": "Miami, FL",
      "occupation": "HR Professional",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2023-03",
      "courses_completed": 6,
      "total_reviews": 5
    },
    {
      "name": "David Baker",
      "location": "Colorado Springs, CO",
      "occupation": "Yoga Instructor",
      "profile_photo": "avatar_05.jpg",
      "member_since": "2020-10",
      "courses_completed": 1,
      "total_reviews": 2
    },
    {
      "name": "Paul T. Carter, PhD",
      "location": "Nashville, TN",
      "occupation": "Academic Advisor",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2020-01",
      "courses_completed": 4,
      "total_reviews": 9
    },
    {
      "name": "Paul Campbell, LPC",
      "location": "Mesa, AZ",
      "occupation": "Recovery Specialist",
      "profile_photo": "avatar_09.jpg",
      "member_since": "2024-07",
      "courses_completed": 5,
      "total_reviews": 7
    },
    {
      "name": "Robert Wilson",
      "location": "Miami, FL",
      "occupation": "Personal Trainer",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2020-11",
      "courses_completed": 5,
      "total_reviews": 3
    },
    {
      "name": "Steven Rivera",
      "location": "Boston, MA",
      "occupation": "Teacher",
      "profile_photo": "avatar_13.jpg",
      "member_since": "2023-09",
      "courses_completed": 1,
      "total_reviews": 2
    }
  ],
  "generated_date": "2026-01-19 20:12:25"
}