{
  "course_name": "Certified Libido Practitioner™",
  "niche": "default",
  "total_reviews": 55,
  "average_rating": 4.51,
  "distribution": {
    "5_star": 35,
    "4_star": 13,
    "3_star": 7,
    "2_star": 0,
    "1_star": 0
  },
  "reviews": [
    {
      "id": "rev_001",
      "user_id": "user_001",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "ROI was insane. Paid for itself in 2 weeks after I landed my first {niche_client_type} client using the session structure from Module 6. Now charging $278 per session vs $91 before. Game changer.",
      "date": "2026-01-03",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_024",
      "user_id": "user_024",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "I've taken 7 courses in this field, but this one stands out. The practical focus on ethical practice helped me pivot my entire business model. Within 2 months I had doubled my rates. The community support was incredible too.",
      "date": "2025-12-19",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_039",
      "user_id": "user_039",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "Best professional investment I've made in years. The clear explanations made complex topics accessible, and I immediately applied intake assessment with my first client post-certification. Revenue up 37% in 2 months. Worth every penny.",
      "date": "2025-12-19",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_028",
      "user_id": "user_028",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "I've taken 8 courses in this field, but this one stands out. The practical focus on outcome measurement helped me pivot my entire business model. Within 2 months I had launched group programs. The community support was incredible too.",
      "date": "2025-12-16",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_032",
      "user_id": "user_032",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The clear explanations made complex topics accessible, and I immediately applied session planner with my first client post-certification. Revenue up 43% in 3 months. Worth every penny.",
      "date": "2025-12-15",
      "verified_purchase": true,
      "helpful_count": 32
    },
    {
      "id": "rev_045",
      "user_id": "user_045",
      "rating": 4,
      "focus_type": "constructive",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from general wellness coaching to Default, and this course gave me the exact framework I needed. The assessment framework module alone was worth the investment. Now I have 7 new clients and finally feel confident in my niche.",
      "date": "2025-12-06",
      "verified_purchase": true,
      "helpful_count": 38
    },
    {
      "id": "rev_041",
      "user_id": "user_041",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "I've taken 10 courses in this field, but this one stands out. The practical focus on outcome measurement helped me pivot my entire business model. Within 3 months I had built a waitlist. The community support was incredible too.",
      "date": "2025-11-15",
      "verified_purchase": true,
      "helpful_count": 23
    },
    {
      "id": "rev_054",
      "user_id": "user_054",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Decent course. The Module 2 module was fantastic, but the final module didn't deliver as much value. Could use more real client examples. Still learned enough to justify the cost, but room for improvement.",
      "date": "2025-10-10",
      "verified_purchase": true,
      "helpful_count": 33
    },
    {
      "id": "rev_004",
      "user_id": "user_004",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "I've taken 5 courses in this field, but this one stands out. The practical focus on client acquisition helped me pivot my entire business model. Within 3 months I had built a waitlist. The community support was incredible too.",
      "date": "2025-10-09",
      "verified_purchase": true,
      "helpful_count": 1
    },
    {
      "id": "rev_025",
      "user_id": "user_025",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The video demonstrations made all the difference. I learn best by visual aids, and the course accommodated that perfectly. The case study walkthrough helped me finally understand boundary setting.",
      "date": "2025-10-05",
      "verified_purchase": true,
      "helpful_count": 9
    },
    {
      "id": "rev_022",
      "user_id": "user_022",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The step-by-step breakdown made complex topics accessible, and I immediately applied progress tracker with my first client post-certification. Revenue up 113% in 90 days. Worth every penny.",
      "date": "2025-09-27",
      "verified_purchase": true,
      "helpful_count": 34
    },
    {
      "id": "rev_020",
      "user_id": "user_020",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The transcript downloads made all the difference. I learn best by discussion, and the course accommodated that perfectly. The case study walkthrough helped me finally understand ethical gray areas.",
      "date": "2025-09-23",
      "verified_purchase": true,
      "helpful_count": 14
    },
    {
      "id": "rev_034",
      "user_id": "user_034",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the session templates templates alone saved me 29 hours of work. Closed 10 new clients in 90 days using the pitch framework from Module 5. Already made back 4x my investment.",
      "date": "2025-09-12",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_040",
      "user_id": "user_040",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "I've taken 8 courses in this field, but this one stands out. The practical focus on outcome measurement helped me pivot my entire business model. Within 6 weeks I had filled my calendar. The community support was incredible too.",
      "date": "2025-08-20",
      "verified_purchase": true,
      "helpful_count": 18
    },
    {
      "id": "rev_031",
      "user_id": "user_031",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "ROI was insane. Paid for itself in 1 month after I landed my first {niche_client_type} client using the client journey map from Module 4. Now charging $282 per session vs $75 before. Game changer.",
      "date": "2025-08-11",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_003",
      "user_id": "user_003",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "Finally, a certification that respects your intelligence. The research foundation section gave me the conceptual foundation I was missing from my master's program. Now I can confidently explain neurobiology to clients and colleagues.",
      "date": "2025-08-09",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_016",
      "user_id": "user_016",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from teaching to Default, and this course gave me the exact framework I needed. The advanced protocols module alone was worth the investment. Now I have 3 new clients and finally feel confident in my niche.",
      "date": "2025-08-05",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_027",
      "user_id": "user_027",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the marketing scripts templates alone saved me 26 hours of work. Closed 9 new clients in 90 days using the pitch framework from Module 5. Already made back 4x my investment.",
      "date": "2025-07-28",
      "verified_purchase": true,
      "helpful_count": 32
    },
    {
      "id": "rev_015",
      "user_id": "user_015",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from corporate HR to Default, and this course gave me the exact framework I needed. The advanced protocols module alone was worth the investment. Now I have 11 new clients and finally feel confident in my niche.",
      "date": "2025-07-25",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_052",
      "user_id": "user_052",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Good certification with practical tools, though some modules felt repetitive. The session planner was excellent, but tech implementation could use expansion. Worth it if you're new to default, but experienced practitioners might find some sections basic.",
      "date": "2025-07-21",
      "verified_purchase": true,
      "helpful_count": 19
    },
    {
      "id": "rev_009",
      "user_id": "user_009",
      "rating": 5,
      "focus_type": "support",
      "review_text": "Loved the case discussions. Being able to discuss ethical dilemmas with peers who 'get it' was invaluable. The form library is something I still reference weekly. Great ongoing value.",
      "date": "2025-07-20",
      "verified_purchase": true,
      "helpful_count": 12
    },
    {
      "id": "rev_007",
      "user_id": "user_007",
      "rating": 5,
      "focus_type": "constructive",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from fitness training to Default, and this course gave me the exact framework I needed. The ethical boundaries module alone was worth the investment. Now I have 9 new clients and finally feel confident in my niche.",
      "date": "2025-07-06",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_050",
      "user_id": "user_050",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Solid content overall, but I wish there was more on advanced assessment. The Module 5 module felt rushed compared to others. Still valuable, just expected more depth given the price point. Would recommend, but set expectations accordingly.",
      "date": "2025-07-02",
      "verified_purchase": true,
      "helpful_count": 41
    },
    {
      "id": "rev_014",
      "user_id": "user_014",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "ROI was insane. Paid for itself in 3 weeks after I landed my first {niche_client_type} client using the consultation model from Module 4. Now charging $184 per session vs $73 before. Game changer.",
      "date": "2025-06-18",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_049",
      "user_id": "user_049",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Solid content overall, but I wish there was more on group coaching. The Module 3 module felt rushed compared to others. Still valuable, just expected more depth given the price point. Would recommend, but set expectations accordingly.",
      "date": "2025-06-15",
      "verified_purchase": true,
      "helpful_count": 23
    },
    {
      "id": "rev_018",
      "user_id": "user_018",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the session templates templates alone saved me 11 hours of work. Closed 15 new clients in 90 days using the pitch framework from the assessment section. Already made back 3x my investment.",
      "date": "2025-06-14",
      "verified_purchase": true,
      "helpful_count": 30
    },
    {
      "id": "rev_012",
      "user_id": "user_012",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The practice exercises made all the difference. I learn best by doing, and the course accommodated that perfectly. The video demonstrations helped me finally understand motivational interviewing.",
      "date": "2025-06-02",
      "verified_purchase": true,
      "helpful_count": 38
    },
    {
      "id": "rev_011",
      "user_id": "user_011",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from general wellness coaching to Default, and this course gave me the exact framework I needed. The client onboarding module alone was worth the investment. Now I have 10 new clients and finally feel confident in my niche.",
      "date": "2025-05-14",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_051",
      "user_id": "user_051",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Decent course. The the core training module was fantastic, but Module 6 didn't deliver as much value. Some videos felt too long. Still learned enough to justify the cost, but room for improvement.",
      "date": "2025-05-09",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_042",
      "user_id": "user_042",
      "rating": 4,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from general wellness coaching to Default, and this course gave me the exact framework I needed. The assessment framework module alone was worth the investment. Now I have 12 new clients and finally feel confident in my niche.",
      "date": "2025-04-26",
      "verified_purchase": true,
      "helpful_count": 10
    },
    {
      "id": "rev_019",
      "user_id": "user_019",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "As someone with a background in nursing, I appreciated the academic rigor. The integration of cognitive-behavioral and motivational interviewing approaches was brilliant. This isn't just 'coaching tips' — it's legitimate professional training.",
      "date": "2025-04-22",
      "verified_purchase": true,
      "helpful_count": 20
    },
    {
      "id": "rev_048",
      "user_id": "user_048",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "Best professional investment I've made in years. The practical focus made complex topics accessible, and I immediately applied session planner with my first client post-certification. Revenue up 60% in 2 months. Worth every penny.",
      "date": "2025-04-16",
      "verified_purchase": true,
      "helpful_count": 38
    },
    {
      "id": "rev_036",
      "user_id": "user_036",
      "rating": 4,
      "focus_type": "constructive",
      "review_text": "I've taken 5 courses in this field, but this one stands out. The practical focus on session structure helped me pivot my entire business model. Within 90 days I had filled my calendar. The community support was incredible too.",
      "date": "2025-03-21",
      "verified_purchase": true,
      "helpful_count": 10
    },
    {
      "id": "rev_021",
      "user_id": "user_021",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied session planner with my first client post-certification. Revenue up 55% in 2 months. Worth every penny.",
      "date": "2025-03-19",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_023",
      "user_id": "user_023",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "I've taken 10 courses in this field, but this one stands out. The practical focus on ethical practice helped me pivot my entire business model. Within 2 months I had doubled my rates. The community support was incredible too.",
      "date": "2025-03-07",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_046",
      "user_id": "user_046",
      "rating": 4,
      "focus_type": "support",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied progress tracker with my first client post-certification. Revenue up 60% in 3 months. Worth every penny.",
      "date": "2025-02-23",
      "verified_purchase": true,
      "helpful_count": 26
    },
    {
      "id": "rev_038",
      "user_id": "user_038",
      "rating": 4,
      "focus_type": "knowledge_depth",
      "review_text": "Best professional investment I've made in years. The clear explanations made complex topics accessible, and I immediately applied intake assessment with my first client post-certification. Revenue up 119% in 6 weeks. Worth every penny.",
      "date": "2025-02-16",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_017",
      "user_id": "user_017",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "As someone with a background in education, I appreciated the academic rigor. The integration of cognitive-behavioral and mindfulness-based approaches was brilliant. This isn't just 'coaching tips' — it's legitimate professional training.",
      "date": "2025-02-01",
      "verified_purchase": true,
      "helpful_count": 41
    },
    {
      "id": "rev_002",
      "user_id": "user_002",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "The business-building modules were pure gold. Implemented the referral system and saw 123% revenue increase in 6 weeks. Finally feel like a legitimate professional in the default space.",
      "date": "2025-01-16",
      "verified_purchase": true,
      "helpful_count": 15
    },
    {
      "id": "rev_037",
      "user_id": "user_037",
      "rating": 4,
      "focus_type": "income_win",
      "review_text": "Best professional investment I've made in years. The practical focus made complex topics accessible, and I immediately applied intake assessment with my first client post-certification. Revenue up 87% in 6 weeks. Worth every penny.",
      "date": "2025-01-10",
      "verified_purchase": true,
      "helpful_count": 45
    },
    {
      "id": "rev_047",
      "user_id": "user_047",
      "rating": 4,
      "focus_type": "knowledge_depth",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied progress tracker with my first client post-certification. Revenue up 76% in 90 days. Worth every penny.",
      "date": "2024-12-30",
      "verified_purchase": true,
      "helpful_count": 33
    },
    {
      "id": "rev_029",
      "user_id": "user_029",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "Finally, a certification that respects your intelligence. The evidence base section gave me the conceptual foundation I was missing from my professional experience. Now I can confidently explain neurobiology to clients and colleagues.",
      "date": "2024-12-28",
      "verified_purchase": true,
      "helpful_count": 40
    },
    {
      "id": "rev_005",
      "user_id": "user_005",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The instructor support was exceptional. Dr. Mitchell personally answered my question about pricing my services within a few hours. The private Facebook group helped me troubleshoot real client scenarios. Never felt alone in the learning process.",
      "date": "2024-12-17",
      "verified_purchase": true,
      "helpful_count": 14
    },
    {
      "id": "rev_030",
      "user_id": "user_030",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from fitness training to Default, and this course gave me the exact framework I needed. The ethical boundaries module alone was worth the investment. Now I have 6 new clients and finally feel confident in my niche.",
      "date": "2024-12-16",
      "verified_purchase": true,
      "helpful_count": 38
    },
    {
      "id": "rev_043",
      "user_id": "user_043",
      "rating": 4,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied session planner with my first client post-certification. Revenue up 28% in 3 months. Worth every penny.",
      "date": "2024-11-07",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_008",
      "user_id": "user_008",
      "rating": 5,
      "focus_type": "knowledge_depth",
      "review_text": "Finally, a certification that respects your intelligence. The conceptual model section gave me the conceptual foundation I was missing from my undergraduate studies. Now I can confidently explain systems theory to clients and colleagues.",
      "date": "2024-10-15",
      "verified_purchase": true,
      "helpful_count": 8
    },
    {
      "id": "rev_035",
      "user_id": "user_035",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "This certification completely transformed my practice. I was struggling to transition from corporate HR to Default, and this course gave me the exact framework I needed. The ethical boundaries module alone was worth the investment. Now I have 9 new clients and finally feel confident in my niche.",
      "date": "2024-10-05",
      "verified_purchase": true,
      "helpful_count": 2
    },
    {
      "id": "rev_053",
      "user_id": "user_053",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Decent course. The Module 4 module was fantastic, but the practice building didn't deliver as much value. Some videos felt too long. Still learned enough to justify the cost, but room for improvement.",
      "date": "2024-09-11",
      "verified_purchase": true,
      "helpful_count": 45
    },
    {
      "id": "rev_055",
      "user_id": "user_055",
      "rating": 3,
      "focus_type": "constructive",
      "review_text": "Decent course. The the assessment section module was fantastic, but the final module didn't deliver as much value. The workbook could be more detailed. Still learned enough to justify the cost, but room for improvement.",
      "date": "2024-09-06",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_013",
      "user_id": "user_013",
      "rating": 5,
      "focus_type": "career_change",
      "review_text": "Best professional investment I've made in years. The step-by-step breakdown made complex topics accessible, and I immediately applied goal-setting framework with my first client post-certification. Revenue up 47% in 90 days. Worth every penny.",
      "date": "2024-08-25",
      "verified_purchase": true,
      "helpful_count": 42
    },
    {
      "id": "rev_010",
      "user_id": "user_010",
      "rating": 5,
      "focus_type": "support",
      "review_text": "The transcript downloads made all the difference. I learn best by discussion, and the course accommodated that perfectly. The case study walkthrough helped me finally understand ethical gray areas.",
      "date": "2024-08-19",
      "verified_purchase": true,
      "helpful_count": 12
    },
    {
      "id": "rev_044",
      "user_id": "user_044",
      "rating": 4,
      "focus_type": "support",
      "review_text": "Best professional investment I've made in years. The clear explanations made complex topics accessible, and I immediately applied intake assessment with my first client post-certification. Revenue up 109% in 6 weeks. Worth every penny.",
      "date": "2024-08-16",
      "verified_purchase": true,
      "helpful_count": 4
    },
    {
      "id": "rev_026",
      "user_id": "user_026",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "The business-building modules were pure gold. Implemented the referral system and saw 71% revenue increase in 6 weeks. Finally feel like a legitimate professional in the default space.",
      "date": "2024-08-11",
      "verified_purchase": true,
      "helpful_count": 0
    },
    {
      "id": "rev_033",
      "user_id": "user_033",
      "rating": 5,
      "focus_type": "income_win",
      "review_text": "Skeptical about the price initially, but the session templates templates alone saved me 19 hours of work. Closed 9 new clients in 90 days using the pitch framework from the ethics module. Already made back 5x my investment.",
      "date": "2024-08-03",
      "verified_purchase": true,
      "helpful_count": 11
    },
    {
      "id": "rev_006",
      "user_id": "user_006",
      "rating": 5,
      "focus_type": "constructive",
      "review_text": "Best professional investment I've made in years. The real-world examples made complex topics accessible, and I immediately applied progress tracker with my first client post-certification. Revenue up 81% in 6 weeks. Worth every penny.",
      "date": "2024-07-31",
      "verified_purchase": true,
      "helpful_count": 0
    }
  ],
  "zombie_profiles": [
    {
      "name": "Ryan Nguyen",
      "location": "Los Angeles, CA",
      "occupation": "Academic Advisor",
      "profile_photo": "avatar_11.jpg",
      "member_since": "2024-08",
      "courses_completed": 7,
      "total_reviews": 8
    },
    {
      "name": "Amy Torres, LMFT",
      "location": "Colorado Springs, CO",
      "occupation": "Mentor",
      "profile_photo": "avatar_16.jpg",
      "member_since": "2022-01",
      "courses_completed": 2,
      "total_reviews": 1
    },
    {
      "name": "Melissa Hernandez",
      "location": "Las Vegas, NV",
      "occupation": "Career Coach",
      "profile_photo": "avatar_11.jpg",
      "member_since": "2022-04",
      "courses_completed": 4,
      "total_reviews": 6
    },
    {
      "name": "Samantha Hernandez",
      "location": "Arlington, TX",
      "occupation": "Mentor",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2023-07",
      "courses_completed": 6,
      "total_reviews": 9
    },
    {
      "name": "Andrew Martinez",
      "location": "Detroit, MI",
      "occupation": "Fitness Coach",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2023-06",
      "courses_completed": 8,
      "total_reviews": 4
    },
    {
      "name": "Maria Torres",
      "location": "Seattle, WA",
      "occupation": "Wellness Consultant",
      "profile_photo": "avatar_04.jpg",
      "member_since": "2023-03",
      "courses_completed": 5,
      "total_reviews": 7
    },
    {
      "name": "Thomas Hill",
      "location": "San Diego, CA",
      "occupation": "Family Therapist",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2022-10",
      "courses_completed": 5,
      "total_reviews": 11
    },
    {
      "name": "Joseph Lewis",
      "location": "Los Angeles, CA",
      "occupation": "Family Therapist",
      "profile_photo": "avatar_17.jpg",
      "member_since": "2023-06",
      "courses_completed": 5,
      "total_reviews": 1
    },
    {
      "name": "Robert Anderson",
      "location": "Jacksonville, FL",
      "occupation": "Holistic Practitioner",
      "profile_photo": "avatar_06.jpg",
      "member_since": "2022-11",
      "courses_completed": 2,
      "total_reviews": 11
    },
    {
      "name": "Ryan N. Green, MA",
      "location": "Tulsa, OK",
      "occupation": "Family Therapist",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2021-03",
      "courses_completed": 3,
      "total_reviews": 7
    },
    {
      "name": "Stephanie Walker, MPH",
      "location": "Tulsa, OK",
      "occupation": "Teacher",
      "profile_photo": "avatar_20.jpg",
      "member_since": "2022-04",
      "courses_completed": 5,
      "total_reviews": 12
    },
    {
      "name": "Matthew Z. Miller",
      "location": "Las Vegas, NV",
      "occupation": "Recovery Specialist",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2022-07",
      "courses_completed": 5,
      "total_reviews": 5
    },
    {
      "name": "Robert H. Hall",
      "location": "Dallas, TX",
      "occupation": "Wellness Consultant",
      "profile_photo": "avatar_12.jpg",
      "member_since": "2020-12",
      "courses_completed": 1,
      "total_reviews": 1
    },
    {
      "name": "Brian Robinson",
      "location": "Fort Worth, TX",
      "occupation": "Academic Advisor",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2020-06",
      "courses_completed": 2,
      "total_reviews": 7
    },
    {
      "name": "Maria Moore",
      "location": "Nashville, TN",
      "occupation": "Therapist",
      "profile_photo": "avatar_16.jpg",
      "member_since": "2023-08",
      "courses_completed": 8,
      "total_reviews": 10
    },
    {
      "name": "Michael Nelson, MS",
      "location": "Miami, FL",
      "occupation": "Therapist",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2023-10",
      "courses_completed": 8,
      "total_reviews": 12
    },
    {
      "name": "Michael Anderson",
      "location": "Denver, CO",
      "occupation": "Holistic Practitioner",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2024-10",
      "courses_completed": 5,
      "total_reviews": 7
    },
    {
      "name": "Angela G. Thompson",
      "location": "Oakland, CA",
      "occupation": "School Counselor",
      "profile_photo": "avatar_17.jpg",
      "member_since": "2022-11",
      "courses_completed": 3,
      "total_reviews": 9
    },
    {
      "name": "Jessica Baker, MPH",
      "location": "Houston, TX",
      "occupation": "Recovery Specialist",
      "profile_photo": "avatar_07.jpg",
      "member_since": "2023-07",
      "courses_completed": 1,
      "total_reviews": 1
    },
    {
      "name": "Matthew Nelson, MBA",
      "location": "Oakland, CA",
      "occupation": "Business Consultant",
      "profile_photo": "avatar_15.jpg",
      "member_since": "2020-10",
      "courses_completed": 7,
      "total_reviews": 2
    },
    {
      "name": "Kelly Thomas",
      "location": "Portland, OR",
      "occupation": "Holistic Practitioner",
      "profile_photo": "avatar_02.jpg",
      "member_since": "2024-11",
      "courses_completed": 3,
      "total_reviews": 8
    },
    {
      "name": "Richard E. Smith",
      "location": "Tulsa, OK",
      "occupation": "Leadership Trainer",
      "profile_photo": "avatar_07.jpg",
      "member_since": "2020-04",
      "courses_completed": 2,
      "total_reviews": 8
    },
    {
      "name": "Jason Z. Martinez",
      "location": "Arlington, TX",
      "occupation": "Executive Coach",
      "profile_photo": "avatar_03.jpg",
      "member_since": "2024-11",
      "courses_completed": 3,
      "total_reviews": 5
    },
    {
      "name": "John Wright, MPH",
      "location": "Milwaukee, WI",
      "occupation": "Teacher",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2021-09",
      "courses_completed": 2,
      "total_reviews": 7
    },
    {
      "name": "Catherine Lee",
      "location": "Boston, MA",
      "occupation": "Mentor",
      "profile_photo": "avatar_02.jpg",
      "member_since": "2021-08",
      "courses_completed": 7,
      "total_reviews": 3
    },
    {
      "name": "Christopher Martinez, LPC",
      "location": "Kansas City, MO",
      "occupation": "Nutritionist",
      "profile_photo": "avatar_06.jpg",
      "member_since": "2022-09",
      "courses_completed": 6,
      "total_reviews": 3
    },
    {
      "name": "Kenneth Robinson",
      "location": "San Antonio, TX",
      "occupation": "Mentor",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2021-12",
      "courses_completed": 5,
      "total_reviews": 9
    },
    {
      "name": "Ashley F. Taylor, PhD",
      "location": "Mesa, AZ",
      "occupation": "School Counselor",
      "profile_photo": "avatar_16.jpg",
      "member_since": "2022-06",
      "courses_completed": 2,
      "total_reviews": 8
    },
    {
      "name": "William Y. Carter",
      "location": "Sacramento, CA",
      "occupation": "Nutritionist",
      "profile_photo": "avatar_12.jpg",
      "member_since": "2021-05",
      "courses_completed": 5,
      "total_reviews": 12
    },
    {
      "name": "Ryan N. Garcia",
      "location": "Mesa, AZ",
      "occupation": "Relationship Counselor",
      "profile_photo": "avatar_07.jpg",
      "member_since": "2023-09",
      "courses_completed": 5,
      "total_reviews": 1
    },
    {
      "name": "Brian Johnson, PhD",
      "location": "Sacramento, CA",
      "occupation": "Fitness Coach",
      "profile_photo": "avatar_07.jpg",
      "member_since": "2021-11",
      "courses_completed": 4,
      "total_reviews": 6
    },
    {
      "name": "Michelle N. Hernandez, MA",
      "location": "Dallas, TX",
      "occupation": "Career Coach",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2020-06",
      "courses_completed": 5,
      "total_reviews": 4
    },
    {
      "name": "Thomas Williams",
      "location": "Houston, TX",
      "occupation": "Counselor",
      "profile_photo": "avatar_17.jpg",
      "member_since": "2021-08",
      "courses_completed": 3,
      "total_reviews": 5
    },
    {
      "name": "Matthew Hernandez",
      "location": "Tulsa, OK",
      "occupation": "Relationship Counselor",
      "profile_photo": "avatar_02.jpg",
      "member_since": "2020-07",
      "courses_completed": 4,
      "total_reviews": 4
    },
    {
      "name": "Amy Young",
      "location": "Miami, FL",
      "occupation": "Career Coach",
      "profile_photo": "avatar_08.jpg",
      "member_since": "2020-11",
      "courses_completed": 5,
      "total_reviews": 1
    },
    {
      "name": "Kimberly Taylor",
      "location": "Fort Worth, TX",
      "occupation": "Yoga Instructor",
      "profile_photo": "avatar_20.jpg",
      "member_since": "2020-08",
      "courses_completed": 5,
      "total_reviews": 10
    },
    {
      "name": "Michael Lee",
      "location": "Memphis, TN",
      "occupation": "Holistic Practitioner",
      "profile_photo": "avatar_10.jpg",
      "member_since": "2021-04",
      "courses_completed": 1,
      "total_reviews": 2
    },
    {
      "name": "Christopher Hall",
      "location": "Chicago, IL",
      "occupation": "Recovery Specialist",
      "profile_photo": "avatar_03.jpg",
      "member_since": "2023-10",
      "courses_completed": 2,
      "total_reviews": 5
    },
    {
      "name": "Steven G. Lewis",
      "location": "Omaha, NE",
      "occupation": "Mental Health Professional",
      "profile_photo": "avatar_04.jpg",
      "member_since": "2021-12",
      "courses_completed": 1,
      "total_reviews": 10
    },
    {
      "name": "Joshua Martin",
      "location": "Tulsa, OK",
      "occupation": "Mentor",
      "profile_photo": "avatar_15.jpg",
      "member_since": "2020-06",
      "courses_completed": 7,
      "total_reviews": 1
    },
    {
      "name": "Kevin Baker",
      "location": "Omaha, NE",
      "occupation": "Fitness Coach",
      "profile_photo": "avatar_06.jpg",
      "member_since": "2020-11",
      "courses_completed": 2,
      "total_reviews": 2
    },
    {
      "name": "Lisa Lopez",
      "location": "Philadelphia, PA",
      "occupation": "Educator",
      "profile_photo": "avatar_15.jpg",
      "member_since": "2023-02",
      "courses_completed": 8,
      "total_reviews": 7
    },
    {
      "name": "Christina Miller, MS",
      "location": "Fresno, CA",
      "occupation": "Family Therapist",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2020-07",
      "courses_completed": 2,
      "total_reviews": 11
    },
    {
      "name": "Steven G. Torres, MS",
      "location": "Mesa, AZ",
      "occupation": "Executive Coach",
      "profile_photo": "avatar_20.jpg",
      "member_since": "2021-03",
      "courses_completed": 4,
      "total_reviews": 6
    },
    {
      "name": "Catherine Roberts",
      "location": "Tucson, AZ",
      "occupation": "Teacher",
      "profile_photo": "avatar_04.jpg",
      "member_since": "2021-03",
      "courses_completed": 5,
      "total_reviews": 7
    },
    {
      "name": "Rachel King, MPH",
      "location": "Albuquerque, NM",
      "occupation": "Teacher",
      "profile_photo": "avatar_12.jpg",
      "member_since": "2022-04",
      "courses_completed": 6,
      "total_reviews": 6
    },
    {
      "name": "Eric H. Hall",
      "location": "Austin, TX",
      "occupation": "Social Worker",
      "profile_photo": "avatar_09.jpg",
      "member_since": "2024-11",
      "courses_completed": 5,
      "total_reviews": 2
    },
    {
      "name": "Ashley Lopez",
      "location": "Portland, OR",
      "occupation": "Fitness Coach",
      "profile_photo": "avatar_06.jpg",
      "member_since": "2022-11",
      "courses_completed": 4,
      "total_reviews": 1
    },
    {
      "name": "Joseph Clark, MEd",
      "location": "Detroit, MI",
      "occupation": "Academic Advisor",
      "profile_photo": "avatar_18.jpg",
      "member_since": "2024-12",
      "courses_completed": 1,
      "total_reviews": 1
    },
    {
      "name": "Kevin Thomas",
      "location": "Mesa, AZ",
      "occupation": "Health Coach",
      "profile_photo": "avatar_19.jpg",
      "member_since": "2023-03",
      "courses_completed": 3,
      "total_reviews": 3
    },
    {
      "name": "Joseph Lee, MBA",
      "location": "Arlington, TX",
      "occupation": "Wellness Consultant",
      "profile_photo": "avatar_12.jpg",
      "member_since": "2023-08",
      "courses_completed": 8,
      "total_reviews": 11
    },
    {
      "name": "Robert Wright",
      "location": "Wichita, KS",
      "occupation": "Fitness Coach",
      "profile_photo": "avatar_17.jpg",
      "member_since": "2020-10",
      "courses_completed": 4,
      "total_reviews": 1
    },
    {
      "name": "James Hernandez",
      "location": "Las Vegas, NV",
      "occupation": "Social Worker",
      "profile_photo": "avatar_07.jpg",
      "member_since": "2024-12",
      "courses_completed": 2,
      "total_reviews": 7
    },
    {
      "name": "David Nelson, MA",
      "location": "Seattle, WA",
      "occupation": "HR Professional",
      "profile_photo": "avatar_05.jpg",
      "member_since": "2022-08",
      "courses_completed": 8,
      "total_reviews": 11
    },
    {
      "name": "Stephanie Thompson",
      "location": "Louisville, KY",
      "occupation": "School Counselor",
      "profile_photo": "avatar_01.jpg",
      "member_since": "2024-01",
      "courses_completed": 3,
      "total_reviews": 11
    }
  ],
  "generated_date": "2026-01-20 05:12:07"
}