{
  "course_name": "Certified LGBTQ+ Affirming Wellness Coach™",
  "total_lessons": 292,
  "modules": [
    {
      "number": 0,
      "title": "Introduction & Career Vision",
      "tier": "L1",
      "has_quiz": false,
      "lessons": [
        {
          "number": 1,
          "title": "The Evolution of Affirming Wellness",
          "outline": [
            "Historical context: From the pathologization of LGBTQ+ identities to the modern affirming care movement.",
            "The 'Wellness Gap': Analyzing current health disparities and the impact of medical mistrust in the community.",
            "Moving beyond 'Neutrality': Defining the critical difference between being LGBTQ-friendly and LGBTQ-affirming.",
            "The socio-economic landscape of queer wellness: Understanding how systemic barriers impact individual health outcomes.",
            "The role of the wellness coach as a bridge between clinical care and community-based support."
          ]
        },
        {
          "number": 2,
          "title": "The P.R.I.S.M. Framework™: A New Paradigm",
          "outline": [
            "High-level breakdown of the five pillars: Presence, Recognition, Inner Resilience, Strategic Wellness, and Manifesting Authenticity.",
            "The science of Affirming Coaching: Integrating Minority Stress Theory with evidence-based coaching psychology.",
            "How the P.R.I.S.M. Framework™ addresses the intersection of trauma, identity, and holistic vitality.",
            "Establishing the L1 practitioner's role: Focusing on foundational safety and identity recognition.",
            "The shift from 'problem-solving' to 'identity-honoring' in the coaching container."
          ]
        },
        {
          "number": 3,
          "title": "Scope of Practice & Ethical Boundaries",
          "outline": [
            "Defining the professional boundaries: Distinguishing coaching from psychotherapy, medical advice, and crisis intervention.",
            "Navigating the 'Therapy-Coaching' line: When to refer out and how to identify clinical red flags in LGBTQ+ clients.",
            "The Ethics of Disclosure: Managing professional 'outness' and the use of lived experience in a coaching relationship.",
            "Informed Consent and Privacy: Specialized confidentiality considerations for trans and non-binary clients.",
            "Professional standards for the Certified LGBTQ+ Affirming Wellness Coach™."
          ]
        },
        {
          "number": 4,
          "title": "Crafting Your Vision as an Affirming Coach",
          "outline": [
            "Niche identification: Exploring specialized areas of focus (e.g., gender-affirming fitness, queer family planning, or neurodivergent LGBTQ+ support).",
            "Developing your 'Coach’s Manifesto': Aligning your personal values with your professional mission statement.",
            "Market analysis: Identifying the demand for specialized coaching in corporate, private, and community sectors.",
            "The Career Roadmap: Setting 1-year and 5-year goals for your affirming wellness practice.",
            "Building a sustainable career that prevents advocate burnout while maximizing community impact."
          ]
        }
      ]
    },
    {
      "number": 1,
      "title": "P: Presence & Safety",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Foundations of Affirming Presence",
          "outline": [
            "Defining Presence within the PRISM Framework™ methodology",
            "The shift from 'neutrality' to 'active affirmation' in coaching",
            "Cultivating the 'holding space' specifically for marginalized identities",
            "Distinguishing coaching presence from clinical presence in LGBTQ+ care",
            "The impact of coach authenticity on client vulnerability"
          ]
        },
        {
          "number": 2,
          "title": "The Neurobiology of Safety in the Queer Community",
          "outline": [
            "Understanding Polyvagal Theory through a minority stress lens",
            "How chronic hyper-vigilance impacts the coaching relationship",
            "Signaling safety: Verbal and non-verbal cues for LGBTQ+ clients",
            "The role of the amygdala in 'closeted' or high-vigilance states",
            "Neuroception and the client's subconscious scanning for rejection"
          ]
        },
        {
          "number": 3,
          "title": "Designing the Affirming Coaching Environment",
          "outline": [
            "Beyond the rainbow flag: Authentic environmental signaling and semiotics",
            "Gender-affirming intake forms and administrative safety protocols",
            "Digital safety: Privacy and data protection for trans and non-binary clients",
            "Navigating pronouns and name changes with administrative grace",
            "Creating inclusive physical and virtual spaces for all body types"
          ]
        },
        {
          "number": 4,
          "title": "Trauma-Informed Approaches to LGBTQ+ Wellness",
          "outline": [
            "Historical context: The legacy of medical and psychological pathologization",
            "Identifying 'clinical triggers' within a wellness coaching context",
            "The 4 R's of trauma-informed care: Realize, Recognize, Respond, Resist",
            "Building trust with clients who have experienced institutional betrayal",
            "Differentiating between coaching-appropriate trauma awareness and clinical therapy"
          ]
        },
        {
          "number": 5,
          "title": "Unconditional Positive Regard & Radical Acceptance",
          "outline": [
            "Applying Rogers' Unconditional Positive Regard to diverse gender expressions",
            "Deconstructing internal biases and the subconscious 'policing' of queer behaviors",
            "Fostering a shame-free environment for health and lifestyle discussions",
            "The impact of radical acceptance on client self-efficacy and goal attainment",
            "Techniques for maintaining regard during challenging client disclosures"
          ]
        },
        {
          "number": 6,
          "title": "Intersectionality and Power Dynamics in the Container",
          "outline": [
            "Recognizing the coach's social location and its impact on the safety 'container'",
            "Addressing racial, class, and ability intersections within the 'Presence' phase",
            "Managing the inherent power imbalance in the coach-client relationship",
            "Cultural humility vs. cultural competence in establishing rapport",
            "Strategies for repairing ruptures caused by microaggressions or bias"
          ]
        },
        {
          "number": 7,
          "title": "Ethical Safety and Professional Boundaries",
          "outline": [
            "The ethics of confidentiality and the specific risks of 'outing' a client",
            "Setting boundaries around accessibility and 'crisis' support in a coaching role",
            "Referral networks: Identifying LGBTQ+ affirming clinical and medical partners",
            "Ethical considerations for dual relationships in small or rural LGBTQ+ communities",
            "The 'Safe Exit' strategy: Closing sessions and ending the coaching relationship"
          ]
        },
        {
          "number": 8,
          "title": "Somatic Grounding and Co-Regulation Techniques",
          "outline": [
            "Using breath and body awareness to anchor the coaching session",
            "Co-regulation: The coach’s nervous system as a tool for client safety",
            "Grounding exercises tailored for clients experiencing body dysphoria",
            "Creating a 'sensory safety plan' for the coaching environment",
            "Practical tools for maintaining coach Presence during high-emotion sessions"
          ]
        }
      ]
    },
    {
      "number": 2,
      "title": "R: Recognition of Identity",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Power of Recognition: Identity as a Health Determinant",
          "outline": [
            "Defining 'Recognition' within the P.R.I.S.M. Framework™ and its role in psychological safety",
            "The neurobiology of affirmation: How identity recognition reduces cortisol and systemic inflammation",
            "Moving from 'Assumption-Based' to 'Inquiry-Based' coaching models to avoid microaggressions",
            "Introduction to the Identity Affirmation Scale (IAS) as a tool for measuring wellness progress",
            "The ethical imperative of honoring self-identification over clinical or external labeling"
          ]
        },
        {
          "number": 2,
          "title": "Mapping the Gender Landscape: Identity vs. Expression",
          "outline": [
            "Differentiating between Gender Identity (internal sense) and Gender Expression (external presentation)",
            "Understanding the 'Trans Umbrella' and the diversity of binary and non-binary trans experiences",
            "The wellness impact of Gender Euphoria: Identifying and amplifying moments of alignment",
            "Navigating the spectrum of medical, social, and legal transitions in a coaching context",
            "Techniques for affirming diverse gender expressions without reinforcing traditional stereotypes"
          ]
        },
        {
          "number": 3,
          "title": "Sexual Orientation: Navigating the Spectrum of Attraction",
          "outline": [
            "Exploring the Split Attraction Model: Differentiating between romantic and sexual orientation",
            "The wellness implications of bi-erasure, pansexual invisibility, and monosexism",
            "Understanding the Asexual and Aromantic (Ace/Aro) spectrum and its unique wellness needs",
            "Navigating sexual fluidity and the psychological impact of changing labels across the lifespan",
            "Addressing the 'Coming Out' process as a continuous journey rather than a one-time event"
          ]
        },
        {
          "number": 4,
          "title": "Intersectionality: The Multi-Dimensional Client Experience",
          "outline": [
            "Applying Kimberlé Crenshaw’s Intersectionality Framework to LGBTQ+ wellness coaching",
            "Recognizing the compounding effects of racism, ableism, and classism on LGBTQ+ health outcomes",
            "Identifying 'Internalized Dominance' and 'Internalized Oppression' within the coaching dynamic",
            "Case studies on the unique barriers faced by QTBIPOC (Queer/Trans Black, Indigenous, People of Color) clients",
            "Strategies for acknowledging systemic privilege and marginalization without disempowering the client"
          ]
        },
        {
          "number": 5,
          "title": "Cultural Humility: Honoring Lived Expertise",
          "outline": [
            "Shifting from Cultural Competence (knowledge-based) to Cultural Humility (posture-based)",
            "The 'Client as Expert' philosophy: Prioritizing lived experience over theoretical frameworks",
            "Practical techniques for asking sensitive identity-based questions using affirming language",
            "Addressing 'Coach Positionality': How the coach's own identities impact the recognition process",
            "Developing a lifelong learning practice to stay current with evolving terminology and community needs"
          ]
        },
        {
          "number": 6,
          "title": "Social Recognition: Chosen Family and Community Belonging",
          "outline": [
            "The wellness impact of social recognition: Name usage, pronoun affirmation, and social mirroring",
            "The vital role of 'Chosen Family' in mitigating the effects of biological family rejection",
            "Coaching clients through 'Inviting In' (coming out) strategies in professional and social environments",
            "Building community connections as a core intervention for reducing isolation and minority stress",
            "Navigating the complexities of 'Passing' and 'Visibility' in public spaces"
          ]
        },
        {
          "number": 7,
          "title": "Beyond the Binary: Coaching Non-Binary and GNC Clients",
          "outline": [
            "Understanding the specific wellness barriers for non-binary, agender, and gender-nonconforming (GNC) individuals",
            "Affirming non-linear transition paths and non-traditional wellness goals",
            "Deconstructing 'Binary Normativity' in health and fitness spaces (gyms, locker rooms, medical forms)",
            "Language mastery: Utilizing they/them and neopronouns with confidence and accuracy",
            "The impact of 'Misgendering' on the nervous system and strategies for repair after a mistake"
          ]
        },
        {
          "number": 8,
          "title": "Integrating Recognition into the Wellness Vision",
          "outline": [
            "Synthesizing identity exploration into actionable, identity-centered wellness goals",
            "Identifying 'Identity-Based Strengths': Resilience, creativity, and community-mindedness",
            "Transitioning from Recognition (R) to Inner Resilience (I) in the P.R.I.S.M. Framework™",
            "Creating an 'Affirming Wellness Blueprint' that honors the client's full intersectional self",
            "Developing metrics for success that prioritize authenticity over societal conformity"
          ]
        }
      ]
    },
    {
      "number": 3,
      "title": "I: Inner Resilience",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Foundations of Minority Stress Theory",
          "outline": [
            "Defining Meyer’s Minority Stress Model: Distal vs. Proximal stressors",
            "The physiological cost of chronic vigilance and 'scanning' for danger",
            "Understanding the cumulative impact of microaggressions on mental health",
            "Distinguishing between general life stress and identity-based stress",
            "The role of the coach in validating the reality of systemic stressors"
          ]
        },
        {
          "number": 2,
          "title": "Deconstructing Internalized Stigma",
          "outline": [
            "The mechanism of internalized homophobia, transphobia, and biphobia",
            "Identifying the 'Inner Oppressor': How societal bias becomes a personal inner critic",
            "The 'Internalized Oppression Loop' and its impact on self-worth and health behaviors",
            "Strategies for externalizing stigma: Moving from 'Something is wrong with me' to 'Something is wrong with the environment'",
            "Mapping the intersection of internalized stigma with other identities (race, disability, size)"
          ]
        },
        {
          "number": 3,
          "title": "The Physiology of Queer Resilience",
          "outline": [
            "The Autonomic Nervous System and the LGBTQ+ experience of hypervigilance",
            "Polyvagal Theory: Understanding the 'freeze' state in response to social rejection",
            "The Window of Tolerance: Helping clients expand their capacity for emotional regulation",
            "Somatic markers of minority stress: Where the body carries identity-based trauma",
            "Breathwork and grounding techniques specifically adapted for gender dysphoria and social anxiety"
          ]
        },
        {
          "number": 4,
          "title": "Cognitive Reframing & Affirming Narratives",
          "outline": [
            "Identifying common cognitive distortions in LGBTQ+ populations (e.g., 'The Imposter Syndrome')",
            "Challenging 'Coming Out' scripts: Reframing 'inviting in' as an act of agency",
            "Narrative Coaching: Rewriting stories of victimhood into stories of survival and resistance",
            "The 'Affirmative Lens': Helping clients view their unique history as a source of strength",
            "Tools for auditing internal dialogue for cis-heteronormative biases"
          ]
        },
        {
          "number": 5,
          "title": "Cultivating Radical Self-Compassion",
          "outline": [
            "The three pillars of Self-Compassion (Neff) adapted for LGBTQ+ resilience",
            "Common Humanity: Breaking the isolation of the 'only one' experience",
            "Mindfulness vs. Over-identification with painful identity-based emotions",
            "Self-Kindness as a political act of resistance against a marginalizing society",
            "Practical rituals for building self-acceptance during transition or discovery phases"
          ]
        },
        {
          "number": 6,
          "title": "Emotional Regulation in a Hostile World",
          "outline": [
            "Developing 'Boundary Resilience': Protecting emotional energy in non-affirming spaces",
            "The 'Pause and Pivot' technique for managing immediate reactions to microaggressions",
            "Distinguishing between physical safety threats and psychological discomfort",
            "Emotional regulation tools for 'The Double Life': Managing stress when not fully out",
            "Building a 'Resilience Toolkit' for navigating medical, legal, or family-related stress"
          ]
        },
        {
          "number": 7,
          "title": "Moving from Shame to Authenticity",
          "outline": [
            "The psychology of shame: How it differs from guilt in the LGBTQ+ context",
            "Shame Resilience Theory (Brown) applied to gender and sexual identity",
            "The 'Authenticity Gap': Measuring the distance between the public self and private self",
            "Fostering identity-based self-esteem and the courage to be visible",
            "Coaching clients through the 'Shame Spiral' after social rejection or 'outing'"
          ]
        },
        {
          "number": 8,
          "title": "The Power of Queer Joy as Resistance",
          "outline": [
            "Defining 'Queer Joy' as a core component of long-term wellness and resilience",
            "The concept of 'Gender Euphoria' and its role in mental health maintenance",
            "Joy Portfolios: Identifying activities that foster connection, pride, and celebration",
            "Transitioning from a 'Surviving' mindset to a 'Thriving' mindset in coaching",
            "Integrating resilience practices into a sustainable, daily wellness routine"
          ]
        }
      ]
    },
    {
      "number": 4,
      "title": "S: Strategic Wellness",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Introduction to Strategic Wellness within the PRISM Framework™",
          "outline": [
            "Defining 'Strategic Wellness' as the bridge between inner resilience and external action",
            "The Three Pillars of Strategic Wellness: Physical, Mental, and Social integration",
            "Transitioning from a 'survival' mindset to a 'thriving' proactive health strategy",
            "The coach’s role in facilitating personalized health navigation without providing medical advice",
            "Assessing current wellness baselines using the LGBTQ+ Affirming Wellness Audit"
          ]
        },
        {
          "number": 2,
          "title": "Navigating Gender-Affirming Care (GAC) Pathways",
          "outline": [
            "Understanding the spectrum of gender-affirming care: Social, Medical, and Surgical",
            "The physiological impacts of Hormone Replacement Therapy (HRT) on wellness goals",
            "Coaching through the surgical timeline: Pre-operative preparation and post-operative recovery",
            "Coordinating care with medical providers and mental health professionals",
            "Managing client expectations and timelines within the medical system"
          ]
        },
        {
          "number": 3,
          "title": "Metabolic Health and Affirming Nutrition",
          "outline": [
            "How testosterone and estrogen HRT shift metabolic rates and body composition",
            "Addressing the high prevalence of disordered eating and 'body checking' in the LGBTQ+ community",
            "Implementing Body Neutrality and Health At Every Size (HAES) principles in coaching",
            "Nutritional strategies for supporting hormonal balance and bone density",
            "Deconstructing 'diet culture' and its specific impact on queer and trans bodies"
          ]
        },
        {
          "number": 4,
          "title": "Affirming Movement and Fitness Strategy",
          "outline": [
            "Identifying barriers to physical activity: Gym anxiety, locker room dysphoria, and binder safety",
            "Designing movement plans that align with gender-affirming aesthetic goals (masculinization/feminization)",
            "Post-surgical exercise modifications and gentle reintegration techniques",
            "The role of movement in managing minority stress and emotional regulation",
            "Creating a 'Safe Space' fitness toolkit for home and public environments"
          ]
        },
        {
          "number": 5,
          "title": "Sexual Wellness and Intimate Health",
          "outline": [
            "Redefining sexual health as a core component of holistic wellness",
            "Navigating changes in libido and sexual function during hormonal transitions",
            "Communication strategies for discussing identity and boundaries with partners",
            "Addressing the impact of dysphoria on intimacy and body connection",
            "Affirming sexual health education and risk-reduction strategies for the LGBTQ+ community"
          ]
        },
        {
          "number": 6,
          "title": "Sleep Science and Nervous System Regulation",
          "outline": [
            "The impact of hypervigilance and minority stress on sleep architecture and REM cycles",
            "Managing sleep disruptions related to HRT (night sweats, hot flashes, and insomnia)",
            "Evening rituals for down-regulating the sympathetic nervous system",
            "Optimizing the sleep environment for comfort during physical transitions or binder use",
            "The link between restorative sleep and long-term emotional resilience"
          ]
        },
        {
          "number": 7,
          "title": "Social Wellness: Chosen Family and Community Connection",
          "outline": [
            "The health-protective benefits of 'Chosen Family' and community belonging",
            "Strategic boundary setting with biological family and unsupportive social circles",
            "Navigating social transitions in the workplace and public spheres",
            "Addressing 'loneliness' as a clinical health risk in the aging LGBTQ+ population",
            "Building a social support map to ensure long-term wellness sustainability"
          ]
        },
        {
          "number": 8,
          "title": "The Strategic Wellness Plan (SWP) Blueprint",
          "outline": [
            "Integrating the Physical, Mental, and Social pillars into a cohesive 90-day plan",
            "Setting SMART goals that honor gender-affirming milestones",
            "Identifying 'Wellness Facilitators' and 'Wellness Inhibitors' in the client’s environment",
            "The iterative coaching process: Monitoring, adjusting, and celebrating progress",
            "Case Study: Developing a comprehensive SWP for a client beginning medical transition"
          ]
        }
      ]
    },
    {
      "number": 5,
      "title": "M: Manifesting Authenticity",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Psychology of Authentic Manifestation",
          "outline": [
            "Defining 'Manifesting Authenticity' within the P.R.I.S.M. Framework™",
            "The psychological shift from internal acceptance to external expression",
            "Understanding the 'Visibility-Safety Paradox' in LGBTQ+ wellness",
            "The impact of authentic living on long-term cortisol levels and mental health",
            "Goal setting for external identity alignment and congruent living"
          ]
        },
        {
          "number": 2,
          "title": "Navigating the Disclosure Continuum",
          "outline": [
            "Moving beyond the binary of 'in' or 'out' of the closet",
            "Tools for assessing risk and safety in different social and professional domains",
            "The 'Selective Authenticity' strategy for energy preservation and protection",
            "Coaching clients through the emotional labor of recurring coming-out conversations",
            "Developing personalized disclosure scripts for various life stages"
          ]
        },
        {
          "number": 3,
          "title": "Cultivating Chosen Family and Community Connection",
          "outline": [
            "The clinical significance of 'Chosen Family' in mitigating minority stress",
            "Identifying and vetting queer-affirming spaces and social networks",
            "Strategies for overcoming social isolation and 'lonely authenticity'",
            "The role of intergenerational mentorship in the LGBTQ+ experience",
            "Building a 'Community Care' map as part of the wellness plan"
          ]
        },
        {
          "number": 4,
          "title": "Authentic Self-Expression and Body Euphoria",
          "outline": [
            "Deconstructing cisnormative and heteronormative beauty standards",
            "Distinguishing between gender euphoria and the absence of dysphoria",
            "Using movement, fashion, and grooming as tools for authentic manifestation",
            "Coaching clients through 'imposter syndrome' regarding their own identity",
            "The intersection of body neutrality and queer identity expression"
          ]
        },
        {
          "number": 5,
          "title": "Self-Advocacy in Professional and Healthcare Systems",
          "outline": [
            "Navigating systemic bias in medical, legal, and corporate environments",
            "Assertive communication techniques for addressing misgendering and microaggressions",
            "Evaluating workplace culture and understanding DEI (Diversity, Equity, and Inclusion) rights",
            "Empowering clients to lead their own multidisciplinary care teams",
            "Resources for legal protections and affirming healthcare navigation"
          ]
        },
        {
          "number": 6,
          "title": "Reconciling Cultural and Spiritual Identity",
          "outline": [
            "Addressing religious trauma and the process of spiritual reclamation",
            "Integrating queer identity with ethnic and cultural heritage",
            "The role of ritual and ceremony in manifesting a new self-concept",
            "Finding 'Sacred Space' in both secular and non-secular environments",
            "Coaching strategies for clients facing 'Double Consciousness' in minority communities"
          ]
        },
        {
          "number": 7,
          "title": "Joy as Resistance: Maintaining Visibility Stamina",
          "outline": [
            "The psychological impact of political and social hostility on authenticity",
            "Defining 'Joy as Resistance' as a core wellness philosophy",
            "Digital authenticity: Navigating social media visibility and online safety",
            "Balancing social activism with radical self-care and rest",
            "Developing a 'Visibility Stamina' plan for long-term resilience"
          ]
        },
        {
          "number": 8,
          "title": "Legacy, Mentorship, and the Authenticity Maintenance Plan",
          "outline": [
            "The transition from seeking support to providing community mentorship",
            "Creating a 12-month 'Authenticity Maintenance Plan' (AMP)",
            "Celebrating milestones: Anniversaries of transition, disclosure, and growth",
            "The 'Pay it Forward' model of LGBTQ+ wellness coaching",
            "Finalizing the P.R.I.S.M. Framework™ journey and sustaining transformation"
          ]
        }
      ]
    },
    {
      "number": 6,
      "title": "L1 Deep Dive Module 6: Manifesting Authenticity",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Foundations of Manifesting Authenticity",
          "outline": [
            "Defining 'Manifesting Authenticity' within the PRISM Framework™ and its role in long-term wellness.",
            "The psychological and physiological costs of 'masking,' 'covering,' and 'code-switching.'",
            "Transitioning from survival-based identity (coping) to thrive-based identity (flourishing).",
            "Assessing 'Identity Congruence'—the alignment between internal self and external expression.",
            "The role of the coach in mirroring and validating the client’s emergent authentic self."
          ]
        },
        {
          "number": 2,
          "title": "Navigating the Lifetime Journey of Disclosure",
          "outline": [
            "Deconstructing the myth of 'Coming Out' as a one-time event vs. a non-linear, lifelong process.",
            "Decision-making frameworks for disclosure: Assessing safety, readiness, and emotional ROI.",
            "Managing 'Disclosure Fatigue' and the emotional labor of educating others.",
            "Coaching clients through various outcomes of disclosure: From celebration to rejection.",
            "Strategies for reclaiming personal narratives after forced or accidental disclosure."
          ]
        },
        {
          "number": 3,
          "title": "Cultivating Chosen Family and Social Ecosystems",
          "outline": [
            "The historical and clinical significance of 'Chosen Family' in LGBTQ+ resilience.",
            "Mapping social ecosystems: Identifying toxic, neutral, and affirming influences.",
            "Strategies for finding and integrating into local and digital queer communities.",
            "The role of mentorship and intergenerational connection in fostering a sense of belonging.",
            "Coaching techniques for building social confidence and overcoming community-based anxiety."
          ]
        },
        {
          "number": 4,
          "title": "Professional Authenticity and Workplace Advocacy",
          "outline": [
            "Navigating professional identity and the decision to be 'out' in various industries.",
            "Communication scripts and strategies for setting boundaries regarding pronouns and identity at work.",
            "Evaluating workplace culture: Identifying green flags and red flags for LGBTQ+ inclusion.",
            "Rights and self-advocacy: Empowering clients to utilize HR resources and legal protections.",
            "Balancing professional ambition with the need for an affirming work environment."
          ]
        },
        {
          "number": 5,
          "title": "Medical and Institutional Self-Advocacy",
          "outline": [
            "Empowering clients to navigate heteronormative and cisnormative healthcare systems.",
            "Tools for vetting and selecting affirming medical, mental health, and wellness providers.",
            "The 'Manifesting Authenticity' approach to institutional gatekeeping and administrative barriers.",
            "Practical scripts for correcting providers and advocating for gender-affirming care standards.",
            "Integrating medical advocacy into the client’s broader Strategic Wellness plan."
          ]
        },
        {
          "number": 6,
          "title": "Living Visibly: Safety, Sovereignty, and Boundaries",
          "outline": [
            "The 'Visibility Spectrum': Balancing the desire for authenticity with physical and emotional safety.",
            "Digital visibility: Managing social media, online privacy, and 'digital footprints.'",
            "Setting 'Authenticity Boundaries' with biological family and pre-transition social circles.",
            "The concept of 'Identity Sovereignty'—owning the right to share or withhold one's story.",
            "Managing the 'Hyper-visibility' vs. 'Invisibility' paradox in public spaces."
          ]
        },
        {
          "number": 7,
          "title": "Joy as Resistance: Cultivating Queer Excellence",
          "outline": [
            "Moving beyond trauma-centric coaching: The clinical importance of 'Queer Joy.'",
            "Defining and cultivating 'Gender Euphoria' and identity-based pride.",
            "The role of creativity, play, and aesthetic expression in manifesting the authentic self.",
            "Celebrating 'Queer Excellence': Highlighting personal triumphs and community contributions.",
            "Techniques for sustaining a positive self-concept in the face of external sociopolitical stress."
          ]
        },
        {
          "number": 8,
          "title": "The Authenticity Roadmap: Long-Term Integration",
          "outline": [
            "Synthesizing the five previous PRISM pillars into a cohesive, long-term Authenticity Roadmap.",
            "Developing a 'Sustainability Plan' for maintaining authenticity during life transitions.",
            "Measuring success: Utilizing Subjective Well-Being (SWB) scales and identity congruence markers.",
            "Preparing the client for self-advocacy beyond the coaching relationship.",
            "Finalizing the L1 Deep Dive: Transitioning from foundational knowledge to advanced application."
          ]
        }
      ]
    },
    {
      "number": 7,
      "title": "L1 Deep Dive Module 7: Manifesting Authenticity & Community Advocacy",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Architecture of Authenticity",
          "outline": [
            "Defining 'Manifesting Authenticity' as the final pillar of the PRISM Framework™ and its role in long-term wellness.",
            "The psychological impact of congruence: Analyzing the relationship between internal identity and external expression.",
            "Identifying and dismantling external barriers to visibility: Safety assessments, social risk, and environmental factors.",
            "The 'Authenticity Spectrum' coaching tool: Understanding that visibility is a personal choice rather than a wellness requirement.",
            "Neurobiological benefits of living authentically: Reduced cortisol levels and improved executive function."
          ]
        },
        {
          "number": 2,
          "title": "Navigating Social Transition & Visibility Strategies",
          "outline": [
            "Strategic wellness planning for the 'Coming Out' process across various life stages and social contexts.",
            "Boundary setting 101: Managing pronouns, name changes, and personal history in public and private spheres.",
            "Addressing 'Emotional Labor': Strategies for clients to balance the desire to educate others with the need for self-preservation.",
            "Case studies on navigating visibility in high-stakes or conservative environments while maintaining psychological safety.",
            "The role of 'Incremental Disclosure' in building confidence and testing social safety nets."
          ]
        },
        {
          "number": 3,
          "title": "The Power of Chosen Family & Social Capital",
          "outline": [
            "The 'Chosen Family' model: Historical context and its modern role in mitigating minority stress and isolation.",
            "Strategies for building community infrastructure when biological family support is absent or conditional.",
            "Statistical analysis: The correlation between social connectivity and reduced rates of depression/suicidality in LGBTQ+ populations.",
            "Coaching techniques for identifying 'safe' vs. 'affirming' social networks and fostering deeper community bonds.",
            "Navigating conflict within LGBTQ+ spaces: Maintaining wellness in the face of community lateral violence."
          ]
        },
        {
          "number": 4,
          "title": "Empowered Self-Advocacy in Clinical Settings",
          "outline": [
            "Identifying and addressing medical gaslighting, 'Trans-broken arm syndrome,' and provider bias.",
            "The 'Affirming Care Checklist': Preparing clients for medical appointments to ensure their needs are met effectively.",
            "Navigating the logistics of gender-affirming care: Insurance navigation, legal rights, and finding competent providers.",
            "Role-playing advocacy: Scripts for correcting misgendering or challenging inadequate care in real-time.",
            "Building a 'Healthcare Support Team': Integrating clinical providers with the coach's wellness plan."
          ]
        },
        {
          "number": 5,
          "title": "Professional Vitality & Workplace Authenticity",
          "outline": [
            "The 'Professional Closet' vs. 'Authentic Presence': Evaluating the impact of workplace concealment on career burnout.",
            "Navigating corporate culture: Strategies for coming out to HR, management, and colleagues.",
            "Addressing microaggressions and the 'Glass Closet' in professional advancement and leadership roles.",
            "Legal literacy for coaches: Understanding EEOC protections and local labor laws regarding LGBTQ+ identity.",
            "Designing a workplace wellness plan that accounts for specific minority stressors in professional environments."
          ]
        },
        {
          "number": 6,
          "title": "Digital Resilience & Online Community Safety",
          "outline": [
            "The dual nature of the internet: Identity formation tool vs. source of digital minority stress and harassment.",
            "Managing 'Doomscrolling' and the psychological impact of legislative or social media-driven anti-LGBTQ+ rhetoric.",
            "Privacy and Digital Hygiene: Helping clients protect their identity and safety while seeking online community resources.",
            "Leveraging digital spaces for wellness: App-based support, global networking, and finding niche affirming communities.",
            "Coaching clients through 'Digital Detox' periods during times of high societal tension."
          ]
        },
        {
          "number": 7,
          "title": "Intergenerational Resilience & The Generational Bridge",
          "outline": [
            "The 'Generational Bridge' concept: Fostering wellness through connections between LGBTQ+ elders and youth.",
            "Combating ageism and isolation within the LGBTQ+ community through intergenerational mentorship models.",
            "The wellness benefits of 'Legacy Work': How understanding LGBTQ+ history builds current-day resilience and identity pride.",
            "Mentorship as a wellness tool: The psychological benefits of both being a mentor and finding a mentor within the community.",
            "Case studies on successful intergenerational programs and their impact on community health metrics."
          ]
        },
        {
          "number": 8,
          "title": "Sustaining the PRISM Path: Long-term Integration",
          "outline": [
            "Synthesizing the P.R.I.S.M. Framework™: Creating a unified, lifelong wellness strategy for the client.",
            "Developing the 'Wellness Crisis Plan': Proactive steps for maintaining health during periods of intense social or personal stress.",
            "Measuring success beyond clinical markers: Introducing 'Joy-Based Metrics' and 'Authenticity Milestones.'",
            "The transition from coaching to self-advocacy: Empowering the client to become their own primary wellness navigator.",
            "Finalizing the L1 Deep Dive: Review of core competencies and preparation for L2 advanced application."
          ]
        }
      ]
    },
    {
      "number": 8,
      "title": "L1 Deep Dive Module 8: Manifesting Authenticity & Sustainable Advocacy",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The 'M' in PRISM: Defining Authenticity in a Cisheteronormative World",
          "outline": [
            "Defining Manifesting Authenticity within the P.R.I.S.M. Framework™",
            "The 'Authenticity Gap': Identifying the distance between public persona and private identity",
            "The neurobiology of masking: The cognitive load of 'passing' and code-switching",
            "Safety-First Visibility: Assessing environmental risks vs. the psychological benefits of living openly",
            "Integrating the previous four PRISM stages into a cohesive authentic identity"
          ]
        },
        {
          "number": 2,
          "title": "Developing the Authentic Self-Narrative",
          "outline": [
            "Narrative coaching techniques: Moving from a 'victim' to 'hero' story arc",
            "Deconstructing 'The Script': Identifying cisheteronormative expectations in the client's life",
            "Empowerment through personal history: Reframing past struggles as milestones of resilience",
            "Creating the 'Authentic Blueprint': A visual tool for mapping values and identity",
            "Techniques for rewriting internalized transphobic or homophobic scripts"
          ]
        },
        {
          "number": 3,
          "title": "Community Connection and Social Wellness",
          "outline": [
            "The vital role of 'Chosen Family' in LGBTQ+ mental health and longevity",
            "Mitigating social isolation: Strategies for finding and vetting safe community spaces",
            "Intergenerational connection: The importance of queer mentorship and elder wisdom",
            "Digital vs. Physical safe spaces: Navigating the pros and cons of online community building",
            "Coaching clients through 'community fatigue' and lateral violence within the LGBTQ+ population"
          ]
        },
        {
          "number": 4,
          "title": "Long-term Self-Advocacy in Healthcare and Systems",
          "outline": [
            "Navigating heteronormative systems: Strategies for medical, legal, and corporate environments",
            "The 'Advocacy Toolkit': Practical scripts for addressing misgendering or bias in professional settings",
            "Collaborative care: How coaches can support clients in building a culturally competent wellness team",
            "Workplace wellness: Coaching clients through the process of requesting accommodations or transitions",
            "Empowering the client as an expert on their own body and identity"
          ]
        },
        {
          "number": 5,
          "title": "Living Visibly: The Ethics and Strategy of Disclosure",
          "outline": [
            "Coming out as a lifelong, non-linear process rather than a one-time event",
            "The 'Safety-Authenticity Spectrum': Helping clients determine their personal comfort levels",
            "Managing Rejection Sensitivity Dysphoria (RSD) during the disclosure process",
            "Boundary-setting as a form of self-care: When to share and when to protect the authentic self",
            "Developing 'Disclosure Scripts' for different social circles (family, friends, work)"
          ]
        },
        {
          "number": 6,
          "title": "Cultivating LGBTQ+ Joy as Radical Resistance",
          "outline": [
            "Defining 'Queer Joy': Moving beyond trauma-informed care to joy-centered coaching",
            "The science of positive affect: How joy acts as a buffer against minority stress",
            "Radical celebration: Finding euphoria in gender expression and identity milestones",
            "Actionable steps for joy-seeking: Incorporating play, creativity, and queer art into wellness plans",
            "The neurobiology of belonging and its impact on long-term physiological health"
          ]
        },
        {
          "number": 7,
          "title": "Sustaining the PRISM Framework™ Post-Coaching",
          "outline": [
            "Long-term wellness maintenance: Moving from intensive coaching to self-directed growth",
            "Identifying 'Stress Triggers': Building an early warning system for minority stress spikes",
            "The PRISM Maintenance Plan: Creating daily rituals that reinforce identity and safety",
            "Building a 'Wellness Altar': Physical and psychological anchors for the client's journey",
            "Relapse prevention: Managing setbacks in self-esteem and social confidence"
          ]
        },
        {
          "number": 8,
          "title": "The Affirming Coach's Path: Professional Integrity and L1 Synthesis",
          "outline": [
            "Final synthesis of L1 competencies: Integrating Presence, Recognition, Resilience, Strategy, and Authenticity",
            "Scope of practice for Level 1 Coaches: Knowing when to refer to clinical or legal professionals",
            "Ethics of the coaching relationship: Maintaining boundaries while providing deep affirmation",
            "Continuing education: Creating a personal development plan for LGBTQ+ cultural humility",
            "The role of peer supervision and consultation in preventing coach burnout"
          ]
        }
      ]
    },
    {
      "number": 9,
      "title": "L1 Deep Dive Module 9",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Intersectional Identity Mapping",
          "outline": [
            "Applying Kimberlé Crenshaw’s intersectionality framework within the 'Recognition of Identity' (R) stage of PRISM.",
            "Identifying overlapping systems of oppression (racism, ableism, classism) and their impact on LGBTQ+ wellness outcomes.",
            "Tools for mapping a client's unique identity intersections to identify specific resilience factors.",
            "Addressing 'blind spots' in the coaching container for QTBIPOC and disabled queer clients.",
            "Case study: Navigating wellness for a transgender person of color in a rural environment."
          ]
        },
        {
          "number": 2,
          "title": "Somatic Presence and Trauma-Informed Safety",
          "outline": [
            "Deepening 'Presence & Safety' (P) through somatic coaching techniques tailored for gender dysphoria.",
            "Understanding the neurobiology of minority stress and its manifestation in the physical body.",
            "Implementing grounding exercises and 'safe body' anchors for clients experiencing hyper-vigilance.",
            "Establishing clear boundaries and 'consent-based' coaching structures to prevent re-traumatization.",
            "Techniques for coaching clients through acute episodes of social or political triggers."
          ]
        },
        {
          "number": 3,
          "title": "Deconstructing Internalized Erasure and Stigma",
          "outline": [
            "Advanced 'Inner Resilience' (I) strategies for overcoming internalized homophobia and transphobia.",
            "Addressing the 'invisible' trauma of bisexual, pansexual, and asexual erasure within and outside the community.",
            "Cognitive restructuring techniques for dismantling the 'binary' internal critic.",
            "Building self-compassion as a foundational tool for emotional regulation.",
            "The role of 'radical self-acceptance' in the journey from surviving to thriving."
          ]
        },
        {
          "number": 4,
          "title": "Strategic Wellness for Medical and Social Transition",
          "outline": [
            "Developing 'Strategic Wellness' (S) plans for clients navigating Hormone Replacement Therapy (HRT) or gender-affirming surgeries.",
            "Coaching on the emotional and physical 'second puberty' and managing expectations during transition.",
            "Collaboration protocols: How wellness coaches work alongside medical and mental health professionals.",
            "Nutritional and movement considerations that honor gender-affirming goals without promoting body dysmorphia.",
            "Managing the social 'coming out' process as a component of a holistic wellness plan."
          ]
        },
        {
          "number": 5,
          "title": "Neuro-Queer Wellness: Intersecting Neurodiversity",
          "outline": [
            "Exploring the statistical and lived connection between neurodivergence (ADHD, Autism) and LGBTQ+ identities.",
            "Adapting the PRISM framework for neuro-atypical communication styles and executive function needs.",
            "Creating sensory-friendly wellness environments and routines for neuro-queer clients.",
            "Addressing 'masking' as a dual burden for neurodivergent LGBTQ+ individuals.",
            "Strategic wellness planning for burnout prevention in neuro-queer populations."
          ]
        },
        {
          "number": 6,
          "title": "Family Dynamics and Chosen Family Integration",
          "outline": [
            "Applying 'Presence & Safety' (P) when coaching clients through family rejection or estrangement.",
            "The wellness benefits of 'Chosen Family' and how to help clients build intentional community support.",
            "Coaching LGBTQ+ parents: Navigating the unique stressors of queer family building and child-rearing.",
            "Conflict resolution strategies for non-traditional relationship structures (polyamory, ethical non-monogamy).",
            "Developing a 'Social Support Map' as part of the Strategic Wellness (S) process."
          ]
        },
        {
          "number": 7,
          "title": "Workplace Advocacy and Career Wellness",
          "outline": [
            "Applying 'Manifesting Authenticity' (M) in professional environments and corporate structures.",
            "Coaching clients on professional 'coming out' decisions and navigating workplace microaggressions.",
            "Identifying LGBTQ-affirming employers and evaluating corporate 'pinkwashing' vs. genuine support.",
            "Stress management techniques for 'The Only' (being the only LGBTQ+ person in a professional space).",
            "Building career resilience and self-advocacy skills for long-term professional wellness."
          ]
        },
        {
          "number": 8,
          "title": "Legacy and Community: The Pinnacle of Authenticity",
          "outline": [
            "Finalizing the 'Manifesting Authenticity' (M) stage through community contribution and mentorship.",
            "Transitioning from client-focused wellness to community-focused advocacy and leadership.",
            "The impact of 'Aging with Pride': Addressing the unique wellness needs of LGBTQ+ seniors.",
            "Developing a 12-month 'Authentic Life' roadmap for sustained long-term wellness.",
            "Summary of the PRISM Framework™ application for Level 1 Deep Dive mastery."
          ]
        }
      ]
    },
    {
      "number": 10,
      "title": "L1 Deep Dive Module 10: Integrative PRISM™ Practice & Professional Excellence",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Synthesizing the PRISM™ Framework for Holistic Success",
          "outline": [
            "The Iterative Cycle: Moving from Presence (P) to Manifestation (M) and back again",
            "Case Conceptualization: Using the PRISM™ lens to identify client growth barriers",
            "Framework Integration: How Strategic Wellness (S) fuels Inner Resilience (I)",
            "Measuring Outcomes: Qualitative and quantitative markers of affirming coaching success"
          ]
        },
        {
          "number": 2,
          "title": "Advanced Presence (P): De-escalation and Crisis Safety",
          "outline": [
            "Recognizing 'Micro-Trauma' triggers within the coaching session",
            "Advanced de-escalation techniques for clients experiencing gender-based harassment",
            "Power Dynamics: Mitigating the 'Expert' role to maintain a collaborative container",
            "Creating 'Braver Spaces': Moving beyond safety toward courageous self-exploration"
          ]
        },
        {
          "number": 3,
          "title": "Deepening Recognition (R): Navigating Complex Intersectionality",
          "outline": [
            "Advanced Identity Mapping: Exploring the overlap of race, disability, and neurodivergence",
            "Coaching through 'Late-in-Life' realizations and multi-stage coming out processes",
            "Cultural Humility vs. Competence: Addressing the coach's own blind spots",
            "Navigating 'Gatekeeping' Trauma: Healing from restrictive medical and legal systems"
          ]
        },
        {
          "number": 4,
          "title": "Inner Resilience (I): Somatic Tools for Minority Stress",
          "outline": [
            "The Physiology of Oppression: How chronic minority stress impacts the nervous system",
            "Somatic Reframing: Moving trauma out of the body through affirming movement",
            "Deconstructing Internalized Stigma: Advanced cognitive behavioral coaching techniques",
            "Cultivating 'Queer Joy' as a primary metric of emotional resilience"
          ]
        },
        {
          "number": 5,
          "title": "Precision Strategic Wellness (S): Clinical Collaboration",
          "outline": [
            "Wellness Support for HRT: Managing energy, mood, and metabolic shifts",
            "Pre- and Post-Operative Coaching: Holistic preparation for gender-affirming surgeries",
            "Navigating Dysphoria in Fitness: Creating gender-neutral movement strategies",
            "Interprofessional Communication: Working effectively with therapists and endocrinologists"
          ]
        },
        {
          "number": 6,
          "title": "Manifesting Authenticity (M): Professional and Social Transitions",
          "outline": [
            "The Authenticity Loop: Integrating 'Outness' in professional and corporate environments",
            "Navigating Family Dynamics: Coaching through the 'Family of Origin' vs. 'Family of Choice' shift",
            "Leadership Development: Empowering clients to become community advocates and mentors",
            "Visibility Management: Strategic decisions around safety and disclosure in public spaces"
          ]
        },
        {
          "number": 7,
          "title": "Ethical Boundaries and Scope of Practice in Affirming Care",
          "outline": [
            "The Coaching/Therapy Divide: Identifying when to refer out for clinical mental health",
            "Confidentiality in Small Communities: Managing dual relationships in LGBTQ+ circles",
            "Legal Protections: Understanding affirming care mandates and coaching regulations",
            "Crisis Protocols: Ethical handling of self-harm or domestic violence disclosures"
          ]
        },
        {
          "number": 8,
          "title": "Sustaining the Affirming Practice: Coach Longevity",
          "outline": [
            "Mitigating Vicarious Trauma: Self-regulation strategies for the affirming coach",
            "Building Peer Supervision: The importance of community for the practitioner",
            "Continuing Education: Staying current with evolving terminology and medical standards",
            "The Sustainable Business Model: Balancing accessibility with professional value"
          ]
        }
      ]
    },
    {
      "number": 11,
      "title": "L1 Deep Dive Module 11: Body Autonomy & Affirming Physical Wellness",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Neurobiology of Minority Stress and Body Image",
          "outline": [
            "Analyzing the 'Protection Hypothesis': How marginalized bodies utilize weight or physical presentation as a subconscious safety mechanism.",
            "The impact of chronic cortisol elevation on metabolic health and fat distribution in LGBTQ+ populations.",
            "Deconstructing the 'Adonis Complex' and 'Thin Ideal' within specific queer subcultures (MSM and WLW).",
            "Applying the Inner Resilience (I) pillar to de-link self-worth from sociocultural body standards.",
            "Case study: Navigating body hyper-vigilance in a non-binary client."
          ]
        },
        {
          "number": 2,
          "title": "Distinguishing Gender Dysphoria from Body Dysmorphia",
          "outline": [
            "Clinical definitions vs. coaching boundaries: Identifying when to refer to specialized mental health professionals.",
            "The P.R.I.S.M. approach to 'Body Neutrality' as a bridge for clients experiencing intense dysphoria.",
            "Language shifts: Moving from 'fixing' body parts to 'affirming' physiological functions.",
            "Using Recognition of Identity (R) to validate the unique physical needs of transitioning bodies.",
            "Practical tools for coaching clients through 'bad body days' without reinforcing stigma."
          ]
        },
        {
          "number": 3,
          "title": "Affirming Nutritional Support and Eating Disorder Awareness",
          "outline": [
            "Statistically significant disparities: Why ED prevalence is 2-4x higher in LGBTQ+ youth and adults.",
            "Integrating 'Health at Every Size' (HAES) principles with gender-affirming care goals.",
            "Identifying 'Gender-Affirming Restriction': When disordered eating is used to suppress secondary sex characteristics.",
            "Coaching strategies for intuitive eating that respect the client's transition-related nutritional needs.",
            "Creating a Strategic Wellness (S) plan that prioritizes nourishment over aesthetic control."
          ]
        },
        {
          "number": 4,
          "title": "Inclusive Fitness: Breaking Barriers to Movement",
          "outline": [
            "Environmental audit: Identifying 'gendered' gym triggers and locker room anxiety.",
            "Designing 'Dysphoria-Friendly' movement plans (home-based vs. queer-safe commercial spaces).",
            "The role of strength training in Manifesting Authenticity (M) and physical empowerment.",
            "Coaching clients on 'Binder Safety' and cardiovascular health during physical activity.",
            "Building a referral network of LGBTQ+ affirming personal trainers and yoga instructors."
          ]
        },
        {
          "number": 5,
          "title": "Medical Advocacy and Navigating Healthcare Bias",
          "outline": [
            "Understanding 'Trans-Broken Arm Syndrome' and its impact on LGBTQ+ wellness outcomes.",
            "The Strategic Wellness (S) toolkit for preparing clients for medical appointments and bloodwork.",
            "Coaching clients through 'Medical Fatphobia' and advocating for weight-neutral diagnostic care.",
            "Role-playing self-advocacy scripts for the doctor’s office using the Presence & Safety (P) pillar.",
            "Managing the emotional 'hangover' of medical gaslighting and clinical trauma."
          ]
        },
        {
          "number": 6,
          "title": "Hormonal Health: Coaching Through 'Second Puberty'",
          "outline": [
            "Physiological changes and wellness considerations for Hormone Replacement Therapy (HRT).",
            "Supporting clients through the emotional volatility and metabolic shifts of hormonal transition.",
            "Strategic Wellness (S) for bone density, cardiovascular health, and lipid profiles on HRT.",
            "Addressing the 'Puberty Gap': Coaching adult clients through adolescent-style identity shifts.",
            "Manifesting Authenticity (M) through the celebration of gradual physical changes."
          ]
        },
        {
          "number": 7,
          "title": "Surgical Recovery and Holistic Post-Op Support",
          "outline": [
            "Pre-habilitation: Preparing the body and mind for gender-affirming surgical interventions.",
            "The coach’s role in post-operative wellness: Nutrition, lymphatic support, and movement pacing.",
            "Navigating 'Post-Op Depression' and the complex emotional landscape of surgical outcomes.",
            "Integrating the P.R.I.S.M. framework to manage expectations and celebrate milestone healing.",
            "Case study: Supporting a client through the 6-month recovery arc of 'Top Surgery'."
          ]
        },
        {
          "number": 8,
          "title": "Synthesizing Body Autonomy into the P.R.I.S.M. Framework",
          "outline": [
            "Developing a long-term 'Body Autonomy Ritual' for sustained physical self-advocacy.",
            "Moving from 'Body Image' to 'Body Embodiment': The final stage of Manifesting Authenticity (M).",
            "Reviewing the intersection of all five PRISM pillars in the context of physical health.",
            "Creating a client-facing 'Wellness Manifesto' that honors their specific physical journey.",
            "Final Module Assessment: Applying the framework to complex intersectional body-wellness cases."
          ]
        }
      ]
    },
    {
      "number": 12,
      "title": "L1 Deep Dive Module 12: The Integrative PRISM Practitioner",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Holistic Integration: Sequencing the PRISM Framework",
          "outline": [
            "Mapping the longitudinal coaching journey using all five PRISM pillars",
            "Identifying common 'stuck points' between Inner Resilience (I) and Strategic Wellness (S)",
            "Adapting the framework pace for clients in different stages of transition or discovery",
            "Utilizing the PRISM Assessment Tool to measure baseline and progress"
          ]
        },
        {
          "number": 2,
          "title": "Advanced Presence: Somatic Safety and Co-Regulation",
          "outline": [
            "The neurobiology of safety: Applying Polyvagal Theory to LGBTQ+ coaching 'Presence'",
            "Recognizing and managing countertransference in affirming practitioners",
            "Advanced techniques for maintaining a 'neutral yet affirming' container during client dysregulation",
            "The role of silence and non-verbal cues in fostering psychological safety"
          ]
        },
        {
          "number": 3,
          "title": "Intersectionality in Practice: Beyond the Binary",
          "outline": [
            "Deep dive into the 'Recognition of Identity' (R) for neurodivergent LGBTQ+ clients",
            "Navigating the 'Double Consciousness' of BIPOC-LGBTQ+ individuals in wellness spaces",
            "Coaching clients through religious deconstruction and spiritual identity reclamation",
            "Addressing age-related identity shifts: Coaching LGBTQ+ youth vs. aging populations"
          ]
        },
        {
          "number": 4,
          "title": "Deconstructing Stigma: Advanced Inner Resilience",
          "outline": [
            "Differentiating between clinical depression and 'Minority Stress' fatigue",
            "Evidence-based strategies for dismantling internalized transphobia and homophobia",
            "Building 'Identity-Conscious' self-compassion practices for non-linear healing",
            "The 'Shame-Resilience' model: Moving from concealment to courageous vulnerability"
          ]
        },
        {
          "number": 5,
          "title": "Strategic Wellness: Coaching Through Medical Transition",
          "outline": [
            "The coach’s role in pre- and post-operative surgical support and recovery planning",
            "Navigating wellness during Hormone Replacement Therapy (HRT): Physical and emotional shifts",
            "Body Neutrality vs. Body Positivity: Managing gender dysphoria through movement and nutrition",
            "Advocating for affirming healthcare: Empowering clients to interview medical providers"
          ]
        },
        {
          "number": 6,
          "title": "Manifesting Authenticity: Professional Boundaries and Visibility",
          "outline": [
            "The ethics of 'Self-Disclosure': When and how to share your own lived experience",
            "Managing 'Visibility Fatigue' and the emotional labor of living authentically",
            "Setting digital boundaries: Affirming social media presence and community engagement",
            "Coaching the 'Coming Out' process in professional and corporate environments"
          ]
        },
        {
          "number": 7,
          "title": "Crisis Management and Affirming Referral Pathways",
          "outline": [
            "Establishing the 'Scope of Practice' boundary between coaching and psychotherapy",
            "Identifying acute vs. chronic risk: LGBTQ-specific crisis assessment for coaches",
            "Building a 'Gold Standard' referral network of affirming mental health and medical providers",
            "Protocol for navigating client 'Crisis Cycles' while maintaining the coaching container"
          ]
        },
        {
          "number": 8,
          "title": "The Affirming Philosophy: Synthesis and Professional Identity",
          "outline": [
            "Synthesizing the 12 modules into a personal Affirming Coaching Manifesto",
            "The commitment to 'Cultural Humility' as a lifelong professional development standard",
            "Evaluating coaching efficacy: Qualitative and quantitative metrics for LGBTQ+ wellness",
            "Finalizing your PRISM-aligned business model and client intake process"
          ]
        }
      ]
    },
    {
      "number": 13,
      "title": "L1 Deep Dive Module 13: Intersectionality, Neurodiversity, and Specialized Populations",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Intersectional Wellness: Beyond the Binary and Single-Identity Models",
          "outline": [
            "Defining the 'Double Jeopardy' and 'Triple Jeopardy' effects in LGBTQ+ health outcomes.",
            "Applying the Recognition of Identity (R) pillar to multi-marginalized clients (BIPOC, undocumented, or low-income).",
            "Analyzing how systemic racism and cisheteronormativity intersect to create unique wellness barriers.",
            "Strategies for coaches to acknowledge power dynamics and privilege within the coaching relationship.",
            "Case study analysis: Navigating wellness goals for a Black Trans woman in a healthcare desert."
          ]
        },
        {
          "number": 2,
          "title": "Neuroqueer Wellness: Supporting Neurodivergent LGBTQ+ Clients",
          "outline": [
            "Understanding the high prevalence of neurodivergence (Autism, ADHD) within the LGBTQ+ community.",
            "Modifying the Presence & Safety (P) container to accommodate sensory processing differences and communication styles.",
            "Deconstructing 'performance' and 'masking' as both a survival mechanism and a barrier to authenticity.",
            "Designing Strategic Wellness (S) plans that account for executive dysfunction and burnout recovery.",
            "Tools for helping neuroqueer clients build self-compassion for non-linear progress."
          ]
        },
        {
          "number": 3,
          "title": "Aging with Pride: Wellness Strategies for LGBTQ+ Elders",
          "outline": [
            "Addressing the unique minority stress of LGBTQ+ seniors: Isolation, historical trauma, and healthcare bias.",
            "Strategic Wellness (S) for the 'Silver Tsunami': Planning for long-term care, end-of-life, and legal protections.",
            "The role of intergenerational connection in Manifesting Authenticity (M) and reducing loneliness.",
            "Coaching through the loss of 'Chosen Family' and building new community support systems.",
            "Promoting cognitive health and physical mobility through a queer-affirming lens."
          ]
        },
        {
          "number": 4,
          "title": "Disability Justice in LGBTQ+ Wellness Coaching",
          "outline": [
            "Integrating the 10 Principles of Disability Justice into the PRISM Framework™.",
            "Moving beyond body positivity: Cultivating body neutrality and 'Body Mind' awareness for disabled queer clients.",
            "Navigating the intersection of medical transition and chronic illness/disability management.",
            "Practical accessibility: Ensuring digital and physical coaching spaces are inclusive of all mobilities.",
            "Advocating for the client's agency in medical settings where disability and identity are pathologized."
          ]
        },
        {
          "number": 5,
          "title": "Affirming Recovery: Navigating Sobriety in Queer Spaces",
          "outline": [
            "Analyzing why substance use disorders (SUD) disproportionately affect the LGBTQ+ community (Minority Stress Theory).",
            "Building Inner Resilience (I) through harm reduction and queer-specific recovery resources.",
            "The challenge of 'Bar Culture': Helping clients find social connection and 'Manifesting Authenticity' without alcohol.",
            "Coaching clients through 'Coming Out' in sober spaces and 'Getting Sober' in queer spaces.",
            "Developing emotional regulation tools to replace maladaptive coping mechanisms."
          ]
        },
        {
          "number": 6,
          "title": "Family Constellations: Coaching Through Chosen and Biological Family Dynamics",
          "outline": [
            "Differentiating between 'Family of Origin' and 'Family of Choice' in the wellness journey.",
            "Setting trauma-informed boundaries with non-affirming biological family members.",
            "Nurturing the health of 'Chosen Family' structures and intentional community living.",
            "Coaching through 'Secondary Coming Out' (e.g., coming out as polyamorous or kinky to family).",
            "Conflict resolution and communication strategies for non-traditional household structures."
          ]
        },
        {
          "number": 7,
          "title": "Economic Justice: Financial Wellness as a Health Pillar",
          "outline": [
            "The 'Queer Tax': Understanding the financial impact of transition, legal fees, and workplace discrimination.",
            "Integrating financial literacy and stability into the Strategic Wellness (S) plan.",
            "Coaching clients through workplace advocacy and navigating 'Professionalism' standards as a trans/GNC person.",
            "Low-cost and no-cost wellness interventions for clients facing economic hardship.",
            "Deconstructing the 'Wellness Industrial Complex' and its barriers to marginalized identities."
          ]
        },
        {
          "number": 8,
          "title": "Rural Resilience: Wellness Beyond the Metropolitan 'Mecca'",
          "outline": [
            "Identifying the specific stressors of LGBTQ+ individuals living in rural or conservative environments.",
            "Safety planning and risk assessment as part of the Presence & Safety (P) pillar.",
            "Leveraging digital communities and telehealth to bridge the gap in local affirming resources.",
            "Finding 'Pockets of Pride': Helping clients identify and cultivate local micro-communities.",
            "Coaching the 'Stay and Fight' vs. 'Relocation' decision-making process for long-term mental health."
          ]
        }
      ]
    },
    {
      "number": 14,
      "title": "L1 Deep Dive Module 14: Intersectional Wellness & Advanced Advocacy",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Intersectional Lens: Neurodivergence and LGBTQ+ Identity",
          "outline": [
            "Analyzing the 'Double Divergence' phenomenon: The statistical overlap between autism, ADHD, and gender/sexual diversity.",
            "Adapting the PRISM Framework for neuro-affirming communication and sensory-friendly coaching environments.",
            "Strategies for managing executive dysfunction within the context of gender-affirming medical transitions.",
            "Deconstructing 'masking' and its impact on authentic identity manifestation and mental health.",
            "Case study analysis: Supporting a neurodivergent client through social transition hurdles."
          ]
        },
        {
          "number": 2,
          "title": "Strategic Wellness for LGBTQ+ Aging and Eldercare",
          "outline": [
            "Identifying unique stressors for LGBTQ+ elders: Social isolation, historical medical trauma, and lack of chosen family support.",
            "Navigating the 'Second Closet' in assisted living and long-term care facilities.",
            "Advanced advocacy: Helping clients secure legal protections (Power of Attorney, Advance Directives) in non-affirming environments.",
            "Holistic wellness strategies for maintaining cognitive health and physical mobility in the aging queer population.",
            "Fostering intergenerational connection as a tool for community resilience."
          ]
        },
        {
          "number": 3,
          "title": "Somatic Processing of Minority Stress and Trauma",
          "outline": [
            "Understanding how minority stress is stored in the nervous system: Polyvagal Theory through a queer lens.",
            "Somatic grounding techniques specifically designed for clients experiencing gender dysphoria or hypervigilance.",
            "The role of 'Body Reclamation' in wellness: Moving from body dissociation to embodied presence.",
            "Implementing trauma-informed movement and breathwork to regulate the sympathetic nervous system.",
            "Distinguishing between somatic discomfort and psychological triggers in a coaching session."
          ]
        },
        {
          "number": 4,
          "title": "Affirming Wellness for Intersex Clients",
          "outline": [
            "Foundational knowledge: Understanding intersex variations (DSD) and the history of medical pathologization.",
            "Addressing the specific trauma of non-consensual childhood medical interventions within the 'Presence & Safety' pillar.",
            "Navigating the healthcare system: Advocacy strategies for intersex-competent care and hormone management.",
            "Language and terminology: Empowering clients to define their own bodies and identities outside the binary.",
            "Building inner resilience against intersex erasure within both cisnormative and LGBTQ+ spaces."
          ]
        },
        {
          "number": 5,
          "title": "Navigating Medical Gaslighting and Healthcare Advocacy",
          "outline": [
            "Defining medical gaslighting: Identifying red flags in primary care and specialist settings.",
            "The 'Advocacy Toolkit': Preparing clients for appointments, documenting symptoms, and requesting second opinions.",
            "Strategic Wellness: Building a multidisciplinary team of affirming providers (pelvic floor therapy, endocrinology, mental health).",
            "Coaching clients through the emotional aftermath of discriminatory healthcare experiences.",
            "Empowering the client's voice: Role-playing self-advocacy scripts for clinical settings."
          ]
        },
        {
          "number": 6,
          "title": "Spiritual Reclamation and Deconstructing Religious Trauma",
          "outline": [
            "Recognizing the signs of religious trauma syndrome (RTS) and its impact on self-worth and identity.",
            "Tools for deconstructing internalized shame rooted in non-affirming religious upbringing.",
            "Exploring 'Spiritual Reclamation': Finding or creating affirming spiritual practices and rituals.",
            "Setting boundaries with non-affirming family members and religious institutions while maintaining inner peace.",
            "The intersection of faith, culture, and queer identity in BIPOC communities."
          ]
        },
        {
          "number": 7,
          "title": "Ethical Boundaries and Scope of Practice in LGBTQ+ Coaching",
          "outline": [
            "Navigating 'Dual Relationships' in small or rural LGBTQ+ communities: Ethical considerations and boundary setting.",
            "Defining the line: When to refer a client to a licensed therapist vs. when to maintain a coaching container.",
            "Trauma-informed referral networks: How to vet external professionals for true LGBTQ+ competency.",
            "Coach self-care: Managing compassion fatigue and vicarious trauma when working with high-stress populations.",
            "Maintaining professional confidentiality in community-led or peer-supported wellness spaces."
          ]
        },
        {
          "number": 8,
          "title": "From Self-Care to Community Care: Cultivating Collective Resilience",
          "outline": [
            "Deconstructing the 'Individualist Wellness' myth: The necessity of community care for LGBTQ+ survival.",
            "Mutual aid and social connection as core components of the 'Strategic Wellness' pillar.",
            "Building 'Queer Joy' as a radical act of resistance and long-term health maintenance.",
            "Sustainable advocacy: Preventing burnout while engaging in community activism and social change.",
            "Final Integration: Synthesizing the PRISM Framework into a lifelong practice of authentic living."
          ]
        }
      ]
    },
    {
      "number": 15,
      "title": "L1 Deep Dive Module 15",
      "tier": "L1",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Holistic Integration: Synthesizing the P.R.I.S.M. Framework™",
          "outline": [
            "Moving beyond individual pillars to a unified coaching approach for long-term client success.",
            "Assessing client readiness for the transition from 'Inner Resilience' to 'Manifesting Authenticity'.",
            "Utilizing longitudinal P.R.I.S.M. assessment tools to track wellness outcomes over 6-12 months.",
            "Strategies for maintaining the 'Presence & Safety' container during deep identity exploration.",
            "Case study analysis: Integrating all five pillars in a complex, multi-year coaching engagement."
          ]
        },
        {
          "number": 2,
          "title": "Advanced Minority Stress: Physiology and Cognitive Reframing",
          "outline": [
            "The biological impact of chronic microaggressions on the endocrine and nervous systems.",
            "Differentiating between acute discriminatory events and the 'slow drip' of systemic stigma.",
            "Advanced cognitive-behavioral coaching tools for deconstructing internalized transphobia and homophobia.",
            "Building 'Resilience Reserves': Proactive wellness strategies for high-stress social environments.",
            "The role of self-compassion as a physiological regulator in the P.R.I.S.M. 'Inner Resilience' pillar."
          ]
        },
        {
          "number": 3,
          "title": "The Neuro-Queer Intersection: Wellness for Neurodivergent LGBTQ+ Clients",
          "outline": [
            "Understanding the statistical prevalence and unique needs of Autistic and ADHD individuals within the LGBTQ+ community.",
            "Adapting the P.R.I.S.M. framework for sensory sensitivities and executive functioning challenges.",
            "Communication strategies for neuro-inclusive coaching: Clarity, structure, and literal interpretation.",
            "Navigating 'Double Minority' stress: The intersection of neurodivergence and queer identity.",
            "Designing Strategic Wellness plans that account for neurodivergent burnout and recovery."
          ]
        },
        {
          "number": 4,
          "title": "Affirming Longevity: Wellness Coaching for Aging LGBTQ+ Populations",
          "outline": [
            "Addressing the 'Invisibility Factor' and social isolation in LGBTQ+ elders.",
            "Strategic Wellness for aging: Navigating healthcare systems, long-term HIV management, and mobility transitions.",
            "Coaching for legacy and community connection: The importance of intergenerational mentorship.",
            "Ethical considerations in end-of-life planning and 'Chosen Family' legal advocacy.",
            "Maintaining 'Manifesting Authenticity' in assisted living and senior care environments."
          ]
        },
        {
          "number": 5,
          "title": "Somatic Sovereignty: Addressing Gender Dysphoria through Body Neutrality",
          "outline": [
            "The role of somatic experiencing in grounding clients during episodes of intense dysphoria.",
            "Moving from body positivity to body neutrality: A trauma-informed approach to physical self-image.",
            "Breathwork and mindfulness techniques specifically tailored for gender-diverse bodies.",
            "Building a 'Somatic Safety Plan' within the P.R.I.S.M. 'Presence & Safety' pillar.",
            "Coaching clients through the physical and emotional 'middle ground' of medical transition."
          ]
        },
        {
          "number": 6,
          "title": "Family Systems: Navigating Biological and Chosen Family Dynamics",
          "outline": [
            "The psychological impact of 'conditional belonging' within biological family structures.",
            "Coaching clients through the 'Coming Out' process: Risk assessment and boundary setting.",
            "The vital role of 'Chosen Family' in the P.R.I.S.M. 'Manifesting Authenticity' pillar.",
            "Managing holiday stress and family-related triggers through proactive emotional regulation.",
            "Conflict resolution strategies for LGBTQ+ couples and polyamorous constellations."
          ]
        },
        {
          "number": 7,
          "title": "Professional Authenticity: LGBTQ+ Advocacy in the Workplace",
          "outline": [
            "Assessing corporate culture and psychological safety for LGBTQ+ employees.",
            "Coaching through professional transitions: Name changes, pronoun updates, and HR navigation.",
            "Strategies for 'Strategic Outness': Deciding when, how, and with whom to share identity.",
            "The coach’s role in supporting client-led advocacy and DE&I initiatives.",
            "Building professional resilience against workplace microaggressions and 'glass ceilings'."
          ]
        },
        {
          "number": 8,
          "title": "Ethics and Scope: Maintaining the P.R.I.S.M. Standard of Care",
          "outline": [
            "Defining the clear boundary between LGBTQ+ affirming coaching and clinical psychotherapy.",
            "Identifying 'Red Flags': When to refer a client to a licensed mental health professional.",
            "Ethical considerations in digital coaching, social media presence, and community spaces.",
            "The importance of continuous education and cultural humility in the L1 practitioner's journey.",
            "Self-care and supervision for the coach: Preventing secondary traumatic stress and burnout."
          ]
        }
      ]
    },
    {
      "number": 16,
      "title": "L2: Advanced Case Studies",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Intersectionality in Action: Navigating BIPOC Trans Identity",
          "outline": [
            "Applying 'Recognition of Identity' (R) to address the compounding effects of systemic racism and transphobia.",
            "Case Study: A Black Trans Woman navigating healthcare disparities and corporate microaggressions while maintaining wellness.",
            "Utilizing 'Inner Resilience' (I) to deconstruct internalized misogynoir and build self-compassion.",
            "Designing 'Strategic Wellness' (S) plans that incorporate culturally specific community resources and safety protocols.",
            "Facilitating 'Manifesting Authenticity' (M) in spaces where visibility may carry heightened physical or social risk."
          ]
        },
        {
          "number": 2,
          "title": "Post-Surgical Recovery and Body Neutrality for Transmasculine Clients",
          "outline": [
            "Applying 'Presence & Safety' (P) to navigate medical trauma and post-operative vulnerability.",
            "Case Study: A transmasculine client recovering from gender-affirming surgery facing body image shifts and physical limitations.",
            "Implementing 'Strategic Wellness' (S) for long-term scar care, mobility restoration, and hormone-sensitive nutrition.",
            "Moving from gender euphoria to body neutrality: Deconstructing the 'perfect transition' myth using 'Inner Resilience' (I).",
            "Coaching through the social transition 'plateau' after major medical milestones are achieved."
          ]
        },
        {
          "number": 3,
          "title": "Mid-Life Transitions: Coming Out as Non-Binary in Established Careers",
          "outline": [
            "Analyzing the unique 'Recognition of Identity' (R) challenges for clients coming out in their 40s or 50s.",
            "Case Study: A non-binary professional navigating pronoun shifts and wardrobe changes in a conservative corporate environment.",
            "Applying 'Manifesting Authenticity' (M) while managing established family dynamics and parenting responsibilities.",
            "Building 'Inner Resilience' (I) against 'imposter syndrome' and the grief of 'lost time' before coming out.",
            "Strategic communication coaching for professional advocacy and boundary setting."
          ]
        },
        {
          "number": 4,
          "title": "The Golden Years: Supporting LGBTQ+ Elders in Care Facilities",
          "outline": [
            "Addressing the 'Presence & Safety' (P) crisis for queer elders entering non-affirming assisted living environments.",
            "Case Study: A gay man in his 80s facing isolation and the 're-closeting' effect in a traditional care facility.",
            "Using 'Manifesting Authenticity' (M) to foster chosen family connections and intergenerational community support.",
            "Applying 'Strategic Wellness' (S) to manage chronic illness while maintaining a sense of queer identity and agency.",
            "Advocacy coaching for clients and their proxies to ensure gender-affirming medical and personal care."
          ]
        },
        {
          "number": 5,
          "title": "Neurodivergence and Gender Fluidity: A Multi-Layered Approach",
          "outline": [
            "Exploring the statistical correlation between neurodivergence and gender diversity through 'Recognition of Identity' (R).",
            "Case Study: An Autistic non-binary youth struggling with sensory processing and gender dysphoria in public spaces.",
            "Adapting 'Presence & Safety' (P) to include sensory-friendly coaching environments and executive function support.",
            "Developing 'Strategic Wellness' (S) routines that honor both neuro-type and gender expression needs.",
            "Deconstructing 'masking' behaviors and their impact on authentic gender manifestation."
          ]
        },
        {
          "number": 6,
          "title": "Trauma, Estrangement, and the Architecture of Chosen Family",
          "outline": [
            "Applying 'Inner Resilience' (I) to the specific trauma of family rejection and religious trauma syndrome.",
            "Case Study: A lesbian client navigating holiday-related depression and the 'un-learning' of biological family expectations.",
            "Utilizing 'Presence & Safety' (P) to establish a secure attachment within the coaching relationship.",
            "The 'Strategic Wellness' (S) of boundary setting: When to go 'low-contact' or 'no-contact' for mental health.",
            "Fostering 'Manifesting Authenticity' (M) through the intentional creation and maintenance of chosen family networks."
          ]
        },
        {
          "number": 7,
          "title": "The Transgender Athlete: Performance, Dysphoria, and Inclusion",
          "outline": [
            "Navigating the 'Strategic Wellness' (S) of high-performance athletics while managing medical transition requirements.",
            "Case Study: A trans woman athlete balancing competitive regulations, public scrutiny, and physical dysphoria.",
            "Using 'Inner Resilience' (I) to manage 'minority stress' in gender-segregated sporting environments.",
            "Applying 'Recognition of Identity' (R) to redefine 'fitness' and 'strength' outside of binary, cis-normative standards.",
            "Advocacy and 'Manifesting Authenticity' (M) within local sports clubs and competitive leagues."
          ]
        },
        {
          "number": 8,
          "title": "Global Contexts: Coaching in Non-Affirming Legal Environments",
          "outline": [
            "Adapting the P.R.I.S.M. Framework™ for clients living in regions where LGBTQ+ identities are criminalized.",
            "Case Study: A queer person navigating 'Presence & Safety' (P) and mental wellness in a country with limited legal protections.",
            "Prioritizing 'Inner Resilience' (I) and digital safety as core components of a 'Strategic Wellness' (S) plan.",
            "The ethics of 'Manifesting Authenticity' (M): Balancing the desire for visibility with the necessity of physical safety.",
            "Utilizing international virtual communities to provide the 'Recognition of Identity' (R) missing in local contexts."
          ]
        }
      ]
    },
    {
      "number": 17,
      "title": "L2: Complex Client Scenarios",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The 'Double Rainbow': Coaching Neurodivergent LGBTQ+ Clients",
          "outline": [
            "Analyzing the high statistical prevalence of autism and ADHD within the LGBTQ+ community and the unique 'Double Rainbow' experience.",
            "Adapting the P.R.I.S.M. Framework to accommodate sensory processing differences and executive functioning challenges.",
            "Strategies for 'Recognition of Identity' when a client is navigating both neurodivergence and gender/sexual expansion simultaneously.",
            "Implementing 'Strategic Wellness' plans that account for burnout, hyper-fixation, and social masking exhaustion.",
            "Case study analysis: Supporting a non-binary client with ADHD through the logistical hurdles of medical transition."
          ]
        },
        {
          "number": 2,
          "title": "Navigating Political Climate and Collective Minority Stress",
          "outline": [
            "Techniques for 'Inner Resilience' during periods of legislative hostility or high-stress political cycles affecting LGBTQ+ rights.",
            "Distinguishing between individual clinical anxiety and valid, collective trauma-based responses to systemic oppression.",
            "Utilizing 'Presence & Safety' to create a sanctuary space when the external world feels increasingly unsafe.",
            "Empowering clients to move from 'paralysis' to 'Manifesting Authenticity' through community-based advocacy and digital boundaries.",
            "Data-driven approaches to managing the physiological impact of chronic minority stress on long-term health."
          ]
        },
        {
          "number": 3,
          "title": "Aging with Pride: Complexities of Queer Elder Care",
          "outline": [
            "Addressing the unique isolation risks and 'Strategic Wellness' needs of LGBTQ+ adults over the age of 65.",
            "Navigating the 'Recognition of Identity' for elders who lived through the pre-Stonewall or HIV/AIDS crisis eras.",
            "Coaching through the fear of 're-closeting' when entering assisted living or heteronormative healthcare environments.",
            "Building 'Inner Resilience' around legacy, chosen family structures, and end-of-life planning for queer individuals.",
            "Facilitating 'Manifesting Authenticity' in later life transitions, including late-in-life coming out scenarios."
          ]
        },
        {
          "number": 4,
          "title": "Family Estrangement and the 'Chosen Family' Dynamic",
          "outline": [
            "Advanced coaching techniques for clients navigating 'No Contact' or 'Low Contact' status with biological families.",
            "Utilizing 'Presence & Safety' to process the grief of familial rejection without pathologizing the client's boundaries.",
            "The P.R.I.S.M. approach to building and vetting a 'Chosen Family' support network as a core wellness strategy.",
            "Managing 'Inner Resilience' during high-trigger periods like holidays, weddings, or family emergencies.",
            "Role-playing boundary-setting conversations that prioritize the client’s psychological safety over societal expectations of 'reconciliation.'"
          ]
        },
        {
          "number": 5,
          "title": "Sober Queer Spaces: Coaching Through Substance Use Recovery",
          "outline": [
            "Addressing the 'Strategic Wellness' challenges of maintaining sobriety in a community where social life is often centered around bars.",
            "Identifying 'Inner Resilience' tools for clients dealing with the intersection of internalized homophobia/transphobia and addiction.",
            "Navigating 'Recognition of Identity' within traditional 12-step programs that may lack LGBTQ+ cultural competency.",
            "Developing harm reduction strategies and identifying queer-affirming recovery resources and secular communities.",
            "Case study: Supporting a client’s 'Manifesting Authenticity' while navigating early sobriety and the 'coming out' process."
          ]
        },
        {
          "number": 6,
          "title": "Medical Trauma and Navigating Healthcare Inequity",
          "outline": [
            "Understanding the impact of 'White Coat Syndrome' and previous medical trauma on a client’s 'Strategic Wellness' goals.",
            "Coaching clients on self-advocacy techniques for gender-affirming surgeries, HRT, or routine preventative care.",
            "Using 'Presence & Safety' to help clients prepare for and decompress from invasive or invalidating medical encounters.",
            "Analyzing the 'Recognition of Identity' hurdles for BIPOC LGBTQ+ clients who face compounded medical bias.",
            "Developing a 'Healthcare Advocacy Toolkit' that empowers clients to vet providers and demand affirming care."
          ]
        },
        {
          "number": 7,
          "title": "Non-Binary and Gender-Fluid Transitions: Beyond the Binary",
          "outline": [
            "Navigating 'Strategic Wellness' for clients whose transition goals do not align with a linear or binary 'male-to-female/female-to-male' path.",
            "Coaching through 'Recognition of Identity' when a client’s gender expression is fluid or non-standard (e.g., micro-dosing HRT).",
            "Addressing the 'Inner Resilience' needed to handle constant misgendering and the lack of social 'scripts' for non-binary existence.",
            "Facilitating 'Manifesting Authenticity' in workplace and social environments that struggle with 'they/them' or neopronoun usage.",
            "Managing the specific body dysmorphia vs. gender dysphoria nuances in gender-expansive coaching."
          ]
        },
        {
          "number": 8,
          "title": "The Ethical Bridge: Crisis Intervention and Referral Pathways",
          "outline": [
            "Establishing clear 'Presence & Safety' protocols for identifying when a complex scenario exceeds the scope of wellness coaching.",
            "Developing a robust referral network of LGBTQ+ affirming therapists, psychiatrists, and emergency resources.",
            "The P.R.I.S.M. approach to 'warm hand-offs'—maintaining the coaching container while the client seeks clinical support.",
            "Identifying red flags for Suicidal Ideation (SI), Self-Harm, and Eating Disorders within a queer-affirming context.",
            "Legal and ethical considerations for L2 coaches regarding confidentiality, mandated reporting, and liability in high-stakes cases."
          ]
        }
      ]
    },
    {
      "number": 18,
      "title": "L2: Integration & Synthesis",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Unified Coach: Non-Linear Application of the P.R.I.S.M. Framework™",
          "outline": [
            "Transitioning from linear framework application to a holistic, simultaneous synthesis of all five PRISM pillars.",
            "Advanced Presence & Safety: Moving beyond basic rapport to creating a 'radical acceptance' container for complex client disclosures.",
            "Real-time diagnostic skills: Identifying which PRISM element requires immediate priority during high-intensity coaching sessions.",
            "The feedback loop: How Manifesting Authenticity (M) informs and reshapes the client's initial Recognition of Identity (R)."
          ]
        },
        {
          "number": 2,
          "title": "Advanced Intersectional Synthesis: Managing Multi-Layered Identities",
          "outline": [
            "Deep-dive into the 'Matrix of Identity' mapping: Synthesizing race, disability, neurodivergence, and LGBTQ+ experiences.",
            "Addressing 'Double Consciousness' and code-switching: Coaching strategies for clients navigating conflicting cultural expectations.",
            "The impact of cumulative systemic oppression on the 'Inner Resilience' (I) pillar in L2 coaching.",
            "Case conceptualization for clients at the intersection of religious trauma and gender-affirming transitions."
          ]
        },
        {
          "number": 3,
          "title": "Deconstructing Complex Minority Stress & Somatic Resourcing",
          "outline": [
            "Moving beyond cognitive recognition to somatic integration of minority stress and internalized transphobia/homophobia.",
            "Advanced Inner Resilience: Utilizing polyvagal theory to regulate the nervous system after acute systemic discrimination events.",
            "The 'Stress-Resilience-Wellness' Triad: Analyzing how minority stress impacts the efficacy of Strategic Wellness (S) plans.",
            "Developing long-term emotional regulation protocols for clients facing chronic legislative or social hostility."
          ]
        },
        {
          "number": 4,
          "title": "Strategic Wellness Synthesis: Bio-Psycho-Social Integration",
          "outline": [
            "Synthesizing medical transition milestones (HRT, surgery) with mental health and nutritional coaching strategies.",
            "Advanced Strategic Wellness: Navigating the 'Wellness Gap'—addressing the physical health disparities caused by medical avoidance and systemic bias.",
            "Body Neutrality vs. Body Positivity: Integrating gender euphoria into a holistic physical wellness framework.",
            "Collaborative Care: Synthesizing the coaching plan with the client’s broader medical and psychological support teams."
          ]
        },
        {
          "number": 5,
          "title": "Crisis, Relapse, and Resilience: Advanced Mastery in High-Stakes Coaching",
          "outline": [
            "Synthesizing Presence & Safety (P) with Inner Resilience (I) during moments of client crisis or wellness setbacks.",
            "The 'Resilience Anchor' technique: Re-establishing identity-based strengths when a client experiences a loss of community or family support.",
            "Ethical boundaries in L2 coaching: Distinguishing between coaching synthesis and the need for clinical psychotherapeutic intervention.",
            "Post-traumatic growth (PTG) in the LGBTQ+ context: Facilitating the transition from survival to thriving."
          ]
        },
        {
          "number": 6,
          "title": "The Authentic Advocate: Synthesizing Personal Wellness with Community Impact",
          "outline": [
            "Manifesting Authenticity (M) as a form of social resistance: Coaching the client through the transition from self-advocacy to community leadership.",
            "The 'Sustainability of Activism': Strategies to prevent burnout in clients who are highly visible within the LGBTQ+ movement.",
            "Advanced Community Connection: Navigating lateral violence and finding 'chosen family' that supports the client’s Strategic Wellness (S) goals.",
            "Developing a 'Legacy of Authenticity' plan for long-term client fulfillment and social contribution."
          ]
        },
        {
          "number": 7,
          "title": "Advanced Case Conceptualization: The L2 Coaching Blueprint",
          "outline": [
            "Mastering the L2 Intake: Synthesizing historical trauma, current wellness status, and future authenticity goals into a 6-month blueprint.",
            "Data-driven coaching: Utilizing validated LGBTQ+ wellness scales to measure progress across all five PRISM domains.",
            "Case Study Workshop: Analyzing complex, multi-year client arcs and the evolution of the coaching relationship.",
            "Troubleshooting the 'Stagnant Client': Identifying hidden barriers in the Recognition of Identity (R) that impede Strategic Wellness (S)."
          ]
        },
        {
          "number": 8,
          "title": "Professional Mastery & The Evolution of the Affirming Coach",
          "outline": [
            "The Coach’s Synthesis: Integrating personal identity and professional boundaries to maintain long-term career sustainability.",
            "Advanced Ethics of Synthesis: Navigating the complexities of dual relationships and community visibility as an L2 coach.",
            "Continuous Professional Development: Establishing a framework for lifelong learning in the rapidly evolving landscape of LGBTQ+ health.",
            "Finalizing the L2 Coaching Philosophy: Defining your unique synthesis of the PRISM framework for your specific niche."
          ]
        }
      ]
    },
    {
      "number": 19,
      "title": "L2: Research & Evidence",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Evolution of LGBTQ+ Wellness Science",
          "outline": [
            "Historical shift from the pathologization of LGBTQ+ identities (DSM-I/II) to evidence-based affirmative care models.",
            "Analyzing the current landscape of NIH and CDC research priorities regarding sexual and gender minority (SGM) populations.",
            "The role of the P.R.I.S.M. Framework™ in bridging the gap between clinical research and holistic wellness coaching.",
            "Understanding 'Evidence-Informed Practice' vs. 'Evidence-Based Practice' in a coaching context.",
            "Critical analysis of the 2011 IOM Report on LGBT Health and its impact on modern wellness standards."
          ]
        },
        {
          "number": 2,
          "title": "Minority Stress Theory: A Meta-Analytic Review",
          "outline": [
            "Deep dive into Ilan Meyer’s Minority Stress Model and its updates over the last two decades.",
            "Distinguishing between distal stressors (external prejudice) and proximal stressors (internalized transphobia/homophobia) with empirical data.",
            "The physiological impact of chronic minority stress: Allostatic load, cortisol dysregulation, and systemic inflammation.",
            "Reviewing longitudinal studies on the correlation between structural stigma (state-level laws) and individual wellness outcomes.",
            "Applying 'Inner Resilience' (I in PRISM) to mitigate the biological markers of chronic stress."
          ]
        },
        {
          "number": 3,
          "title": "Health Equity & Disparities: Data-Driven Insights",
          "outline": [
            "Examining cardiovascular health disparities in the LGBTQ+ community: The role of stress and behavioral health.",
            "Analyzing cancer screening gaps (cervical, breast, and prostate) due to medical mistrust and gender-dysphoria in clinical settings.",
            "Metabolic health and the LGBTQ+ population: Data on diabetes prevalence and nutritional barriers.",
            "The 'Hidden Data' problem: Identifying gaps in SGM data collection and the importance of SOGI (Sexual Orientation and Gender Identity) metrics.",
            "Strategic Wellness (S in PRISM) interventions designed to address specific statistically prevalent health risks."
          ]
        },
        {
          "number": 4,
          "title": "The Science of Gender-Affirming Care",
          "outline": [
            "Reviewing longitudinal outcomes of Gender-Affirming Hormone Therapy (GAHT) on mental health and quality of life.",
            "The Trevor Project and Cornell University data: Impact of social transition and name/pronoun affirmation on youth suicide rates.",
            "Evidence regarding the 'Regret Rate' in gender-affirming surgeries vs. other common medical procedures.",
            "The role of the wellness coach in supporting clients through the medical transition timeline based on WPATH Standards of Care (SOC8).",
            "Manifesting Authenticity (M in PRISM) as a clinical protective factor against self-harm and depression."
          ]
        },
        {
          "number": 5,
          "title": "Intersectionality in Research: Beyond Monolithic Data",
          "outline": [
            "Analyzing the compounding effects of racism and heterosexism on the wellness of QTBIPOC (Queer/Trans Black, Indigenous, and People of Color).",
            "Research on LGBTQ+ aging: Data on social isolation, cognitive health, and the 'Double Closet' in elder care.",
            "The intersection of neurodivergence (Autism/ADHD) and gender diversity: Current prevalence data and coaching implications.",
            "Socioeconomic status (SES) as a moderator in LGBTQ+ wellness outcomes: Evidence on housing and food insecurity.",
            "Recognition of Identity (R in PRISM) through the lens of intersectional quantitative and qualitative data."
          ]
        },
        {
          "number": 6,
          "title": "Resilience & Protective Factors: The Evidence Base",
          "outline": [
            "The 'Buffering Effect' of community connection: Scientific evidence on the benefits of chosen family and peer support.",
            "Self-Compassion as a clinical intervention: Research on its efficacy in reducing internalized stigma.",
            "The impact of 'Outness' and visibility on psychological well-being: Analyzing the risks vs. rewards in current literature.",
            "Family of origin support vs. community support: Comparing the weight of protective factors in adult LGBTQ+ wellness.",
            "Presence & Safety (P in PRISM) as a foundational requirement for neurobiological regulation."
          ]
        },
        {
          "number": 7,
          "title": "Measuring Outcomes: Validated Assessment Tools",
          "outline": [
            "Introduction to psychometric scales: Using the PHQ-9, GAD-7, and the Gender Congruence and Life Satisfaction Scale (GCLS).",
            "Utilizing the 'Internalized Homophobia Scale' and 'Transgender Identity Stigma Scale' in a coaching environment.",
            "Tracking 'Strategic Wellness' progress through Objective Metrics (biometrics) vs. Subjective Well-being (SWB) scales.",
            "The ethics of data collection in coaching: Privacy, HIPAA/GDPR considerations, and client autonomy.",
            "Designing a data-informed coaching 'Dashboard' to visualize client progress across the PRISM pillars."
          ]
        },
        {
          "number": 8,
          "title": "Evidence-Informed Practice: Translating Research to Coaching",
          "outline": [
            "How to critically appraise a new peer-reviewed study: Identifying bias, sample size issues, and p-hacking.",
            "Translating complex scientific data into accessible 'Coach Tips' and client education materials.",
            "Bridging the gap between 'Clinical Significance' and 'Lived Experience' in the coaching relationship.",
            "Developing a personal 'Research Repository' to stay current with the rapidly evolving field of SGM health.",
            "Final synthesis: Building a high-tier coaching practice that is both deeply empathetic and rigorously evidence-based."
          ]
        }
      ]
    },
    {
      "number": 20,
      "title": "L2: Assessment Tools",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Affirming Intake & The PRISM Baseline",
          "outline": [
            "Redesigning the standard intake form: Moving beyond binary gender markers and heteronormative relationship assumptions.",
            "Establishing 'Presence & Safety' (P) through initial linguistic mirroring and pronoun verification protocols.",
            "The 'First Impression' Audit: Evaluating the physical and digital environment for LGBTQ+ safety cues.",
            "Conducting the initial 'Identity Recognition' (R) interview: Open-ended prompts for self-identification.",
            "Ethical considerations in data storage and confidentiality for clients in 'stealth' or high-risk environments."
          ]
        },
        {
          "number": 2,
          "title": "Quantifying Minority Stress: Validated Scales",
          "outline": [
            "Utilizing the Daily Heterosexist Experiences Questionnaire (DHEQ) to identify chronic stressors.",
            "Implementing the Internalized Homophobia/Transphobia Scales to measure 'Inner Resilience' (I) baselines.",
            "Assessing the 'Expectation of Rejection' versus actual experiences of discrimination in coaching clients.",
            "Interpreting scores: Distinguishing between clinical pathology and adaptive responses to systemic oppression.",
            "Using scale results to prioritize coaching interventions within the Strategic Wellness (S) phase."
          ]
        },
        {
          "number": 3,
          "title": "Gender Congruence & Dysphoria Screening",
          "outline": [
            "The Gender Congruence Scale (GCS): Assessing alignment between internal identity and external expression.",
            "Differentiating between body dysmorphia and gender dysphoria in a wellness coaching context.",
            "Mapping transition-related goals: Social, medical, and legal milestones as 'Strategic Wellness' (S) indicators.",
            "Assessing 'Gender Euphoria': Identifying activities and environments that foster positive self-regard.",
            "Tools for non-binary and gender-fluid clients: Navigating shifting baselines and fluid wellness needs."
          ]
        },
        {
          "number": 4,
          "title": "Intersectional Identity Mapping Tools",
          "outline": [
            "Visualizing the 'Recognition of Identity' (R): Utilizing the Intersectional Wheel of Privilege and Oppression.",
            "Assessing the 'Double Jeopardy' effect: Tools for BIPOC LGBTQ+ clients to navigate multi-layered stressors.",
            "Religious Trauma Assessment: Evaluating the impact of spiritual background on current wellness and self-worth.",
            "Neurodiversity and LGBTQ+ Identity: Screening for sensory needs and communication styles in the coaching relationship.",
            "Mapping 'Manifesting Authenticity' (M) across different social spheres (work, family, community)."
          ]
        },
        {
          "number": 5,
          "title": "Safety Planning & Crisis Screening for LGBTQ+ Clients",
          "outline": [
            "Assessing risk: High-yield screening for self-harm and suicidality within the LGBTQ+ demographic.",
            "Creating an 'Affirming Safety Plan': Incorporating LGBTQ-specific resources (e.g., Trevor Project, Trans Lifeline).",
            "Assessing Intimate Partner Violence (IPV) in queer relationships: Identifying unique power dynamics and barriers to reporting.",
            "The 'Safe Space' Audit: Evaluating a client's physical safety in their current living or work environment.",
            "Establishing clear referral pathways: When assessment indicates a need for clinical or psychiatric intervention."
          ]
        },
        {
          "number": 6,
          "title": "Social Support & Chosen Family Inventories",
          "outline": [
            "The Social Support Questionnaire (SSQ) adapted for 'Chosen Family' structures.",
            "Mapping the 'Manifesting Authenticity' (M) network: Distinguishing between supportive, neutral, and toxic connections.",
            "Assessing 'Outness' levels across different life domains and the stress associated with 'Code-Switching'.",
            "Evaluating community belonging: The impact of LGBTQ+ social participation on long-term health outcomes.",
            "Tools for assessing relationship wellness in ENM (Ethical Non-Monogamy) and polyamorous configurations."
          ]
        },
        {
          "number": 7,
          "title": "The LGBTQ+ Wellness Wheel: Holistic Assessment",
          "outline": [
            "Adapting the 8 Dimensions of Wellness for queer lives: Sexual health, community safety, and advocacy.",
            "Financial Wellness Assessment: Addressing the 'Queer Tax' and economic disparities in the LGBTQ+ community.",
            "Occupational Wellness: Screening for workplace discrimination and the impact on 'Strategic Wellness' (S).",
            "Sexual Health & Satisfaction: Affirming tools for assessing intimacy, boundaries, and pleasure.",
            "Integrating the PRISM Framework into a visual dashboard for client progress tracking."
          ]
        },
        {
          "number": 8,
          "title": "Outcome Measurement & Longitudinal Tracking",
          "outline": [
            "Goal Attainment Scaling (GAS): Personalizing success metrics for non-linear transition or healing journeys.",
            "The Affirming Coaching Satisfaction Survey: Gathering feedback on the 'Presence & Safety' (P) of the coach.",
            "Measuring 'Inner Resilience' (I) growth over time: Post-traumatic growth indicators in LGBTQ+ clients.",
            "Data-driven coaching: Using mid-point assessments to pivot Strategic Wellness (S) plans.",
            "Final Assessment: Evaluating the client's readiness for 'Manifesting Authenticity' (M) independently."
          ]
        }
      ]
    },
    {
      "number": 21,
      "title": "L2: Treatment Planning",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced PRISM Case Formulation",
          "outline": [
            "Synthesizing intake data into a cohesive PRISM-based coaching roadmap",
            "Distinguishing between clinical treatment planning and affirming wellness coaching formulations",
            "Identifying 'Resilience Anchors' within the Recognition of Identity (R) phase to ground the plan",
            "Prioritizing coaching interventions based on the client's hierarchy of needs and psychological safety",
            "Developing a 'Working Hypothesis' for client barriers based on internalized minority stress"
          ]
        },
        {
          "number": 2,
          "title": "Strategic Wellness: Mapping Medical Transition Support",
          "outline": [
            "Designing coaching protocols for clients undergoing Hormone Replacement Therapy (HRT)",
            "Pre-operative and post-operative wellness planning: Nutrition, movement, and emotional regulation",
            "Collaborating with multidisciplinary teams (endocrinologists, surgeons, therapists) within a coaching scope",
            "Addressing 'Transition Fatigue' and managing expectations within the Strategic Wellness (S) pillar",
            "Creating contingency plans for medical gatekeeping and insurance navigation stress"
          ]
        },
        {
          "number": 3,
          "title": "Deconstructing Internalized Stigma in Action Plans",
          "outline": [
            "Integrating 'Inner Resilience' (I) techniques to dismantle internalized transphobia and homophobia",
            "Setting SMART goals that specifically target the reduction of 'Masking' and 'Code-switching'",
            "Utilizing Cognitive-Behavioral Coaching (CBC) tools to reframe minority stress triggers",
            "Designing 'Identity Reclamation' exercises as core components of the wellness plan",
            "Measuring shifts in self-compassion and self-worth as primary outcome indicators"
          ]
        },
        {
          "number": 4,
          "title": "Somatic Planning: From Dysphoria to Body Euphoria",
          "outline": [
            "Incorporating somatic experiencing and body-positive movement into the Strategic Wellness plan",
            "Developing 'Euphoria Mapping' tools to identify and amplify affirming physical experiences",
            "Coaching through body dysmorphia vs. gender dysphoria: Scope of practice and referral triggers",
            "Planning for sensory needs in neurodivergent LGBTQ+ clients during physical transitions",
            "Creating 'Safe-Body' rituals to enhance the Presence & Safety (P) pillar"
          ]
        },
        {
          "number": 5,
          "title": "Intersectional Planning for QTBIPOC Clients",
          "outline": [
            "Customizing wellness plans to address the unique 'Double Consciousness' of QTBIPOC individuals",
            "Integrating ancestral healing and cultural resilience factors into the Recognition of Identity (R) phase",
            "Navigating racism within the LGBTQ+ community as a specific stressor in the coaching plan",
            "Designing community-based 'Safety Nets' that honor cultural nuances and familial structures",
            "Building advocacy goals for navigating systemic barriers in healthcare and employment"
          ]
        },
        {
          "number": 6,
          "title": "Relational Mapping & Social Transition Goals",
          "outline": [
            "Creating a phased 'Coming Out' or 'Letting In' plan as part of Manifesting Authenticity (M)",
            "Coaching through relationship shifts: Navigating partner, family, and workplace dynamics",
            "Boundary-setting protocols for unsupportive environments and 'chosen family' integration",
            "Addressing 'Social Dysphoria' through role-play and communication skill-building",
            "Planning for 'Public Authenticity': Managing visibility and safety in various social spheres"
          ]
        },
        {
          "number": 7,
          "title": "Advanced Risk Mitigation & Safety Planning",
          "outline": [
            "Developing trauma-informed crisis prevention plans for high-risk LGBTQ+ populations",
            "Identifying 'Red Flag' behaviors requiring immediate clinical escalation or emergency intervention",
            "Creating 'Digital Safety' plans for clients facing online harassment or doxxing",
            "Establishing 'Relapse Prevention' for maladaptive coping mechanisms (substance use, self-harm)",
            "Ensuring the Presence & Safety (P) container remains intact during high-stress life transitions"
          ]
        },
        {
          "number": 8,
          "title": "Longitudinal Care & Manifesting Long-Term Authenticity",
          "outline": [
            "Transitioning from 'Active Intervention' to 'Maintenance and Growth' phases",
            "Designing 'Authenticity Audits' to ensure long-term alignment with the PRISM framework",
            "Measuring longitudinal success: Quality of Life (QoL) indicators and community connectedness",
            "Planning for 'Post-Transition' identity evolution and the search for meaning",
            "Finalizing the L2 Graduation Project: A comprehensive 12-month client wellness roadmap"
          ]
        }
      ]
    },
    {
      "number": 22,
      "title": "L2: Ethical Considerations",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Defining the Scope of Practice: Coaching vs. Therapy",
          "outline": [
            "Analyzing the 'clinical line' in LGBTQ+ care: Distinguishing between minority stress coaching and clinical trauma therapy.",
            "Ethical protocols for high-risk scenarios, including suicidal ideation and acute gender dysphoria crises.",
            "The P.R.I.S.M. approach to referral: How to transition a client to clinical care while maintaining the 'Presence & Safety' container.",
            "Legal implications of 'practicing therapy without a license' in the context of gender-affirming support.",
            "Case studies on navigating the gray area between emotional wellness coaching and mental health intervention."
          ]
        },
        {
          "number": 2,
          "title": "Intersectionality and Power Dynamics in the Coaching Relationship",
          "outline": [
            "Deconstructing the inherent power imbalance between coach and client through an intersectional lens.",
            "Ethical responsibilities of the coach regarding cultural humility and 'Recognition of Identity'.",
            "Addressing 'Identity Blindness' and the ethical failure of applying universal wellness standards to marginalized bodies.",
            "Managing microaggressions and unconscious bias within the coaching container to prevent re-traumatization.",
            "Frameworks for equitable fee structures and accessibility as an ethical imperative in LGBTQ+ wellness."
          ]
        },
        {
          "number": 3,
          "title": "Navigating Dual Relationships in Small LGBTQ+ Communities",
          "outline": [
            "The 'Small World' phenomenon: Managing ethical boundaries when coach and client share social or activist spaces.",
            "Digital ethics and social media: Formulating policies for 'following,' 'friending,' and interacting with clients online.",
            "Confidentiality protocols for tight-knit communities where anonymity is difficult to maintain.",
            "Ethical decision-making models for 'accidental' disclosures in community settings (e.g., Pride events, support groups).",
            "Setting and maintaining 'Presence & Safety' boundaries without isolating the coach from their own community."
          ]
        },
        {
          "number": 4,
          "title": "Informed Consent and Autonomy in Gender-Affirming Care",
          "outline": [
            "The ethics of self-determination: Supporting client autonomy in medical and social transition goals.",
            "Coaching vs. Gatekeeping: The ethical implications of providing (or refusing) support for medical transition access.",
            "Informed consent as a continuous process: Navigating changing identities and 'detransition' or 're-transition' ethically.",
            "Ethical considerations for coaching LGBTQ+ youth and the nuances of parental involvement vs. minor privacy.",
            "Applying 'Strategic Wellness' to ensure clients are fully informed of the risks and benefits of various wellness paths."
          ]
        },
        {
          "number": 5,
          "title": "Trauma-Informed Ethics: Transference and Countertransference",
          "outline": [
            "Recognizing 'Trauma-Bonding' and its impact on the professional coaching relationship.",
            "Managing countertransference: When the coach's own lived experience or 'Inner Resilience' journey interferes with client progress.",
            "Ethical handling of eroticized transference and maintaining professional distance in queer-affirming spaces.",
            "Preventing secondary traumatic stress and burnout as an ethical obligation to the client's safety.",
            "The 'Wounded Healer' archetype: Utilizing self-awareness to prevent the projection of personal biases onto the client."
          ]
        },
        {
          "number": 6,
          "title": "Data Privacy and Legal Safeguards for Vulnerable Populations",
          "outline": [
            "Advanced HIPAA and GDPR compliance: Protecting 'Deadnames,' legal names, and sensitive transition data.",
            "Ethical documentation: Writing notes that affirm identity while protecting the client in potential legal or insurance audits.",
            "Navigating coaching ethics in hostile jurisdictions: Protecting clients in regions where LGBTQ+ identities are criminalized.",
            "Telehealth ethics: Ensuring 'Presence & Safety' through secure, encrypted platforms and private environments.",
            "The legalities of 'Manifesting Authenticity': Ethical marketing that avoids tokenization and protects client confidentiality."
          ]
        },
        {
          "number": 7,
          "title": "The Ethics of Advocacy and Professional Outness",
          "outline": [
            "Maintaining professional neutrality vs. the ethical call to social justice advocacy.",
            "The 'Out' Coach: The ethics of sharing personal identity and transition history as a tool for 'Recognition of Identity'.",
            "Conflicts of interest: Navigating roles in community organizing, non-profits, and private coaching practice.",
            "Ethical marketing to the LGBTQ+ community: Avoiding 'Rainbow Washing' and ensuring authentic representation.",
            "Advocacy as an extension of P.R.I.S.M.: When the coach is ethically required to speak out against systemic harm."
          ]
        },
        {
          "number": 8,
          "title": "Professional Integrity and the Ethics of Supervision",
          "outline": [
            "The role of peer supervision and clinical consultation in maintaining L2 ethical standards.",
            "Developing a personal 'Code of Ethics' aligned with the P.R.I.S.M. Framework™.",
            "Ethical self-audit: Tools for regularly assessing one's own biases, boundaries, and competency levels.",
            "The ethics of termination: Closing the coaching container in a way that fosters long-term 'Manifesting Authenticity'.",
            "Lifelong learning: The ethical mandate for continuing education in the rapidly evolving field of LGBTQ+ wellness."
          ]
        }
      ]
    },
    {
      "number": 23,
      "title": "L2: Advanced Techniques",
      "tier": "L2",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Somatic Resourcing for Chronic Minority Stress",
          "outline": [
            "Applying Polyvagal Theory to address the hypervigilance and 'body armor' common in LGBTQ+ populations.",
            "Advanced grounding techniques for managing acute identity-based triggers using the P.R.I.S.M. 'Presence & Safety' pillar.",
            "Developing a 'Somatic Safety Map' to help clients identify physical signals of internalized stigma.",
            "Integrating breathwork and progressive muscle relaxation specifically tailored for gender-affirming body awareness.",
            "Coaching clients through the somatic release of 'stored shame' within a trauma-informed container."
          ]
        },
        {
          "number": 2,
          "title": "Narrative Re-Authoring: Deconstructing Internalized Phobias",
          "outline": [
            "Utilizing externalization techniques to separate the client's core identity from internalized homophobia or transphobia.",
            "The 'Alternative Story' method: Shifting the client's life narrative from one of tragedy to one of queer resilience and joy.",
            "Deconstructing the 'Deficit Model' of LGBTQ+ wellness and replacing it with an asset-based identity framework.",
            "Advanced questioning techniques to uncover hidden scripts inherited from heteronormative or cisnormative upbringing.",
            "Practical application of the 'Recognition of Identity' pillar to foster self-compassion and authenticity."
          ]
        },
        {
          "number": 3,
          "title": "Advanced Healthcare Advocacy & Medical Gaslighting",
          "outline": [
            "Strategies for coaching clients to maintain agency during clinical encounters and medical transitions.",
            "Tools for identifying and navigating medical gaslighting in reproductive, gender-affirming, or primary care.",
            "Preparing clients for Gender-Affirming Surgery (GAS) through pre-operative emotional regulation and post-operative mental health planning.",
            "Navigating the psychological impact of insurance denials and systemic barriers to life-saving care.",
            "The coach’s role in facilitating patient-provider communication without overstepping into clinical advice."
          ]
        },
        {
          "number": 4,
          "title": "Intersectionality in Practice: Compounding Marginalization",
          "outline": [
            "Advanced power dynamic analysis within the coaching relationship for QTBIPOC (Queer/Trans Black, Indigenous, People of Color) clients.",
            "Addressing the intersection of religious trauma, spiritual reconciliation, and LGBTQ+ identity.",
            "Economic justice in wellness: Adapting 'Strategic Wellness' plans for clients facing housing or employment instability.",
            "Coaching through 'Double Minority Stress' where disability and LGBTQ+ identity intersect.",
            "Facilitating 'Code-Switching' deconstruction to promote authentic living across diverse social environments."
          ]
        },
        {
          "number": 5,
          "title": "Trauma-Informed Boundary Setting in Hostile Environments",
          "outline": [
            "The 'Grey Rock' method and other advanced protective strategies for clients in non-affirming family or work systems.",
            "Digital Boundary Coaching: Managing mental health and safety in the face of online harassment and social media fatigue.",
            "Workplace Advocacy: Coaching clients through the nuances of 'coming out' vs. 'inviting in' within professional settings.",
            "Managing the 'Emotional Labor' tax: Helping clients set boundaries around educating others on LGBTQ+ issues.",
            "Developing 'Exit Strategies' for social situations that compromise the 'Presence & Safety' of the client."
          ]
        },
        {
          "number": 6,
          "title": "Coaching the Neurodivergent LGBTQ+ Client",
          "outline": [
            "Understanding the 'Double Rainbow' intersection: The high prevalence of neurodivergence (Autism/ADHD) in gender-diverse populations.",
            "Adapting the P.R.I.S.M. Framework for executive dysfunction, sensory processing sensitivities, and literal communication styles.",
            "Executive function coaching for complex transition-related tasks (legal name changes, hormone schedules, etc.).",
            "Managing 'Autistic Burnout' vs. 'Minority Stress Burnout' in LGBTQ+ spaces.",
            "Sensory-friendly wellness planning: Designing environments and routines that honor both neurotype and identity."
          ]
        },
        {
          "number": 7,
          "title": "Trans-Affirming Somatic Experiencing & Body Neutrality",
          "outline": [
            "Moving beyond 'Body Positivity' to 'Body Neutrality' for clients experiencing significant gender dysphoria.",
            "Somatic exercises for managing the physical discomfort and emotional weight of chest binding, packing, or tucking.",
            "Proprioception and movement: Helping trans and non-binary clients reclaim their physical space through affirming exercise.",
            "Addressing the impact of medical transition (HRT) on sensory perception and emotional volatility.",
            "Reclaiming pleasure and intimacy: Coaching through the somatic shifts that occur during and after medical transition."
          ]
        },
        {
          "number": 8,
          "title": "Manifesting Authenticity: The Coach as a Catalyst for Advocacy",
          "outline": [
            "Transitioning clients from individual 'Inner Resilience' to collective 'Manifesting Authenticity'.",
            "Building sustainable peer-support networks and community resilience beyond the coaching container.",
            "The coach’s role in systemic advocacy: Supporting clients who wish to engage in public policy or community leadership.",
            "Legacy building: Coaching older LGBTQ+ adults through 'Generativity' and the passing on of queer history.",
            "Final Integration: Synthesizing the P.R.I.S.M. Framework into a long-term self-advocacy plan for the client."
          ]
        }
      ]
    },
    {
      "number": 24,
      "title": "L3: Master Practitioner Skills",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Somatic Presence: Regulating the Trauma-Informed Container",
          "outline": [
            "Mastering somatic tracking to identify subtle physiological cues of minority stress in clients",
            "Developing 'Limbic Resonance' and co-regulation techniques for high-arousal coaching sessions",
            "Advanced boundary setting: Navigating countertransference and emotional labor in LGBTQ+ coaching",
            "The architecture of the 'Holding Environment' for clients processing deep-seated identity trauma"
          ]
        },
        {
          "number": 2,
          "title": "Nuanced Intersectionality: Navigating Multi-Marginalized Identities",
          "outline": [
            "Advanced power-mapping: Analyzing the interplay of race, disability, and neurodivergence within the LGBTQ+ experience",
            "Coaching through the 'Double-Bind': Addressing unique stressors for QTBIPOC and disabled queer individuals",
            "Navigating 'Passing Privilege' and its impact on community belonging and internal identity validation",
            "Deconstructing religious trauma and spiritual abuse through a master-level intersectional lens"
          ]
        },
        {
          "number": 3,
          "title": "The Shadow Work of Coaching: Deconstructing Deep Internalized Stigma",
          "outline": [
            "Utilizing 'Parts Work' (Internal Family Systems concepts) to address the internalized oppressor",
            "Advanced cognitive deconstruction of 'Heteronormative Perfectionism' and its impact on wellness",
            "Coaching the 'Inner Child' through the lens of developmental delays caused by late-coming out",
            "Master-level self-compassion protocols for overcoming chronic shame and 'imposter syndrome' in identity"
          ]
        },
        {
          "number": 4,
          "title": "High-Stakes Strategic Wellness: Coaching Through Medical Transitions",
          "outline": [
            "Advanced support for gender-affirming surgery: Pre-operative mental preparation and post-operative holistic recovery",
            "Navigating medical gatekeeping: Empowering clients with self-advocacy tools for healthcare interactions",
            "The endocrine-wellness connection: Coaching clients on the metabolic and emotional shifts of HRT",
            "Designing long-term wellness maintenance plans for aging LGBTQ+ populations"
          ]
        },
        {
          "number": 5,
          "title": "Collective Authenticity: Group Dynamics and Community Healing",
          "outline": [
            "Mastering the facilitation of LGBTQ+ healing circles and group coaching environments",
            "Conflict resolution and 'Calling In' vs. 'Calling Out' within queer community spaces",
            "Fostering 'Chosen Family' dynamics: Coaching clients through social transition and community building",
            "The Master Practitioner as a community leader: Moving from individual coaching to systemic advocacy"
          ]
        },
        {
          "number": 6,
          "title": "Reflective Practice and Master-Level Supervision",
          "outline": [
            "The role of the Master Practitioner in peer supervision and mentoring emerging LGBTQ+ coaches",
            "Identifying 'Parallel Processes' in the coaching relationship: When the coach's journey mirrors the client's",
            "Mitigating vicarious trauma and compassion fatigue through advanced reflective journaling and supervision",
            "Developing a personal 'Ethic of Care' that balances professional excellence with radical authenticity"
          ]
        },
        {
          "number": 7,
          "title": "Crisis Intervention and Safety Planning for Marginalized Clients",
          "outline": [
            "Master-level risk assessment: Differentiating between coaching-appropriate distress and clinical crisis",
            "Collaborative safety planning for clients facing housing instability, domestic violence, or acute minority stress",
            "Navigating the legal and ethical nuances of mandatory reporting within marginalized communities",
            "Building a referral ecosystem: Partnering with therapists, medical providers, and legal aid"
          ]
        },
        {
          "number": 8,
          "title": "The Business of Mastery: Ethics, Branding, and Global Impact",
          "outline": [
            "Ethical marketing and branding for the Master Practitioner: Avoiding 'Rainbow Washing' and performative allyship",
            "Designing accessible and inclusive business models (sliding scales, pro-bono work, and corporate consulting)",
            "Contributing to the field: Utilizing the PRISM Framework™ for research, writing, and public speaking",
            "Legacy building: Establishing a sustainable and influential practice in the global LGBTQ+ wellness landscape"
          ]
        }
      ]
    },
    {
      "number": 25,
      "title": "L3: Supervision & Mentoring",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Architecture of Affirming Supervision",
          "outline": [
            "Defining the L3 Supervisory role: Distinguishing between clinical supervision, peer mentoring, and administrative oversight.",
            "Establishing the 'Supervisory Alliance' using the Presence & Safety (P) pillar to create a secure base for supervisees.",
            "Power dynamics in supervision: Navigating the hierarchy while maintaining an egalitarian, LGBTQ-affirming stance.",
            "The Seven-Eyed Model of Supervision adapted for the PRISM Framework™ methodology.",
            "Setting professional boundaries and 'gatekeeping' responsibilities for the integrity of the coaching profession."
          ]
        },
        {
          "number": 2,
          "title": "Parallel Processes: PRISM in the Supervisory Relationship",
          "outline": [
            "Identifying 'Parallel Process': How the coach-client dynamic is mirrored in the supervisor-supervisee relationship.",
            "Applying Recognition of Identity (R) to the supervisee: Addressing the supervisor's own biases and the supervisee's lived experience.",
            "Modeling Inner Resilience (I) for junior coaches facing vicarious trauma or compassion fatigue.",
            "Strategic Wellness (S) for the practitioner: Supervising the coach's self-care and professional sustainability.",
            "Manifesting Authenticity (M) in leadership: Helping supervisees find their unique coaching voice within affirming standards."
          ]
        },
        {
          "number": 3,
          "title": "Advanced Dynamics: Transference & Countertransference",
          "outline": [
            "Recognizing 'Eroticized Transference' and 'Identity-Based Countertransference' in LGBTQ+ coaching contexts.",
            "The 'Savior Complex' in affirming care: Supervising coaches who over-identify with client trauma.",
            "Addressing internalized stigma in the supervisee and its impact on the coaching container.",
            "Using the 'Internal Supervisor' technique to help coaches self-correct in real-time during sessions.",
            "Case studies on managing emotional reactivity when coaching clients with shared traumatic histories."
          ]
        },
        {
          "number": 4,
          "title": "Ethical Oversight & Risk Management for Leaders",
          "outline": [
            "Legal and ethical frameworks for L3 supervisors: Liability, documentation, and mandatory reporting standards.",
            "Managing high-risk scenarios: Supervising coaches through client crises, suicidality, and safety planning.",
            "Scope of practice enforcement: When and how to direct a supervisee to refer a client to clinical mental health services.",
            "The ethics of dual relationships in small or rural LGBTQ+ communities.",
            "Developing a 'Supervisory Contract' that outlines expectations, confidentiality, and dispute resolution."
          ]
        },
        {
          "number": 5,
          "title": "Mentoring for Intersectional Competence",
          "outline": [
            "Moving beyond '101' knowledge: Mentoring coaches in complex intersectionality (Race, Disability, Neurodivergence, and Queerness).",
            "The 'Cultural Humility' model in supervision: Encouraging supervisees to explore their 'blind spots' without shame.",
            "Analyzing case conceptualizations through the Recognition of Identity (R) lens for marginalized sub-populations.",
            "Techniques for challenging a supervisee's implicit biases regarding gender expression and non-traditional relationship structures.",
            "Fostering 'Global Affirmation': Mentoring coaches who work with international or culturally diverse LGBTQ+ clients."
          ]
        },
        {
          "number": 6,
          "title": "Evaluation, Feedback & Performance Metrics",
          "outline": [
            "Formative vs. Summative assessment: Tools for measuring a coach's growth in the PRISM Framework™.",
            "The 'Affirming Feedback Loop': Delivering critical corrections while maintaining the supervisee's Inner Resilience (I).",
            "Developing Key Performance Indicators (KPIs) for affirming wellness outcomes and client satisfaction.",
            "Video and audio review protocols: How to provide objective feedback on coaching presence and linguistic choices.",
            "Addressing 'Performance Anxiety' in junior coaches and building confidence through tiered autonomy."
          ]
        },
        {
          "number": 7,
          "title": "Facilitating Group Supervision & Peer Consultation",
          "outline": [
            "Structuring group supervision: The 'Fishbowl' technique and 'Case Conferencing' for LGBTQ+ practitioners.",
            "Managing group dynamics: Preventing lateral violence and fostering a collaborative learning environment.",
            "The role of the 'Moderator' in peer consultation groups: Ensuring adherence to the PRISM methodology.",
            "Using role-play and simulation as supervisory tools for mastering difficult conversations.",
            "Scaling supervision: Transitioning from 1-on-1 mentoring to leading a team of affirming coaches."
          ]
        },
        {
          "number": 8,
          "title": "Professional Legacy & The Future of Affirming Care",
          "outline": [
            "Developing a personal philosophy of mentorship: What kind of leader do you want to be in the LGBTQ+ community?",
            "Legacy building: Creating curriculum, workshops, and thought leadership as an L3 practitioner.",
            "The role of the supervisor in advocacy and systemic change within the wellness industry.",
            "Succession planning: Identifying and nurturing the next generation of LGBTQ+ affirming leaders.",
            "Final Synthesis: Integrating the PRISM Framework™ into a lifelong practice of professional excellence and community service."
          ]
        }
      ]
    },
    {
      "number": 26,
      "title": "L3: Program Development",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Conceptualizing Affirming Programs: Needs Assessment & Scoping",
          "outline": [
            "Conducting a comprehensive LGBTQ+ community needs assessment to identify service gaps in the current wellness market.",
            "Defining the program's 'North Star' using the P.R.I.S.M. Framework™ to ensure mission alignment from inception.",
            "Identifying specific sub-demographics (e.g., trans-masculine fitness, neurodivergent queer wellness) to avoid 'one-size-fits-all' pitfalls.",
            "Establishing the 'Presence & Safety' (P) baseline: Determining the required level of trauma-informed care for the program's specific scope.",
            "Feasibility analysis: Balancing clinical safety, coaching boundaries, and programmatic scalability."
          ]
        },
        {
          "number": 2,
          "title": "Curriculum Design: Layering Intersectionality into Content",
          "outline": [
            "Applying 'Recognition of Identity' (R) to curriculum architecture: Moving beyond binary health models in educational materials.",
            "Designing modular content that accounts for the 'double burden' of BIPOC LGBTQ+ individuals and other intersecting marginalized identities.",
            "Inclusive language auditing: Developing a programmatic style guide that evolves with community terminology.",
            "Integrating universal design for learning (UDL) to ensure accessibility for neurodivergent and disabled LGBTQ+ participants.",
            "Creating 'Identity-First' learning objectives that prioritize the client's lived experience over traditional clinical benchmarks."
          ]
        },
        {
          "number": 3,
          "title": "Facilitating Inner Resilience (I) in Group Environments",
          "outline": [
            "Adapting 'Inner Resilience' (I) tools—such as deconstructing minority stress—for group coaching and workshop formats.",
            "Managing group dynamics: Facilitating safe 'brave spaces' where participants can share experiences of stigma without re-traumatization.",
            "Peer-to-peer resilience building: Designing activities that foster collective self-compassion and shared emotional regulation strategies.",
            "Conflict resolution protocols: Addressing lateral violence or microaggressions within the program environment.",
            "The role of the coach as a 'Resilience Anchor' in high-intensity group discussions."
          ]
        },
        {
          "number": 4,
          "title": "Strategic Wellness (S) Protocols: Scalable Health Planning",
          "outline": [
            "Developing standardized 'Strategic Wellness' (S) templates for common LGBTQ+ goals (e.g., gender-affirming surgery prep, hormone health, sober queer living).",
            "The 'Clinical-to-Coaching' Bridge: Designing protocols for collaborating with medical providers within a programmatic structure.",
            "Nutritional and movement programming that honors gender-diverse bodies and resists 'diet culture' trauma.",
            "Sleep, stress, and endocrine health: Creating evidence-based modules that address the physiological impact of chronic minority stress.",
            "Customization at scale: Techniques for allowing participants to personalize their wellness roadmap within a structured program."
          ]
        },
        {
          "number": 5,
          "title": "Operationalizing Safety: Intake, Ethics, and Crisis Management",
          "outline": [
            "Advanced 'Presence & Safety' (P) operations: Designing intake forms that capture gender identity, pronouns, and trauma history ethically.",
            "Digital safety and privacy: Protecting the data of 'closeted' or high-risk participants in online program environments.",
            "Scope of practice boundaries: Establishing clear 'red flags' and referral triggers for mental health emergencies within a coaching program.",
            "Informed consent in a coaching context: Ensuring participants understand the limits and possibilities of affirming wellness programs.",
            "Building a vetted referral network: Integrating external LGBTQ+ specialists into the program's ecosystem."
          ]
        },
        {
          "number": 6,
          "title": "Manifesting Authenticity (M): Community & Advocacy Integration",
          "outline": [
            "Designing 'Manifesting Authenticity' (M) capstone projects that empower participants to live visibly and advocate for themselves.",
            "Fostering 'Community-as-Medicine': Strategies for building long-term alumni networks and peer support structures.",
            "Integrating social justice and advocacy: Helping participants navigate wellness within the context of systemic oppression.",
            "Visibility vs. Safety: Coaching participants on how to manifest authenticity at their own pace and comfort level.",
            "The 'Visibility Roadmap': Creating programmatic milestones for public-facing identity milestones (e.g., name changes, workplace coming out)."
          ]
        },
        {
          "number": 7,
          "title": "Measuring Impact: Data, Feedback, and Iteration",
          "outline": [
            "Selecting KPIs for LGBTQ+ wellness: Moving beyond weight or 'mood' to measure minority stress reduction and identity pride.",
            "Using the Affirming Coaching Impact Scale (ACIS) to gather quantitative data on program efficacy.",
            "Qualitative feedback loops: Conducting trauma-informed focus groups and exit interviews to refine program content.",
            "Iterative design: How to use participant data to update the P.R.I.S.M. application within the program every 6–12 months.",
            "Reporting outcomes: Communicating program success to stakeholders, community partners, or potential investors."
          ]
        },
        {
          "number": 8,
          "title": "Program Launch & Sustainability: Ethical Business Growth",
          "outline": [
            "Ethical marketing: Reaching the LGBTQ+ community without 'rainbow washing' or predatory sales tactics.",
            "Pricing for accessibility: Implementing sliding scales, scholarships, and 'pay-it-forward' models to ensure equity.",
            "Pilot program implementation: The 'Beta' phase strategy for testing new affirming content with a core group of stakeholders.",
            "Sustainability and Self-Care: Preventing coach burnout while managing high-empathy, high-impact LGBTQ+ programs.",
            "Scaling the P.R.I.S.M. Framework™: Moving from a single program to a multi-offering affirming wellness brand."
          ]
        }
      ]
    },
    {
      "number": 27,
      "title": "L3: Specialty Applications",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "LGBTQ+ Youth & Affirming Family Systems",
          "outline": [
            "Applying the P.R.I.S.M. Framework™ to minors: Navigating parental involvement and informed consent",
            "Coaching through developmental milestones: Puberty, social transition, and academic advocacy",
            "Deconstructing family-of-origin trauma while building 'chosen family' support networks",
            "Evidence-based strategies for reducing suicide risk and self-harm through identity validation",
            "Collaborating with school counselors and pediatricians for a multi-disciplinary wellness approach"
          ]
        },
        {
          "number": 2,
          "title": "Aging & Elder Care: The Golden Years of Queerness",
          "outline": [
            "Addressing the unique isolation risks and 're-closeting' in assisted living environments",
            "Navigating healthcare advocacy for LGBTQ+ seniors: Advance directives and end-of-life dignity",
            "Historical trauma: Coaching survivors of the HIV/AIDS crisis and pre-Stonewall eras",
            "Strategic Wellness for aging bodies: Managing chronic conditions and hormone therapy in later life",
            "Fostering intergenerational connection to combat loneliness and preserve community history"
          ]
        },
        {
          "number": 3,
          "title": "Neurodivergence & the Queer Intersection",
          "outline": [
            "The 'Double Rainbow' phenomenon: Exploring the high prevalence of neurodivergence (AuDHD) in LGBTQ+ populations",
            "Adapting coaching communication for sensory processing differences and executive dysfunction",
            "Deconstructing 'masking' as a survival mechanism in both neurotypical and heteronormative spaces",
            "Designing sensory-friendly wellness plans that honor neuro-affirming self-regulation",
            "Navigating the intersection of gender dysphoria and neurodivergent body awareness"
          ]
        },
        {
          "number": 4,
          "title": "Substance Use Recovery & Affirming Harm Reduction",
          "outline": [
            "Analyzing minority stress as a primary driver for disproportionate SUD rates in the community",
            "Trauma-informed harm reduction: Coaching clients through moderate use or total abstinence",
            "Navigating 'The Bar Scene' and finding sober queer community spaces",
            "Affirming alternatives to traditional 12-step programs: Secular and LGBTQ-specific recovery models",
            "Building Inner Resilience (I) to manage triggers related to internalized homophobia and transphobia"
          ]
        },
        {
          "number": 5,
          "title": "Family Planning, Fertility, & Queer Parenting",
          "outline": [
            "Coaching through the 'Medical-Industrial Complex': ART, IUI/IVF, and surrogacy for queer families",
            "Navigating the psychological impact of adoption and foster care systems on LGBTQ+ prospective parents",
            "Gender-neutral birthing and postpartum support for trans and non-binary parents",
            "Strategic Wellness for the 'Non-Gestational' parent: Bonding, legal protections, and identity shifts",
            "Manifesting Authenticity (M) in parenting: Raising children in affirming, non-heteronormative households"
          ]
        },
        {
          "number": 6,
          "title": "Athletes & Sports: Performance & Gender Inclusion",
          "outline": [
            "Physiological considerations: Coaching athletes on HRT and its impact on muscle mass, recovery, and stamina",
            "Navigating institutional barriers: Coaching clients through sports league policies and 'fairness' debates",
            "Body image and 'The Locker Room': Managing dysphoria in high-performance athletic environments",
            "The psychological toll of visibility: Supporting professional and amateur LGBTQ+ athletes in the public eye",
            "Designing training cycles that honor gender-affirming surgeries and recovery timelines"
          ]
        },
        {
          "number": 7,
          "title": "Chronic Illness & Disability: The Intersectional Body",
          "outline": [
            "Crip Theory in Coaching: Deconstructing 'wellness' standards that exclude disabled and chronically ill bodies",
            "Navigating medical gaslighting: Empowering clients to advocate for themselves in healthcare settings",
            "The 'Spoonie' Queer: Energy pacing and Strategic Wellness (S) for clients with limited physical capacity",
            "Addressing the intersection of physical accessibility and queer social spaces (Pride, bars, community centers)",
            "Building Inner Resilience (I) against the dual stigmas of ableism and queerphobia"
          ]
        },
        {
          "number": 8,
          "title": "Corporate Leadership & Workplace Authenticity",
          "outline": [
            "Executive coaching for LGBTQ+ leaders: Navigating the 'glass closet' and 'lavender ceiling'",
            "Strategic Wellness in the workplace: Managing microaggressions, misgendering, and emotional labor",
            "Translating individual authenticity into organizational change: Leading ERGs and DEI initiatives",
            "Boundary setting: Coaching clients on professional 'coming out' and privacy management",
            "Manifesting Authenticity (M) as a tool for professional influence and career longevity"
          ]
        }
      ]
    },
    {
      "number": 28,
      "title": "L3: Crisis & Complex Cases",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Defining the Scope: Crisis Intervention vs. Affirming Coaching",
          "outline": [
            "Establishing the 'Presence & Safety' (P) boundary: Distinguishing between coaching goals and clinical psychiatric emergencies.",
            "Identifying 'Red Flag' indicators: Recognizing the transition from minority stress to acute psychological crisis in LGBTQ+ clients.",
            "Legal and ethical frameworks for L3 coaches: Mandatory reporting, duty to warn, and liability in high-risk scenarios.",
            "The PRISM Crisis Protocol: Immediate steps to stabilize the coaching container when a client presents with complex acute distress.",
            "Differentiating between 'Normal' identity-based struggle and clinical pathology in a trauma-informed context."
          ]
        },
        {
          "number": 2,
          "title": "Suicide Risk Assessment & Affirming Safety Planning",
          "outline": [
            "Analyzing LGBTQ+ specific suicidality data: Understanding why traditional risk assessments often fail queer and trans individuals.",
            "The 'Safe-Container' approach: Implementing the PRISM framework to co-create safety plans that honor a client's chosen family and identity.",
            "Lethality assessment for coaches: Practical tools for evaluating ideation, intent, and means without triggering further trauma.",
            "Navigating the 'Warm Handoff': How to transition a high-risk client to emergency services while maintaining the coaching alliance.",
            "Post-vention strategies: Supporting the client's 'Inner Resilience' (I) after a period of acute suicidal ideation."
          ]
        },
        {
          "number": 3,
          "title": "Intimate Partner Violence (IPV) in LGBTQ+ Relationships",
          "outline": [
            "Deconstructing the 'Power and Control Wheel' for LGBTQ+ dynamics: Addressing 'outing' as a tool of abuse.",
            "Recognition of Identity (R): How intersectional factors (race, disability, immigration status) complicate IPV escape routes.",
            "Trauma-informed coaching for survivors: Building emotional regulation tools while the client is still in a high-risk environment.",
            "Resource mapping: Identifying LGBTQ-competent domestic violence shelters and legal advocacy groups.",
            "Safety planning for digital and physical transitions: Protecting the client's privacy and physical safety during separation."
          ]
        },
        {
          "number": 4,
          "title": "Complex Substance Use & Harm Reduction Strategies",
          "outline": [
            "The link between Minority Stress and maladaptive coping: Understanding substance use as a survival mechanism in the PRISM framework.",
            "Harm Reduction vs. Abstinence: Coaching clients through 'Strategic Wellness' (S) goals when traditional recovery models are exclusionary.",
            "Managing the 'Double Stigma': Addressing the intersection of addiction and LGBTQ+ identity in clinical and social settings.",
            "Identifying 'Rock Bottom' vs. 'Functional Struggle': Knowing when a client’s substance use requires a higher level of medical care.",
            "Coaching through relapse: Utilizing 'Inner Resilience' (I) to deconstruct shame and rebuild the wellness path."
          ]
        },
        {
          "number": 5,
          "title": "Navigating Complex Trauma (C-PTSD) & Dissociative Symptoms",
          "outline": [
            "Recognizing the somatic markers of C-PTSD: How chronic transphobia and homophobia manifest as physiological hyper-arousal.",
            "The Window of Tolerance: Coaching techniques to keep clients grounded during 'Manifesting Authenticity' (M) work.",
            "Dissociation and the Coaching Container: Protocols for when a client 'checks out' during a session.",
            "Intergenerational Trauma: Addressing the 'Recognition of Identity' (R) through the lens of historical LGBTQ+ oppression.",
            "Collaborative care: Working alongside trauma therapists to provide holistic support for clients with complex trauma histories."
          ]
        },
        {
          "number": 6,
          "title": "Medical Trauma & Emergency Healthcare Advocacy",
          "outline": [
            "The impact of 'Medical Gaslighting': Coaching clients who have been traumatized by previous healthcare interactions.",
            "Strategic Wellness (S) in the ER: Preparing trans and non-binary clients for emergency medical visits to minimize misgendering and harm.",
            "Patient Rights Advocacy: Empowering clients to use their voice and legal protections in hostile medical environments.",
            "Coaching through medical transition complications: Managing the psychological fallout of surgical delays or health setbacks.",
            "Building a 'Safe Provider' network: Helping clients curate a medical team that honors their PRISM identity profile."
          ]
        },
        {
          "number": 7,
          "title": "Housing Instability, Homelessness & Economic Crisis",
          "outline": [
            "The Wellness-Housing Connection: How 'Presence & Safety' (P) is compromised by precarious living situations.",
            "Coaching through scarcity: Adjusting wellness goals to be realistic and achievable for unhoused or low-income LGBTQ+ clients.",
            "Navigating the shelter system: Advocacy for trans-affirming housing and identifying safe local resources.",
            "Economic Resilience: Coaching on financial self-advocacy and navigating workplace discrimination during a crisis.",
            "Community Mutual Aid: Leveraging LGBTQ+ community networks as a core component of the client's safety and wellness plan."
          ]
        },
        {
          "number": 8,
          "title": "Ethical Termination & Crisis-Level Referral Pathways",
          "outline": [
            "The 'Warm Referral' Process: Step-by-step guide to transitioning a client to clinical care without causing a sense of abandonment.",
            "Documenting Crisis Interventions: Best practices for L3 coaches to record safety assessments and referral outcomes.",
            "Secondary Traumatic Stress: Implementing 'Inner Resilience' (I) for the coach to prevent burnout after handling complex cases.",
            "Closing the Container: How to ethically end a coaching relationship when the client's needs exceed the coach's scope of practice.",
            "Review of the PRISM Crisis Framework: Synthesizing the module's tools for long-term professional mastery."
          ]
        }
      ]
    },
    {
      "number": 29,
      "title": "L3: Master Integration",
      "tier": "L3",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "The Master Practitioner Mindset",
          "outline": [
            "Defining mastery within the P.R.I.S.M. Framework™: Moving from proficiency to intuitive application.",
            "Advanced self-supervision and reflexive practice: Analyzing the coach's own intersectional biases at a Tier 3 level.",
            "The 'Holding Space' at scale: Maintaining Presence & Safety (P) during high-intensity emotional releases.",
            "Integrating clinical intuition with evidence-based affirming protocols for complex client profiles.",
            "Cultivating the 'Master Guide' persona: Balancing authority with unconditional positive regard."
          ]
        },
        {
          "number": 2,
          "title": "Advanced P.R.I.S.M. Synthesis",
          "outline": [
            "Fluid transitions: Mastering the real-time movement between Recognition of Identity (R) and Inner Resilience (I).",
            "The 'Feedback Loop' of Strategic Wellness (S): How physical health outcomes reinforce psychological safety (P).",
            "Case analysis: Synthesizing all five pillars simultaneously during a single high-stakes coaching session.",
            "Advanced Manifesting Authenticity (M): Designing exit strategies that ensure long-term client autonomy and self-advocacy.",
            "The P.R.I.S.M. Audit: Developing a personal system for evaluating coaching efficacy across the framework."
          ]
        },
        {
          "number": 3,
          "title": "Navigating Multi-Layered Intersectionality",
          "outline": [
            "Advanced Recognition of Identity (R) for neurodivergent, BIPOC, and gender-diverse clients.",
            "Deconstructing 'Compulsory Cisheteronormativity' across varying cultural and religious contexts.",
            "Addressing 'Double Minority' stress: Specialized Inner Resilience (I) strategies for marginalized subgroups within the LGBTQ+ community.",
            "Strategic Wellness (S) for clients with conflicting identity-based needs (e.g., gender-affirming care vs. cultural family expectations).",
            "The intersection of disability and queer identity: Master-level accessibility in wellness coaching."
          ]
        },
        {
          "number": 4,
          "title": "Somatic Integration in LGBTQ+ Wellness",
          "outline": [
            "The neuroscience of gender dysphoria and its impact on somatic dysregulation and the nervous system.",
            "Advanced grounding and embodiment techniques specifically tailored for trans and non-binary clients in transition.",
            "Bridging the gap: Using the P.R.I.S.M. framework to connect mental resilience with physical body-trust.",
            "Trauma-informed non-touch somatic principles to enhance Inner Resilience (I) during coaching.",
            "Helping clients navigate 'Somatic Minority Stress': Reclaiming the body from internalized transphobia."
          ]
        },
        {
          "number": 5,
          "title": "Crisis Management & High-Stakes Advocacy",
          "outline": [
            "Navigating systemic failures: Supporting clients through medical gatekeeping and legal identity hurdles.",
            "Master-level advocacy: Empowering clients (M) to navigate hostile environments while maintaining Inner Resilience (I).",
            "Crisis intervention protocols: Identifying acute minority stress and managing referrals to clinical mental health teams.",
            "The coach’s role in the 'Safety Network': Ethical collaboration with therapists, doctors, and legal counsel.",
            "Strategic Wellness (S) in survival mode: Prioritizing health during periods of intense social or political marginalization."
          ]
        },
        {
          "number": 6,
          "title": "Community Impact & Ecosystem Design",
          "outline": [
            "Scaling the P.R.I.S.M. Framework™: Applying master-level coaching principles to groups and queer organizations.",
            "Designing affirming wellness programs: Creating sustainable 'Safe Containers' for community-based healing.",
            "Fostering 'Chosen Family' dynamics as a Strategic Wellness (S) intervention for isolated clients.",
            "The ethics of community leadership: Navigating visibility and influence as a Master Affirming Coach.",
            "Building community resilience: Moving from individual authenticity (M) to collective empowerment."
          ]
        },
        {
          "number": 7,
          "title": "Ethical Mastery & Professional Boundaries",
          "outline": [
            "Navigating 'Small World' ethics: Advanced management of dual relationships within tight-knit LGBTQ+ communities.",
            "Preventing compassion fatigue: Master-level boundaries for coaches working with high-trauma populations.",
            "Legal considerations and scope of practice: Ensuring Tier 3 mastery remains within the coaching domain.",
            "Developing a personal 'Ethical Compass' anchored in the P.R.I.S.M. values of safety and authenticity.",
            "Long-term sustainability: Building a high-impact practice without sacrificing the coach's own wellness."
          ]
        },
        {
          "number": 8,
          "title": "The Capstone: Authentic Leadership",
          "outline": [
            "The coach as a mirror: Final synthesis of Manifesting Authenticity (M) for both the practitioner and the client.",
            "Building a signature coaching methodology: Integrating P.R.I.S.M. into a unique professional brand.",
            "Continuous Professional Development (CPD): Contributing to the field’s body of knowledge through research or mentorship.",
            "Final Mastery Assessment: Demonstrating the ability to lead a client through the full P.R.I.S.M. journey in complex scenarios.",
            "The future of LGBTQ+ affirming wellness: Visionary leadership in a shifting social landscape."
          ]
        }
      ]
    },
    {
      "number": 30,
      "title": "L4: Building Your Practice",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Defining Your Affirming Niche & Unique Value Proposition",
          "outline": [
            "Identifying specific sub-populations within the LGBTQ+ community (e.g., neurodivergent queer youth, transmasculine fitness, LGBTQ+ elders) to focus your expertise.",
            "Conducting a market gap analysis to identify underserved wellness needs within the queer and trans ecosystem.",
            "Aligning your personal 'Why' with the P.R.I.S.M. Framework™ to create a mission-driven business identity.",
            "Crafting an 'Affirming Promise' that clearly communicates your specialized methodology and expected client outcomes.",
            "Evaluating the intersection of your lived experience and professional credentials to establish authority."
          ]
        },
        {
          "number": 2,
          "title": "Ethical Marketing & Authentic Brand Identity",
          "outline": [
            "Developing a visual brand identity that honors gender diversity and avoids stereotypical or performative 'pinkwashing' aesthetics.",
            "Implementing trauma-informed sales strategies that prioritize consent and psychological safety over high-pressure tactics.",
            "Content marketing strategies: Sharing expertise through the lens of 'Manifesting Authenticity' to build community trust.",
            "Ethical storytelling: How to use client success stories and testimonials while maintaining strict confidentiality and anonymity in sensitive contexts.",
            "Navigating social media algorithms while maintaining a 'safe space' digital environment for marginalized followers."
          ]
        },
        {
          "number": 3,
          "title": "Legal, Financial, and Inclusive Operational Systems",
          "outline": [
            "Establishing inclusive intake and legal forms that utilize gender-neutral language and respect chosen names/pronouns.",
            "Navigating HIPAA and GDPR compliance with a focus on protecting the privacy of trans and non-binary clients (e.g., deadname management).",
            "Financial modeling for equity: Implementing sliding scale fees, 'pay-it-forward' scholarships, and community-funded spots.",
            "Professional liability insurance considerations for specialized LGBTQ+ affirming wellness coaching.",
            "Selecting practice management software that supports diverse identity markers and secure communication."
          ]
        },
        {
          "number": 4,
          "title": "Digital Presence: SEO and Community Building",
          "outline": [
            "Optimizing your website for LGBTQ+ specific keywords (e.g., 'HRT-informed coach,' 'gender-affirming wellness') to reach those seeking specialized care.",
            "Building a 'Safe Space' digital container through newsletters, private forums, or community platforms.",
            "Accessibility as an affirming practice: Ensuring digital content is reachable for those with varying abilities and socioeconomic statuses.",
            "Collaborating with queer influencers and community leaders to expand reach and establish 'Recognition of Identity' within the digital space.",
            "Managing online criticism or 'trolling' while protecting your mental health and the safety of your digital community."
          ]
        },
        {
          "number": 5,
          "title": "Strategic Networking & Professional Ecosystems",
          "outline": [
            "Building a referral network of LGBTQ+ affirming providers, including endocrinologists, gender therapists, and inclusive primary care physicians.",
            "Collaborating with LGBTQ+ non-profits and community centers for workshops and health advocacy programs.",
            "Positioning yourself as a consultant for corporate wellness programs looking to improve their LGBTQ+ inclusion efforts.",
            "Attending and presenting at queer-focused professional conferences (e.g., WPATH, Philadelphia Trans Wellness Conference).",
            "Developing a 'Circle of Care' model that integrates your coaching into the client’s broader medical and social transition team."
          ]
        },
        {
          "number": 6,
          "title": "Scaling Your Practice: Group Programs & Digital Products",
          "outline": [
            "Designing and facilitating LGBTQ+ affirming group coaching programs that leverage community support and shared lived experience.",
            "Creating evergreen digital products (e.g., 'The Gender Transition Wellness Guide') to provide accessible support to a global audience.",
            "Developing a membership model for ongoing 'Strategic Wellness' maintenance and community connection.",
            "Automating business processes without losing the 'Presence & Safety' essential to affirming care.",
            "Assessing the feasibility of hiring associate coaches and training them in the P.R.I.S.M. Framework™."
          ]
        },
        {
          "number": 7,
          "title": "Measuring Impact: Outcomes, Data, and Case Studies",
          "outline": [
            "Developing quantitative and qualitative metrics to track client progress in areas of minority stress reduction and self-advocacy.",
            "Utilizing the 'Recognition of Identity' phase to create individualized KPIs (Key Performance Indicators) for diverse client goals.",
            "Writing and publishing professional case studies (with consent) to contribute to the growing body of LGBTQ+ wellness research.",
            "Demonstrating the 'ROI of Affirmation' to potential corporate partners or healthcare systems.",
            "Implementing regular feedback loops to ensure your practice remains responsive to the evolving needs of the LGBTQ+ community."
          ]
        },
        {
          "number": 8,
          "title": "Sustainable Practice Management & Coach Longevity",
          "outline": [
            "Mitigating compassion fatigue and secondary traumatic stress when working extensively with minority stress and systemic oppression.",
            "Establishing rigorous professional boundaries to prevent burnout in a community-centric business model.",
            "Creating a personal 'Inner Resilience' plan for the coach, including supervision, therapy, and peer support.",
            "Long-term legacy planning: How to mentor the next generation of LGBTQ+ affirming coaches.",
            "The ethics of 'Manifesting Authenticity' as a business owner: Balancing professional visibility with personal privacy."
          ]
        }
      ]
    },
    {
      "number": 31,
      "title": "L4: Marketing & Client Acquisition",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Ethical Affirming Brand Positioning",
          "outline": [
            "Defining your 'Affirming Authority' by integrating the PRISM Framework™ into your core brand narrative.",
            "The ethics of niche marketing: Avoiding 'pinkwashing' and ensuring genuine community-rooted branding.",
            "Communicating the value of L4-tier specialized coaching versus generalist wellness services.",
            "Establishing a brand voice that signals 'Presence & Safety' (P) and 'Recognition of Identity' (R) before the first contact.",
            "Crafting a unique value proposition (UVP) that addresses specific LGBTQ+ wellness disparities and minority stress."
          ]
        },
        {
          "number": 2,
          "title": "Niche Mastery & Intersectional Audience Segmentation",
          "outline": [
            "Moving beyond the 'LGBTQ+ Umbrella' to identify and serve targeted intersectional micro-niches.",
            "Analyzing market gaps in queer wellness (e.g., BIPOC Trans elders, neurodivergent queer youth, or sober LGBTQ+ spaces).",
            "Developing 'Client Avatars' based on lived experiences, specific transition goals, and systemic barriers.",
            "Tailoring marketing messages to address the unique 'Inner Resilience' (I) needs of different sub-communities.",
            "Conducting ethical market research within queer digital and physical spaces without being intrusive."
          ]
        },
        {
          "number": 3,
          "title": "Content Strategy for Radical Visibility",
          "outline": [
            "Developing educational content that deconstructs internalized stigma and promotes 'Manifesting Authenticity' (M).",
            "The 'Expert-Ally' content pillar: Balancing professional expertise with personal lived experience and visibility.",
            "Platform selection strategy: Identifying where the community gathers and how to navigate platform-specific safety concerns.",
            "Using storytelling and 'Strategic Wellness' (S) case studies to demonstrate real-world transformation while maintaining confidentiality.",
            "Creating a 90-day content calendar focused on building trust, authority, and community connection."
          ]
        },
        {
          "number": 4,
          "title": "Strategic Referral Ecosystems & Partnerships",
          "outline": [
            "Building professional bridges with gender-affirming medical providers, therapists, and endocrinologists.",
            "Collaborating with LGBTQ+ non-profits and community centers for mutual referral networks and program sponsorship.",
            "B2B Marketing: Positioning affirming coaching as a corporate DEI wellness solution for inclusive workplaces.",
            "Developing a 'Safety-First' referral protocol to ensure clients are passed between trusted, affirming practitioners.",
            "The role of community-based networking in 'Manifesting Authenticity' (M) and long-term business sustainability."
          ]
        },
        {
          "number": 5,
          "title": "High-Impact Launch Strategies for Affirming Programs",
          "outline": [
            "The psychology of the 'Affirming Launch': Avoiding high-pressure or scarcity tactics that trigger financial or systemic trauma.",
            "Designing 'Value-First' webinars and workshops that provide immediate 'Strategic Wellness' (S) tools.",
            "Pricing strategies for L4-tier programs: Balancing business viability with community accessibility (sliding scales vs. premium tiers).",
            "Managing waitlists and 'Early Bird' incentives through a lens of equity and inclusion.",
            "Post-launch analysis: Measuring success through both financial ROI and community impact metrics."
          ]
        },
        {
          "number": 6,
          "title": "SEO & Digital Presence for Affirming Search Terms",
          "outline": [
            "Advanced keyword research for gender-affirming, queer-inclusive, and transition-specific search terms.",
            "Optimizing website metadata and copy for 'Recognition of Identity' (R) and inclusive terminology.",
            "Local SEO for affirming coaches: Leveraging Google Business Profiles and local LGBTQ+ directories.",
            "Digital accessibility as a marketing tool: Ensuring your online presence is inclusive of all abilities and identities.",
            "Data privacy and security: Protecting client data in a digital marketing landscape where LGBTQ+ identity is sensitive."
          ]
        },
        {
          "number": 7,
          "title": "Trauma-Informed Sales & Discovery Conversations",
          "outline": [
            "Applying 'Presence & Safety' (P) to the sales process: Creating a pressure-free discovery call environment.",
            "Identifying 'Right-Fit' clients using a screening process that prioritizes client safety and coach competency.",
            "Handling objections related to financial trauma, systemic barriers, and previous negative experiences with the wellness industry.",
            "The 'Affirming Close': Empowering client agency and self-advocacy during the commitment phase.",
            "Developing a seamless onboarding process that reinforces the PRISM Framework™ from day one."
          ]
        },
        {
          "number": 8,
          "title": "Scaling with Integrity: From 1:1 to Collective Impact",
          "outline": [
            "Transitioning from individual coaching to group models and memberships without losing the affirming touch.",
            "Building membership communities focused on long-term 'Manifesting Authenticity' (M) and peer support.",
            "Ethical automation: Using technology to enhance the client experience while maintaining 'Presence' (P).",
            "Developing a 'Legacy Brand': Strategies for long-term influence and thought leadership within the LGBTQ+ wellness space.",
            "Scaling your impact: Moving from coach to community leader and industry advocate at the L4 level."
          ]
        }
      ]
    },
    {
      "number": 32,
      "title": "L4: Business Operations",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Strategic Business Design for Affirming Coaches",
          "outline": [
            "Defining the 'Affirming Business Model' vs. traditional wellness coaching structures.",
            "Integrating the P.R.I.S.M. Framework™ into the core mission, vision, and values of the enterprise.",
            "Conducting advanced market analysis for underserved LGBTQ+ sub-populations (e.g., TGNCNB elders, neurodivergent queer youth).",
            "Transitioning from a generalist L1/L2 practitioner to a high-impact L4 specialist and thought leader.",
            "Assessing the scalability of 'Presence & Safety' (P) within a growing business infrastructure."
          ]
        },
        {
          "number": 2,
          "title": "Legal Infrastructure & Ethical Risk Management",
          "outline": [
            "Drafting affirming service agreements, informed consent, and liability waivers tailored to LGBTQ+ needs.",
            "Advanced data privacy (HIPAA/GDPR) protocols for protecting gender-diverse client information and legal names.",
            "Navigating the legalities of 'coaching vs. therapy' boundaries when dealing with complex transition-related support.",
            "Insurance considerations: Professional liability, cyber-security, and specific coverage for affirming practices.",
            "Developing an internal Ethics Review Board process for complex client cases and business decisions."
          ]
        },
        {
          "number": 3,
          "title": "Inclusive Financial Management & Revenue Streams",
          "outline": [
            "Implementing 'Equity-Based Pricing' models and sustainable sliding scales without compromising business viability.",
            "Diversifying revenue: Balancing 1:1 high-ticket coaching with accessible group programs and digital products.",
            "Financial forecasting for the 'Pink Economy' and seasonal shifts in LGBTQ+ wellness demand.",
            "Exploring non-profit fiscal sponsorship and grant opportunities for community-focused wellness projects.",
            "Managing business overhead while maintaining a commitment to 'Strategic Wellness' (S) for the practitioner."
          ]
        },
        {
          "number": 4,
          "title": "Affirming Marketing & Brand Authenticity",
          "outline": [
            "Visual identity and branding: Avoiding 'Rainbow Washing' through genuine, intersectional representation.",
            "Content strategy: Leveraging 'Manifesting Authenticity' (M) to build trust through transparent storytelling.",
            "SEO and digital discoverability: Keywords and metadata strategies for gender-affirming and queer-inclusive search terms.",
            "Ethical sales psychology: Moving away from scarcity-based marketing toward community-empowerment models.",
            "Managing public-facing PR and community reputation in a politically charged climate."
          ]
        },
        {
          "number": 5,
          "title": "Client Experience Systems & Automation",
          "outline": [
            "Designing trauma-informed automated onboarding workflows that prioritize 'Recognition of Identity' (R).",
            "CRM selection and customization for gender-neutral data collection, pronoun tracking, and name changes.",
            "Automating client touchpoints to maintain 'Presence' (P) without increasing practitioner burnout.",
            "Client retention systems: Using data analytics to track outcomes and improve the long-term wellness journey.",
            "Feedback loops: Implementing inclusive 'Voice of the Client' mechanisms for continuous service improvement."
          ]
        },
        {
          "number": 6,
          "title": "Affirming Leadership & Team Operations",
          "outline": [
            "Recruitment and hiring strategies for building a diverse, queer-affirming team of contractors or employees.",
            "Creating an internal culture of 'Inner Resilience' (I) for staff to prevent secondary trauma and burnout.",
            "Standard Operating Procedures (SOPs) for delivering consistent, affirming care across multiple coaches.",
            "Delegation strategies for the L4 CEO: Moving from 'Doing' to 'Leading' while maintaining quality control.",
            "Performance management through a trauma-informed and anti-oppression lens."
          ]
        },
        {
          "number": 7,
          "title": "Strategic Alliances & Referral Networks",
          "outline": [
            "Building high-level B2B partnerships with gender-affirming medical providers and surgical centers.",
            "Collaborating with LGBTQ+ non-profits and corporate Employee Resource Groups (ERGs) for wellness consulting.",
            "Developing reciprocal referral systems that enhance the 'Strategic Wellness' (S) of the client through multi-disciplinary care.",
            "Networking within the 'Pink Economy': Building alliances with other queer-owned businesses for mutual growth.",
            "Contracting with insurance panels and third-party wellness platforms as an affirming specialist."
          ]
        },
        {
          "number": 8,
          "title": "Scaling Impact & Sustainable Growth",
          "outline": [
            "Transitioning from 'Time-for-Money' models to value-based scaling and intellectual property development.",
            "Building a legacy: Succession planning and the long-term sustainability of an affirming wellness brand.",
            "Measuring systemic impact: Moving beyond individual client success to community-level wellness outcomes.",
            "The L4 Exit Strategy: Preparing a business for sale, merger, or transition to a community-owned cooperative.",
            "Maintaining personal 'Inner Resilience' (I) as a leader during periods of rapid business expansion."
          ]
        }
      ]
    },
    {
      "number": 33,
      "title": "L4: Legal & Compliance",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Scope of Practice: The Coaching-Therapy Boundary",
          "outline": [
            "Defining the 'Legal Line': Distinguishing between wellness coaching and licensed mental health counseling in the context of gender dysphoria.",
            "Regulatory landscape: Analyzing state and international statutes regarding 'unlicensed practice' and how they apply to LGBTQ+ affirming care.",
            "Risk mitigation strategies: Implementing clear disclosure statements that define the PRISM Framework™ as a non-clinical wellness modality.",
            "Referral protocols: Establishing legally sound 'warm handoff' procedures for clients presenting with clinical pathologies or crisis needs.",
            "Case law review: Analyzing historical precedents where wellness practitioners exceeded scope in gender-affirming contexts."
          ]
        },
        {
          "number": 2,
          "title": "Data Privacy & Protecting Sensitive LGBTQ+ Information",
          "outline": [
            "Privacy beyond HIPAA: Implementing 'Privacy by Design' for sensitive data including transition status, HIV status, and chosen name/legal name discrepancies.",
            "GDPR and International Compliance: Managing data for global LGBTQ+ clients and the legal right to be forgotten or 'erased' (transition history).",
            "Encryption and Security: Technical requirements for protecting digital 'Presence & Safety' (P) in client communications and session notes.",
            "The 'Deadname' Dilemma: Legal protocols for storing legal names for billing while maintaining chosen names in coaching records to ensure psychological safety.",
            "Data breach response: Developing a compliance-heavy incident response plan specifically for marginalized populations at risk of outing."
          ]
        },
        {
          "number": 3,
          "title": "Affirming Contract Law & Service Agreements",
          "outline": [
            "Essential clauses: Drafting 'Informed Consent' documents that specifically address the experimental or holistic nature of some LGBTQ+ wellness practices.",
            "Dispute resolution: Incorporating mandatory mediation and choice-of-law clauses that favor affirming jurisdictions.",
            "Termination protocols: Legally sound methods for ending the coaching relationship when 'Strategic Wellness' (S) goals are no longer aligned or safe.",
            "Intellectual Property: Protecting your proprietary LGBTQ+ coaching tools and the PRISM-aligned methodologies within your service contracts.",
            "Force Majeure and LGBTQ+ Rights: Handling contract frustration due to shifting regional laws regarding gender-affirming care or LGBTQ+ assembly."
          ]
        },
        {
          "number": 4,
          "title": "Non-Discrimination Laws & Inclusive Business Compliance",
          "outline": [
            "Title VII and State-Level Protections: Understanding the coach's legal obligations as a business owner in providing equal access to services.",
            "Public Accommodations: Navigating the legalities of physical coaching spaces, gender-neutral facilities, and ADA compliance for intersectional clients.",
            "Employee and Contractor Management: Creating legally compliant HR policies for hiring queer and trans staff within a coaching practice.",
            "The 'Right to Refuse' vs. Discrimination: Defining the legal boundaries of 'niche' coaching to ensure compliance with civil rights legislation.",
            "Developing an Affirming Code of Conduct: Translating 'Manifesting Authenticity' (M) into a legally enforceable internal compliance document."
          ]
        },
        {
          "number": 5,
          "title": "Professional Liability & Risk Management Strategies",
          "outline": [
            "Insurance Architecture: Selecting Professional Indemnity and General Liability insurance that specifically covers LGBTQ+ affirming modalities.",
            "Incident Reporting: Establishing a rigorous 'Paper Trail' for adverse events to protect the practitioner from malpractice claims.",
            "Vicarious Liability: Understanding the legal risks when supervising other coaches or utilizing peer-support mentors in the PRISM Framework™.",
            "Risk Assessment Tools: Implementing 'Red Flag' screening during the 'Recognition of Identity' (R) phase to identify high-risk legal profiles.",
            "Mitigating 'Harm' Claims: Legal defenses against claims of 'conversion therapy' by ensuring all coaching is strictly affirming and client-led."
          ]
        },
        {
          "number": 6,
          "title": "Cross-Jurisdictional Regulations & Telehealth Compliance",
          "outline": [
            "The 'Border Problem': Navigating the legalities of coaching clients in states or countries where gender-affirming care is restricted or criminalized.",
            "Digital Presence: Legal requirements for website disclaimers and 'Terms of Use' when marketing to a global LGBTQ+ audience.",
            "Taxation and Business Nexus: Managing the financial compliance of a remote-first LGBTQ+ coaching business across multiple jurisdictions.",
            "International Human Rights Context: Understanding how the 'Yogyakarta Principles' influence the global legal landscape for wellness practitioners.",
            "Strategic Relocation: Legal considerations for coaches or clients moving between jurisdictions to maintain 'Strategic Wellness' (S) goals."
          ]
        },
        {
          "number": 7,
          "title": "Ethical Marketing & Truth in Advertising Compliance",
          "outline": [
            "FTC Guidelines for Wellness: Avoiding 'Deceptive Acts' when promoting the efficacy of the PRISM Framework™ in improving minority stress.",
            "Testimonial Legalities: Navigating the ethics and legalities of 'Success Stories' while protecting client anonymity and avoiding 'guaranteed outcomes'.",
            "Social Media Compliance: Legal risks of 'Outing' clients in marketing materials and the importance of specific photo/story release forms.",
            "Endorsements and Partnerships: Disclosing financial relationships when recommending gender-affirming products or medical providers.",
            "Inclusive Branding Law: Trademarking your LGBTQ+ specific programs while ensuring terminology remains compliant with evolving legal definitions."
          ]
        },
        {
          "number": 8,
          "title": "Documentation Standards & Forensic Record Keeping",
          "outline": [
            "The 'Legal Record': Best practices for note-taking that balance 'Recognition of Identity' (R) with the need for objective, defensible documentation.",
            "Retention Schedules: Legal requirements for how long to keep LGBTQ+ client files and the protocols for secure destruction.",
            "Subpoena Response: Developing a legal protocol for responding to court orders for client records, especially in custody or transition-related litigation.",
            "Third-Party Access: Managing legal requests for information from parents (for minors), spouses, or insurance companies.",
            "Audit-Proofing: Conducting internal compliance audits to ensure all 'Strategic Wellness' (S) plans are documented according to industry standards."
          ]
        }
      ]
    },
    {
      "number": 34,
      "title": "L4: Group Programs & Workshops",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "Advanced Group Facilitation & Container Building",
          "outline": [
            "Applying the 'Presence & Safety' (P) pillar to high-stakes group environments and large-scale workshops.",
            "The neurobiology of group safety: Creating a 'brave space' vs. 'safe space' for LGBTQ+ participants.",
            "Advanced techniques for holding a trauma-informed container during intense emotional processing.",
            "Managing power dynamics and the coach's role as a facilitator of collective healing rather than a singular authority."
          ]
        },
        {
          "number": 2,
          "title": "Navigating Intersectional Group Dynamics",
          "outline": [
            "Utilizing 'Recognition of Identity' (R) to manage diverse lived experiences within a single group setting.",
            "Addressing 'horizontal hostility' and internal community biases (e.g., cis-normativity or white-centrism) in group discussions.",
            "Conflict resolution strategies for intersectional friction points without triggering minority stress.",
            "Facilitating inclusive dialogue that honors the spectrum of gender, race, disability, and neurodivergence."
          ]
        },
        {
          "number": 3,
          "title": "Designing Transformative Multi-Week Series",
          "outline": [
            "Curriculum mapping: Integrating the PRISM Framework into 8, 10, and 12-week group coaching journeys.",
            "The arc of transformation: Sequencing 'Inner Resilience' (I) tools to build collective coping mechanisms.",
            "Balancing educational content with experiential processing and peer-to-peer connection.",
            "Developing participant workbooks and digital assets that reinforce 'Strategic Wellness' (S) between sessions."
          ]
        },
        {
          "number": 4,
          "title": "Mastering One-Day Intensives & Immersion Workshops",
          "outline": [
            "High-impact workshop design: Compressing the PRISM Framework for 4-8 hour intensive formats.",
            "Logistical safety: Ensuring physical and psychological security for trans and non-binary participants in public or rented venues.",
            "The 'Deep Dive' methodology: Facilitating rapid trust-building and breakthrough moments in short-duration programs.",
            "Post-workshop integration: Strategies for 'Manifesting Authenticity' (M) after the intensive ends."
          ]
        },
        {
          "number": 5,
          "title": "Peer Support Models vs. Group Coaching Mastery",
          "outline": [
            "Differentiating between peer-led support groups and professional L4-facilitated coaching programs.",
            "Leveraging collective wisdom: When to step back and allow the group to coach one another under supervision.",
            "Ethical boundaries in group settings: Managing dual relationships and confidentiality in tight-knit LGBTQ+ communities.",
            "Structuring 'Mastermind' style groups for LGBTQ+ entrepreneurs, activists, or professionals."
          ]
        },
        {
          "number": 6,
          "title": "Digital Facilitation & Hybrid Group Safety",
          "outline": [
            "Cyber-safety for LGBTQ+ groups: Preventing 'zoombombing' and protecting participant anonymity in digital spaces.",
            "Building digital intimacy: Creative techniques for fostering connection through a screen using 'Presence & Safety' (P).",
            "Hybrid workshop logistics: Managing simultaneous in-person and virtual participants without compromising engagement.",
            "Accessibility standards: Ensuring digital group programs are inclusive of neurodivergent and disabled community members."
          ]
        },
        {
          "number": 7,
          "title": "Outcome Measurement & Group Impact Assessment",
          "outline": [
            "Developing PRISM-aligned metrics to track the collective progress of a group program.",
            "Qualitative vs. Quantitative data: Using narrative feedback to refine 'Strategic Wellness' (S) interventions.",
            "The role of pre-and-post assessments in demonstrating program ROI for corporate or non-profit partnerships.",
            "Long-term impact tracking: Measuring community resilience and sustained 'Manifesting Authenticity' (M) post-program."
          ]
        },
        {
          "number": 8,
          "title": "Scaling Impact: From Group Coach to Community Leader",
          "outline": [
            "The business of group coaching: Pricing, marketing, and scaling 'one-to-many' affirming programs.",
            "Train-the-trainer models: Preparing to license your curriculum or mentor other coaches in your methodology.",
            "Developing community-wide wellness initiatives and advocacy-based workshops.",
            "Finalizing your L4 Group Program Blueprint: A capstone integration of the PRISM Framework for community-level change."
          ]
        }
      ]
    },
    {
      "number": 35,
      "title": "L4: Scaling & Growth",
      "tier": "L4",
      "has_quiz": true,
      "lessons": [
        {
          "number": 1,
          "title": "From Practitioner to Visionary: The Scaling Mindset",
          "outline": [
            "Transitioning from 1:1 coaching to agency leadership and systemic impact",
            "Identifying and overcoming the 'Founder's Trap' in LGBTQ+ advocacy work",
            "Defining core values and mission statements that scale without diluting the P.R.I.S.M. Framework™",
            "Strategic planning for 1-year, 3-year, and 5-year growth horizons",
            "Assessing readiness for scale: Financial, operational, and emotional indicators"
          ]
        },
        {
          "number": 2,
          "title": "High-Impact Group Coaching Models",
          "outline": [
            "Designing trauma-informed group containers that maintain 'Presence & Safety' at scale",
            "Curriculum design for queer and trans wellness cohorts: Balancing structure with lived-experience flexibility",
            "Managing group dynamics and intersectional conflict in larger coaching environments",
            "Leveraging peer-to-peer support to enhance 'Manifesting Authenticity' within the community",
            "Pricing and positioning group programs for maximum accessibility and profitability"
          ]
        },
        {
          "number": 3,
          "title": "Digital Ecosystems & Passive Revenue Streams",
          "outline": [
            "Developing evergreen digital products: Courses, workbooks, and membership sites",
            "Applying the P.R.I.S.M. Framework™ to self-paced learning environments",
            "Accessibility and inclusive design: Ensuring digital assets serve neurodivergent and disabled LGBTQ+ clients",
            "Marketing funnels that respect community boundaries and avoid predatory 'bro-marketing' tactics",
            "Tech stack selection for automated wellness delivery and client management"
          ]
        },
        {
          "number": 4,
          "title": "Institutional Partnerships & Corporate Wellness",
          "outline": [
            "Navigating DEI (Diversity, Equity, and Inclusion) budgets to fund affirming wellness initiatives",
            "Pitching 'Strategic Wellness' to HR departments and healthcare organizations",
            "Developing B2B service packages: From lunch-and-learns to executive coaching for LGBTQ+ leaders",
            "Measuring and reporting ROI (Return on Investment) and VOI (Value on Investment) for corporate clients",
            "Maintaining radical authenticity while operating within professional/corporate structures"
          ]
        },
        {
          "number": 5,
          "title": "Operational Excellence & Systems Automation",
          "outline": [
            "Developing Standard Operating Procedures (SOPs) that protect the quality of the P.R.I.S.M. methodology",
            "Automating the client journey: From intake and 'Recognition of Identity' to long-term follow-up",
            "Outsourcing and delegation: Hiring virtual assistants and specialists to reclaim the visionary’s time",
            "Data privacy and HIPAA-compliant scaling for sensitive LGBTQ+ wellness data",
            "Crisis management protocols for large-scale coaching operations"
          ]
        },
        {
          "number": 6,
          "title": "Building & Leading an Affirming Coaching Team",
          "outline": [
            "Recruitment strategies for hiring diverse, intersectional talent that aligns with P.R.I.S.M. values",
            "Internal training systems: Certifying your team in your specific coaching methodology",
            "Performance management and mentorship for associate coaches",
            "Fostering a collaborative, non-hierarchical culture within a growing wellness business",
            "Ethical considerations in profit-sharing and contractor vs. employee models"
          ]
        },
        {
          "number": 7,
          "title": "Financial Modeling for Sustainable Social Impact",
          "outline": [
            "Advanced financial planning: Profit and Loss (P&L) management for scaling agencies",
            "Integrating social impact: Sliding scales, scholarship funds, and 'Buy One, Give One' models",
            "Exploring grant funding and non-profit fiscal sponsorship for community wellness projects",
            "Diversifying revenue: Balancing high-ticket 1:1 work with low-barrier community offerings",
            "Tax strategies and legal structures for multi-faceted wellness businesses"
          ]
        },
        {
          "number": 8,
          "title": "Legacy Planning & The Future of Affirming Wellness",
          "outline": [
            "Succession planning: Preparing your business to thrive beyond your direct involvement",
            "Thought leadership: Publishing, public speaking, and influencing industry standards",
            "Using aggregated wellness data to advocate for systemic policy changes for LGBTQ+ healthcare",
            "Building a sustainable 'Manifesting Authenticity' legacy through community mentorship",
            "The evolution of the L4 coach: From business owner to movement leader"
          ]
        }
      ]
    },
    {
      "number": 36,
      "title": "L4: Certification & Final Review",
      "tier": "L4",
      "has_quiz": false,
      "lessons": [
        {
          "number": 1,
          "title": "Synthesis of the P.R.I.S.M. Framework™ at Mastery Level",
          "outline": [
            "Advanced integration: Moving fluidly between Presence, Recognition, Inner Resilience, Strategic Wellness, and Manifesting Authenticity in real-time sessions.",
            "The 'Invisible PRISM': Internalizing the framework so it informs coaching presence without feeling formulaic or rigid.",
            "Mapping the framework to complex, multi-layered client presentations involving intersectional identities and systemic barriers.",
            "Evaluating coaching efficacy through the lens of PRISM-specific outcomes and client self-actualization metrics.",
            "Demonstrating L4 mastery: How to articulate the framework's application during the certification oral review."
          ]
        },
        {
          "number": 2,
          "title": "Professional Standards and Scope of Practice for L4 Coaches",
          "outline": [
            "Defining the boundary: Distinguishing between Master-Level Wellness Coaching and Clinical Mental Health Therapy in LGBTQ+ contexts.",
            "Legal and ethical considerations for the 'Certified LGBTQ+ Affirming Wellness Coach™' designation across different jurisdictions.",
            "Advanced informed consent: Navigating complex disclosures, digital privacy, and international coaching regulations.",
            "The L4 Ethics Board: Understanding the process for handling ethical grievances and maintaining professional integrity.",
            "Case study: Resolving 'gray area' ethical dilemmas that arise in high-stakes, long-term coaching relationships."
          ]
        },
        {
          "number": 3,
          "title": "The Portfolio Defense: Documenting Clinical Competency",
          "outline": [
            "Structuring the L4 Capstone Portfolio: Requirements for the three mandatory, long-term case study submissions.",
            "Evidence-based documentation: How to use progress notes to demonstrate the application of the P.R.I.S.M. methodology.",
            "Recording and Transcribing: Best practices for selecting and preparing session recordings for certification review.",
            "Self-Reflective Practice: Writing the 'Coach’s Statement' detailing personal growth, biases addressed, and professional evolution.",
            "Outcome mapping: Visualizing client progress from intake to termination using standardized wellness assessments."
          ]
        },
        {
          "number": 4,
          "title": "Advanced Supervision and Peer Consultation Skills",
          "outline": [
            "The shift from supervisee to mentor: Developing the skills necessary to lead peer-consultation groups for L1-L3 coaches.",
            "Providing affirming feedback: Techniques for critiquing coaching sessions while maintaining psychological safety for the coach.",
            "Navigating countertransference at the L4 level: Managing the 'Expert' ego and maintaining humble inquiry.",
            "Establishing a sustainable supervision schedule for post-certification professional development.",
            "Collaborative problem-solving: Using the 'Mastermind' model to address systemic barriers facing the LGBTQ+ community."
          ]
        },
        {
          "number": 5,
          "title": "Data-Driven Wellness: Measuring Impact in LGBTQ+ Coaching",
          "outline": [
            "Selecting validated instruments: Using the Minority Stress Scale and Quality of Life indicators to track coaching success.",
            "Analyzing qualitative vs. quantitative data in a coaching context to refine strategic wellness plans.",
            "Reporting outcomes to stakeholders: How to present coaching efficacy data to corporate clients or healthcare partners.",
            "The role of the L4 coach in community-based research and contributing to the affirming wellness knowledge base.",
            "Developing personalized 'Success Dashboards' for clients to visualize their journey toward manifesting authenticity."
          ]
        },
        {
          "number": 6,
          "title": "Navigating High-Stakes Certification Scenarios",
          "outline": [
            "Simulation: Handling the 'Crisis at the Finish Line'—managing client emergencies during the certification recording phase.",
            "Addressing 'imposter syndrome' and performance anxiety during the final evaluation process.",
            "The Oral Examination: Strategies for articulating your coaching philosophy and theoretical grounding under pressure.",
            "Responding to assessor feedback: Demonstrating coachability and the ability to integrate high-level corrections.",
            "Standardized Patient/Client (SP) protocols: What to expect during the live performance evaluation."
          ]
        },
        {
          "number": 7,
          "title": "Post-Certification: Professional Branding and Leadership",
          "outline": [
            "Ethics of marketing: Representing the 'Certified LGBTQ+ Affirming Wellness Coach™' credential with accuracy and integrity.",
            "Developing a niche within the LGBTQ+ community: Transitioning from generalist to specialist (e.g., Trans-masculine wellness, Elder LGBTQ+ advocacy).",
            "The Coach as Thought Leader: Opportunities for public speaking, writing, and policy influence as an L4 professional.",
            "Building an affirming referral network: Vetting external providers to ensure a seamless continuum of care for clients.",
            "Financial sustainability: Pricing structures for master-level coaching and the ethics of sliding scales."
          ]
        },
        {
          "number": 8,
          "title": "Final Review and Comprehensive Exam Preparation",
          "outline": [
            "Tier 1-4 Synthesis: A comprehensive review of key concepts, from basic terminology to advanced neurobiology of trauma.",
            "P.R.I.S.M. Framework™ deep-dive: Final clarification on the nuances of each stage and their clinical applications.",
            "Exam mechanics: Reviewing the structure, timing, and passing criteria for the final written and practical examinations.",
            "Study strategies for the master-level learner: Creating a personalized review roadmap and resource library.",
            "The Path Forward: Continuing education requirements (CEUs) and the biennial recertification process."
          ]
        }
      ]
    }
  ]
}