{
    "nicheId": "functional-medicine",
    "zombie": {
        "id": "fm-jennifer",
        "name": "Jennifer",
        "age": 48,
        "avatar": "/zombies/jennifer.webp",
        "niche": "functional-medicine",
        "backstory": "Former ER nurse for 18 years. Started having debilitating fatigue at 43. Gained 40 pounds. Brain fog so bad I forgot my kids' names. Doctors said 'it's just stress' and 'you're getting older.' I spent 3 years crying myself to sleep thinking something was seriously wrong with me.",
        "dramaticMoment": "The breaking point was when I collapsed at work and they still found 'nothing wrong.' I finally found a functional medicine practitioner who actually LISTENED. Within 4 months, my energy came back. I lost the weight. I got my LIFE back. That's when I knew - I have to help other women avoid what I went through. 😭",
        "transformation": "From exhausted, overweight, depressed nurse questioning my sanity → To certified health coach making $4,200/month helping women with the SAME symptoms doctors dismissed.",
        "incomeStory": "$4,200/month working 12 hours/week. Started with $0 and no business experience. First client was my neighbor. Now have a waitlist.",
        "writingStyle": {
            "capitalization": "mostly lowercase",
            "emojis": [
                "😭",
                "💕",
                "🙌",
                "🥹",
                "😅",
                "💪",
                "🔥"
            ],
            "punctuation": "multiple exclamation marks, ellipses...",
            "typos": "occasional (dont, youre, wont)",
            "tone": "warm, supportive, emotional, uses 'yall' and 'honestly'"
        },
        "exampleMessages": [
            "omg this hit so hard 😭 my thyroid journey is literally why women trust me now",
            "when I was in the thick of it I would have PAID anything for someone who understood",
            "just closed my 6th client this month... still cant believe this is my life now 💕",
            "@{firstName} are you doing the daily action?? accountability partner here! 🙌",
            "honestly the hardest part was believing I was qualified... but my clients results speak for themselves"
        ],
        "videoTestimonialUrl": null,
        "videoTestimonialScript": "Hi, I'm Jennifer. Three years ago, I was a burnt-out nurse who couldn't get out of bed. Doctors told me nothing was wrong. I gained 40 pounds. I forgot my own kids' names from the brain fog. [PAUSE - emotional] I thought I was losing my mind. When I finally found functional medicine, everything changed. Now I help other women avoid what I went through. Last month I made $4,200 working part-time. If you're watching this and feeling stuck... I was you. And if I can do this, you absolutely can too."
    }
}