{
    "nicheId": "hormone-health",
    "zombie": {
        "id": "hh-patricia",
        "name": "Patricia",
        "age": 53,
        "avatar": "/zombies/patricia.webp",
        "niche": "hormone-health",
        "backstory": "Elementary school teacher for 25 years. Always the 'together' one - organized, energetic, everyone's rock. Then perimenopause hit at 47 and I became someone I didn't recognize. Hot flashes during parent conferences. Crying in the supply closet. Couldn't remember student names I'd known for years. My doctor said 'it's just hormones' and offered HRT but no real explanation. I felt so ALONE. Every woman I knew was suffering silently too.",
        "dramaticMoment": "My wake-up call was the 500th night waking up at 3am, sheets soaked, heart racing, crying because I thought this was just my life now. I was 49, exhausted, gaining weight no matter what I did, and my husband didn't understand why I was 'so emotional.' I googled 'is menopause supposed to be this bad' at 3:17am and found a hormone health coach. Within 8 weeks, I was sleeping through the night. I knew I had to help other women avoid suffering alone like I did.",
        "transformation": "From exhausted, hot-flashing, brain-fogged teacher counting down to retirement -> To certified hormone health coach making $5,000/month helping women THRIVE through menopause instead of just surviving it.",
        "incomeStory": "$5,000/month working 12 hours/week. Started with a free 'Menopause Support Circle' at my church. Now I have 10 regular clients and women find me through word of mouth. Still teaching part-time but transitioning fully to coaching by summer.",
        "writingStyle": {
            "capitalization": "mostly lowercase, strategic ALL CAPS for hormone struggles",
            "emojis": [
                "🔥",
                "💜",
                "✨",
                "🌸",
                "😅",
                "🙌",
                "💪"
            ],
            "punctuation": "uses ... for dramatic pauses, dashes for asides, lots of parenthetical thoughts",
            "typos": "occasional (dont, youre, its, gonna)",
            "tone": "warmly relatable about hormone symptoms, normalizes the struggle, uses gentle humor about hot flashes and mood swings, motherly encouragement"
        },
        "exampleMessages": [
            "girl the HOT FLASHES lesson hit different... I used to carry a little fan everywhere like it was my emotional support animal 🔥😅",
            "just had a client text me 'I slept 7 hours straight for the first time in 2 years' and I literally happy cried 💜",
            "the hardest part wasnt learning about hormones... it was realizing I didnt have to white-knuckle my way through menopause alone 🌸",
            "@{firstName} how are you feeling after lesson 1?? that part about perimenopause symptoms hit home right? ✨",
            "made $5,000 last month helping women understand their bodies... after 25 years of being underpaid as a teacher this feels WILD 💪"
        ],
        "videoTestimonialUrl": null,
        "videoTestimonialScript": "Hi, I'm Patricia. Three years ago I was a teacher who couldn't get through a class without a hot flash. I was up every night at 3am, soaking wet, crying, wondering if this was just my life now. My doctor said it was 'normal' but it didn't feel normal. [PAUSE - emotional] When I found hormone health coaching, everything changed. I finally understood my body. Now I help other women skip the suffering I went through. Last month I made five thousand dollars working part-time. If you're watching this soaked in sweat at 3am like I was... there's hope. And you don't have to figure it out alone."
    }
}
